[{"applicableLNs":{"contents":[{"contents":"spdx:AFL-1.2","tag":"LN"},[{"contents":"Academic Free License v1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","73950a2b858713c5706d23af86029d94"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","This license has been superseded by later versions. We found these notes here: https://web.archive.org/web/20100828113909/http://opensource.linux-mirror.org/licenses/afl-1.2.txt The following is intended to describe the essential differences between the Academic Free License (AFL) version 1.0 and other open source licenses: The Academic Free License is similar to the BSD, MIT, UoI/NCSA and Apache licenses in many respects but it is intended to solve a few problems with those licenses. * The AFL is written so as to make it clear what software is being licensed (by the inclusion of a statement following the copyright notice in the software). This way, the license functions better than a template license. The BSD, MIT and UoI/NCSA licenses apply to unidentified software. * The AFL contains a complete copyright grant to the software. The BSD and Apache licenses are vague and incomplete in that respect. * The AFL contains a complete patent grant to the software. The BSD, MIT, UoI/NCSA and Apache licenses rely on an implied patent license and contain no explicit patent grant. * The AFL makes it clear that no trademark rights are granted to the licensor's trademarks. The Apache license contains such a provision, but the BSD, MIT and UoI/NCSA licenses do not. * The AFL includes the warranty by the licensor that it either owns the copyright or that it is distributing the software under a license. None of the other licenses contain that warranty. All other warranties are disclaimed, as is the case for the other licenses. * The AFL is itself copyrighted (with the right granted to copy and distribute without modification). This ensures that the owner of the copyright to the license will control changes. The Apache license contains a copyright notice, but the BSD, MIT and UoI/NCSA licenses do not."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"Academic Free License\nVersion 1.2\n\nThis Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the\nfollowing notice immediately following the copyright notice for the Original Work:\n\n     Licensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the\nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available\ndocumentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>Academic Free License</p>\n\n         <p>Version 1.2</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>This Academic Free License applies to any original work of authorship (the &quot;Original Work&quot;) whose owner\n         (the &quot;Licensor&quot;) has placed the following notice immediately following the copyright notice for the\n         Original Work:</p>\n\n         <p>Licensed under the Academic Free License version 1.2</p>\n\n      </div>\n\n      <p>Grant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (&quot;You&quot;) a\n         world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy,\n         modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative\n         works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in\n         the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original\n         Work and derivative works thereof, subject to the following conditions.</p>\n\n      <p>Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all\n         copyright, patent or trademark notices from the Source Code of the Original Work, as well as any\n         notices of licensing and any descriptive text identified therein as an &quot;Attribution Notice.&quot; You must\n         cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice\n         reasonably calculated to inform recipients that You have modified the Original Work.</p>\n\n      <p>Exclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the\n         Original Work, nor any of their trademarks or service marks, may be used to endorse or promote\n         products derived from this Original Work without express prior written permission of the Licensor.</p>\n\n      <p>Warranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is\n         owned by the Licensor or that the Original Work is distributed by Licensor under a valid current\n         license from the copyright owner. Except as expressly stated in the immediately proceeding sentence,\n         the Original Work is provided under this License on an &quot;AS IS&quot; BASIS and WITHOUT WARRANTY, either\n         express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY\n         or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH\n         YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original\n         Work is granted hereunder except under this disclaimer.</p>\n\n      <p>Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including\n         negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct,\n         indirect, special, incidental, or consequential damages of any character arising as a result of this\n         License or the use of the Original Work including, without limitation, damages for loss of goodwill,\n         work stoppage, computer failure or malfunction, or any and all other commercial damages or losses.\n         This limitation of liability shall not apply to liability for death or personal injury resulting from\n         Licensor&apos;s negligence to the extent applicable law prohibits such limitation. Some jurisdictions do\n         not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and\n         limitation may not apply to You.</p>\n\n      <p>License to Source Code. The term &quot;Source Code&quot; means the preferred form of the Original Work for making\n         modifications to it and all available documentation describing how to modify the Original Work. Licensor\n         hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each\n         copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this\n         obligation by placing a machine-readable copy of the Source Code in an information repository\n         reasonably calculated to permit inexpensive and convenient access by You for as long as\n         Licensor continues to distribute the Original Work, and by publishing the address of that\n         information repository in a notice immediately following the copyright notice that applies to\n         the Original Work.</p>\n\n      <p>Mutual Termination for Patent Action. This License shall terminate automatically and You may no longer\n         exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging\n         that any OSI Certified open source software that is licensed under any license containing this &quot;Mutual\n         Termination for Patent Action&quot; clause infringes any patent claims that are essential to use that\n         software.</p>\n\n      <p>Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this\n         License or by law, and Licensor promises not to interfere with or be responsible for such uses by\n         You.</p>\n\n      <p>This license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.</p>\n\n      <p>Permission is hereby granted to copy and distribute this license without modification. This license\n         may not be modified without the express written permission of its copyright owner.</p>\n\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php"],"tag":"LicenseUrl"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":false,"isValid":false,"isWayBackLink":false,"match":"N/A","order":1,"timestamp":"2024-04-17T05:05:38Z","url":"http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php"},{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:05:43Z","url":"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":true,"licenseComments":"This license has been superseded by later versions. We found these notes here: https://web.archive.org/web/20100828113909/http://opensource.linux-mirror.org/licenses/afl-1.2.txt The following is intended to describe the essential differences between the Academic Free License (AFL) version 1.0 and other open source licenses: The Academic Free License is similar to the BSD, MIT, UoI/NCSA and Apache licenses in many respects but it is intended to solve a few problems with those licenses. * The AFL is written so as to make it clear what software is being licensed (by the inclusion of a statement following the copyright notice in the software). This way, the license functions better than a template license. The BSD, MIT and UoI/NCSA licenses apply to unidentified software. * The AFL contains a complete copyright grant to the software. The BSD and Apache licenses are vague and incomplete in that respect. * The AFL contains a complete patent grant to the software. The BSD, MIT, UoI/NCSA and Apache licenses rely on an implied patent license and contain no explicit patent grant. * The AFL makes it clear that no trademark rights are granted to the licensor's trademarks. The Apache license contains such a provision, but the BSD, MIT and UoI/NCSA licenses do not. * The AFL includes the warranty by the licensor that it either owns the copyright or that it is distributing the software under a license. None of the other licenses contain that warranty. All other warranties are disclaimed, as is the case for the other licenses. * The AFL is itself copyrighted (with the right granted to copy and distribute without modification). This ensures that the owner of the copyright to the license will control changes. The Apache license contains a copyright notice, but the BSD, MIT and UoI/NCSA licenses do not.","licenseId":"spdx:AFL-1.2","licenseText":"Academic Free License\nVersion 1.2\n\nThis Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the\nfollowing notice immediately following the copyright notice for the Original Work:\n\n     Licensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the\nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available\ndocumentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>Academic Free License</p>\n\n         <p>Version 1.2</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>This Academic Free License applies to any original work of authorship (the &quot;Original Work&quot;) whose owner\n         (the &quot;Licensor&quot;) has placed the following notice immediately following the copyright notice for the\n         Original Work:</p>\n\n         <p>Licensed under the Academic Free License version 1.2</p>\n\n      </div>\n\n      <p>Grant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (&quot;You&quot;) a\n         world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy,\n         modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative\n         works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in\n         the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original\n         Work and derivative works thereof, subject to the following conditions.</p>\n\n      <p>Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all\n         copyright, patent or trademark notices from the Source Code of the Original Work, as well as any\n         notices of licensing and any descriptive text identified therein as an &quot;Attribution Notice.&quot; You must\n         cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice\n         reasonably calculated to inform recipients that You have modified the Original Work.</p>\n\n      <p>Exclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the\n         Original Work, nor any of their trademarks or service marks, may be used to endorse or promote\n         products derived from this Original Work without express prior written permission of the Licensor.</p>\n\n      <p>Warranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is\n         owned by the Licensor or that the Original Work is distributed by Licensor under a valid current\n         license from the copyright owner. Except as expressly stated in the immediately proceeding sentence,\n         the Original Work is provided under this License on an &quot;AS IS&quot; BASIS and WITHOUT WARRANTY, either\n         express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY\n         or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH\n         YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original\n         Work is granted hereunder except under this disclaimer.</p>\n\n      <p>Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including\n         negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct,\n         indirect, special, incidental, or consequential damages of any character arising as a result of this\n         License or the use of the Original Work including, without limitation, damages for loss of goodwill,\n         work stoppage, computer failure or malfunction, or any and all other commercial damages or losses.\n         This limitation of liability shall not apply to liability for death or personal injury resulting from\n         Licensor&apos;s negligence to the extent applicable law prohibits such limitation. Some jurisdictions do\n         not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and\n         limitation may not apply to You.</p>\n\n      <p>License to Source Code. The term &quot;Source Code&quot; means the preferred form of the Original Work for making\n         modifications to it and all available documentation describing how to modify the Original Work. Licensor\n         hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each\n         copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this\n         obligation by placing a machine-readable copy of the Source Code in an information repository\n         reasonably calculated to permit inexpensive and convenient access by You for as long as\n         Licensor continues to distribute the Original Work, and by publishing the address of that\n         information repository in a notice immediately following the copyright notice that applies to\n         the Original Work.</p>\n\n      <p>Mutual Termination for Patent Action. This License shall terminate automatically and You may no longer\n         exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging\n         that any OSI Certified open source software that is licensed under any license containing this &quot;Mutual\n         Termination for Patent Action&quot; clause infringes any patent claims that are essential to use that\n         software.</p>\n\n      <p>Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this\n         License or by law, and Licensor promises not to interfere with or be responsible for such uses by\n         You.</p>\n\n      <p>This license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.</p>\n\n      <p>Permission is hereby granted to copy and distribute this license without modification. This license\n         may not be modified without the express written permission of its copyright owner.</p>\n\n    ","name":"Academic Free License v1.2","seeAlso":["http://opensource.linux-mirror.org/licenses/afl-1.2.txt","http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php"],"standardLicenseTemplate":"<<beginOptional>>Academic Free License\n\nVersion 1.2\n\n<<endOptional>><<beginOptional>> This Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 1.2\n\n<<endOptional>>\n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the following conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n\n"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"google:AFL12","tag":"LN"},[{"contents":"spdx:AFL-1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","d121ac48d59ba35a9743d0e52eebfe7e"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:AFL12","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:AFL-1.2"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":"BlueOak:AFL-1.2","tag":"LN"},[{"contents":"Academic Free License v1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","c2b6b12086db746f15dcb7e9016dad0d"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Bronze",{"contents":"These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/AFL-1.2.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Bronze","These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.",{"_id":"AFL-1.2","_name":"Academic Free License v1.2","_url":"https://spdx.org/licenses/AFL-1.2.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"scancode:afl-1.2","tag":"LN"},[{"contents":"AFL 1.2","tag":"LN"},{"contents":"Academic Free License 1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","a2bc4d08e9be5007c576afb765729dc4"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":"https://spdx.org/licenses/AFL-1.2.html","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license has been superseded by later versions. This\nlicense was OSI certified.\n"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[null,"http://opensource-definition.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},{"contents":[null,"https://spdx.org/licenses/AFL-1.2.html"],"tag":"LicenseUrl"},{"contents":[null,"http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php"],"tag":"LicenseUrl"},{"contents":[null,"http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"],"tag":"LicenseUrl"},{"contents":"Academic Free License\n\t\tVersion 1.2\n\nThis Academic Free License applies to any original work of authorship \n(the \"Original Work\") whose owner (the \"Licensor\") has placed the \nfollowing notice immediately following the copyright notice for the \nOriginal Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a \ncopy of the Original Work (\"You\") a world-wide, royalty-free, \nnon-exclusive, perpetual, non-sublicenseable license (1) to use, copy, \nmodify, merge, publish, perform, distribute and/or sell copies of the \nOriginal Work and derivative works thereof, and (2) under patent claims \nowned or controlled by the Licensor that are embodied in the Original \nWork as furnished by the Licensor, to make, use, sell and offer for \nsale the Original Work and derivative works thereof, subject to the \nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any \nDerivative Works that You create, all copyright, patent or trademark \nnotices from the Source Code of the Original Work, as well as any \nnotices of licensing and any descriptive text identified therein as an \n\"Attribution Notice.\" You must cause the Source Code for any Derivative \nWorks that You create to carry a prominent Attribution Notice reasonably \ncalculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the \nnames of any contributors to the Original Work, nor any of their \ntrademarks or service marks, may be used to endorse or promote products \nderived from this Original Work without express prior written permission \nof the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright \nin and to the Original Work is owned by the Licensor or that the Original \nWork is distributed by Licensor under a valid current license from the \ncopyright owner. Except as expressly stated in the immediately proceeding \nsentence, the Original Work is provided under this License on an \"AS IS\" \nBASIS and WITHOUT WARRANTY, either express or implied, including, without \nlimitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL \nWORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part \nof this License. No license to Original Work is granted hereunder except \nunder this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, \nwhether in tort (including negligence), contract, or otherwise, shall the \nLicensor be liable to any person for any direct, indirect, special, \nincidental, or consequential damages of any character arising as a result \nof this License or the use of the Original Work including, without \nlimitation, damages for loss of goodwill, work stoppage, computer failure \nor malfunction, or any and all other commercial damages or losses. This \nlimitation of liability shall not apply to liability for death or personal \ninjury resulting from Licensor's negligence to the extent applicable law \nprohibits such limitation. Some jurisdictions do not allow the exclusion or \nlimitation of incidental or consequential damages, so this exclusion and \nlimitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of \nthe Original Work for making modifications to it and all available \ndocumentation describing how to modify the Original Work. Licensor hereby \nagrees to provide a machine-readable copy of the Source Code of the Original \nWork along with each copy of the Original Work that Licensor distributes. \nLicensor reserves the right to satisfy this obligation by placing a \nmachine-readable copy of the Source Code in an information repository \nreasonably calculated to permit inexpensive and convenient access by You for \nas long as Licensor continues to distribute the Original Work, and by \npublishing the address of that information repository in a notice immediately \nfollowing the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate \nautomatically and You may no longer exercise any of the rights granted to You \nby this License if You file a lawsuit in any court alleging that any OSI \nCertified open source software that is licensed under any license containing \nthis \"Mutual Termination for Patent Action\" clause infringes any patent \nclaims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise \nrestricted or conditioned by this License or by law, and Licensor promises \nnot to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without \nmodification. This license may not be modified without the express written \npermission of its copyright owner.","tag":"LicenseText"}],"raw":{"_category":"Permissive","_homepageUrl":"https://spdx.org/licenses/AFL-1.2.html","_key":"afl-1.2","_name":"Academic Free License 1.2","_notes":"Per SPDX.org, this license has been superseded by later versions. This\nlicense was OSI certified.\n","_osiUrl":null,"_otherUrls":["http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php","http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"],"_owner":"Lawrence Rosen","_shortName":"AFL 1.2","_spdxId":"AFL-1.2","_text":"Academic Free License\n\t\tVersion 1.2\n\nThis Academic Free License applies to any original work of authorship \n(the \"Original Work\") whose owner (the \"Licensor\") has placed the \nfollowing notice immediately following the copyright notice for the \nOriginal Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a \ncopy of the Original Work (\"You\") a world-wide, royalty-free, \nnon-exclusive, perpetual, non-sublicenseable license (1) to use, copy, \nmodify, merge, publish, perform, distribute and/or sell copies of the \nOriginal Work and derivative works thereof, and (2) under patent claims \nowned or controlled by the Licensor that are embodied in the Original \nWork as furnished by the Licensor, to make, use, sell and offer for \nsale the Original Work and derivative works thereof, subject to the \nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any \nDerivative Works that You create, all copyright, patent or trademark \nnotices from the Source Code of the Original Work, as well as any \nnotices of licensing and any descriptive text identified therein as an \n\"Attribution Notice.\" You must cause the Source Code for any Derivative \nWorks that You create to carry a prominent Attribution Notice reasonably \ncalculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the \nnames of any contributors to the Original Work, nor any of their \ntrademarks or service marks, may be used to endorse or promote products \nderived from this Original Work without express prior written permission \nof the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright \nin and to the Original Work is owned by the Licensor or that the Original \nWork is distributed by Licensor under a valid current license from the \ncopyright owner. Except as expressly stated in the immediately proceeding \nsentence, the Original Work is provided under this License on an \"AS IS\" \nBASIS and WITHOUT WARRANTY, either express or implied, including, without \nlimitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL \nWORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part \nof this License. No license to Original Work is granted hereunder except \nunder this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, \nwhether in tort (including negligence), contract, or otherwise, shall the \nLicensor be liable to any person for any direct, indirect, special, \nincidental, or consequential damages of any character arising as a result \nof this License or the use of the Original Work including, without \nlimitation, damages for loss of goodwill, work stoppage, computer failure \nor malfunction, or any and all other commercial damages or losses. This \nlimitation of liability shall not apply to liability for death or personal \ninjury resulting from Licensor's negligence to the extent applicable law \nprohibits such limitation. Some jurisdictions do not allow the exclusion or \nlimitation of incidental or consequential damages, so this exclusion and \nlimitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of \nthe Original Work for making modifications to it and all available \ndocumentation describing how to modify the Original Work. Licensor hereby \nagrees to provide a machine-readable copy of the Source Code of the Original \nWork along with each copy of the Original Work that Licensor distributes. \nLicensor reserves the right to satisfy this obligation by placing a \nmachine-readable copy of the Source Code in an information repository \nreasonably calculated to permit inexpensive and convenient access by You for \nas long as Licensor continues to distribute the Original Work, and by \npublishing the address of that information repository in a notice immediately \nfollowing the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate \nautomatically and You may no longer exercise any of the rights granted to You \nby this License if You file a lawsuit in any court alleging that any OSI \nCertified open source software that is licensed under any license containing \nthis \"Mutual Termination for Patent Action\" clause infringes any patent \nclaims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise \nrestricted or conditioned by this License or by law, and Licensor promises \nnot to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without \nmodification. This license may not be modified without the express written \npermission of its copyright owner.","_textUrls":["http://opensource-definition.org/licenses/afl-1.2.txt","http://opensource.linux-mirror.org/licenses/afl-1.2.txt","https://spdx.org/licenses/AFL-1.2.html"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:AFL-1.2","tag":"LN"},[{"contents":"Academic Free License v1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","2e2e6355ec2dd359feb3963f878ba7ed"],"impliedStmts":[{"contents":{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","This license has been superseded by later versions. We found these notes here: https://web.archive.org/web/20100828113909/http://opensource.linux-mirror.org/licenses/afl-1.2.txt The following is intended to describe the essential differences between the Academic Free License (AFL) version 1.0 and other open source licenses: The Academic Free License is similar to the BSD, MIT, UoI/NCSA and Apache licenses in many respects but it is intended to solve a few problems with those licenses. * The AFL is written so as to make it clear what software is being licensed (by the inclusion of a statement following the copyright notice in the software). This way, the license functions better than a template license. The BSD, MIT and UoI/NCSA licenses apply to unidentified software. * The AFL contains a complete copyright grant to the software. The BSD and Apache licenses are vague and incomplete in that respect. * The AFL contains a complete patent grant to the software. The BSD, MIT, UoI/NCSA and Apache licenses rely on an implied patent license and contain no explicit patent grant. * The AFL makes it clear that no trademark rights are granted to the licensor's trademarks. The Apache license contains such a provision, but the BSD, MIT and UoI/NCSA licenses do not. * The AFL includes the warranty by the licensor that it either owns the copyright or that it is distributing the software under a license. None of the other licenses contain that warranty. All other warranties are disclaimed, as is the case for the other licenses. * The AFL is itself copyrighted (with the right granted to copy and distribute without modification). This ensures that the owner of the copyright to the license will control changes. The Apache license contains a copyright notice, but the BSD, MIT and UoI/NCSA licenses do not."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"Academic Free License\n\nVersion 1.2 This Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the following conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Academic Free License v1.2","_rf_notes":"This license has been superseded by later versions. We found these notes here: https://web.archive.org/web/20100828113909/http://opensource.linux-mirror.org/licenses/afl-1.2.txt The following is intended to describe the essential differences between the Academic Free License (AFL) version 1.0 and other open source licenses: The Academic Free License is similar to the BSD, MIT, UoI/NCSA and Apache licenses in many respects but it is intended to solve a few problems with those licenses. * The AFL is written so as to make it clear what software is being licensed (by the inclusion of a statement following the copyright notice in the software). This way, the license functions better than a template license. The BSD, MIT and UoI/NCSA licenses apply to unidentified software. * The AFL contains a complete copyright grant to the software. The BSD and Apache licenses are vague and incomplete in that respect. * The AFL contains a complete patent grant to the software. The BSD, MIT, UoI/NCSA and Apache licenses rely on an implied patent license and contain no explicit patent grant. * The AFL makes it clear that no trademark rights are granted to the licensor's trademarks. The Apache license contains such a provision, but the BSD, MIT and UoI/NCSA licenses do not. * The AFL includes the warranty by the licensor that it either owns the copyright or that it is distributing the software under a license. None of the other licenses contain that warranty. All other warranties are disclaimed, as is the case for the other licenses. * The AFL is itself copyrighted (with the right granted to copy and distribute without modification). This ensures that the owner of the copyright to the license will control changes. The Apache license contains a copyright notice, but the BSD, MIT and UoI/NCSA licenses do not.","_rf_risk":null,"_rf_shortname":"fossology:AFL-1.2","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"Academic Free License\n\nVersion 1.2 This Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the following conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","_rf_text_updatable":false,"_rf_url":"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:AFL-1.2","tag":"LN"},"id":["OrtLicenseCategorization","2e1ef4649f7f0a3af38fabe95f008647"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"permissive"},{"description":null,"name":"include-in-notice-file"}],"_olcLicensename":"SPDX:AFL-1.2"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:AFL-1.2","tag":"LN"},"id":["OrtLicenseCategorization","848fe8b4e9ab77c35c98302d9b5571ce"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"contents":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:patent-clause",{"contents":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","name":"permissive"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"},{"description":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","name":"property:patent-clause"}],"_olcLicensename":"SPDX:AFL-1.2"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:AFL-1.2","tag":"LN"},[{"contents":"AFL-1.2","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","2cb6bbba3cd1924d574d77da6d191e2b"],"impliedStmts":[],"raw":{"_clcAlias":["AFL-1.2"],"_clcName":"cavil:AFL-1.2"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Academic Free License 1.2","tag":"LN"},[{"contents":"spdx:AFL-1.2","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"AFL","tag":"LN"},{"contents":"AFL, Version 1.2","tag":"LN"},{"contents":"AFL, 1.2","tag":"LN"},{"contents":"AFL-1.2","tag":"LN"},{"contents":"scancode:afl-1.2","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","1ae3cd3e2641ca6c54244bc0f2ca9323"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prfung seitens Open CoDE sowohl der Open Source Definition (gem Definition der Open Source Initiative [extern]) entspricht und darber hinaus keine fr die ffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Auer in Ausnahmefllen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["AFL, Version 1.2","AFL, 1.2","AFL-1.2"],"_canonicalName":"metaeffekt:Academic Free License 1.2","_category":"AFL","_openCoDEStatus":"approved","_otherIds":["scancode:afl-1.2"],"_shortName":null,"_spdxIdentifier":"spdx:AFL-1.2"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"spdx:AFL-1.2","tag":"LN"},[{"contents":"Academic Free License v1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["HermineLicense","354e69d2820abe8e39cce746efda9e82"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["HermineLicense","FOSS - deduced",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["HermineLicense","11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C.  101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":"","tag":"LicenseText"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-1.2.txt"],"tag":"LicenseUrl"},{"contents":"\"AFL-1.2\" is a license with a patent grant","tag":"LicenseStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense","\"AFL-1.2\" is of radical: AFL"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"autoupgrade":false,"comment":"11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C.  101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.","copyleft":"None","ethical_clause":false,"foss":"Yes-Auto","fsf_approved":true,"inspiration_spdx":"","law_choice":"Laws of the jurisdiction excluding its conflict-of-law provisions","license_version":"1.2","long_name":"Academic Free License v1.2","non_commercial":false,"non_tivoisation":false,"obligations":[{"generic":[{"description":"Make the corresponding source code available (including modifications):\r\n-at the time of distribution of the software and on the same medium;\r\n-by including a written offer allowing others to obtain it;\r\n-by making it available online.","metacategory":"ProvidingSourceCode","name":"Providing CSC to end user","passivity":"Active"}],"license":["AFL-1.2"],"name":"Providing machine-readable copy of the Source Code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work."},{"generic":[{"description":"Document all your modifications made in the source code of third-party Open Source components in order to clearly attribute each contribution.","metacategory":"Mentions","name":"Track and mention modifications in the source code","passivity":"Active"}],"license":["AFL-1.2"],"name":"Marking modifications in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work."},{"generic":[{"description":"Keep all legal notices and license texts intact in the Source Code, including in the headers.","metacategory":"Mentions","name":"Preserve legal mentions in source code","passivity":"Active"}],"license":["AFL-1.2"],"name":"Preserve License and notices in source code","passivity":"","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\""},{"generic":[{"description":"Enforcing patents against licensees or making a non-infringement agreement contrary to the license is prohibited and/or terminates your rights under the license.","metacategory":"IPManagement","name":"Do not enforce patent rights (Patent peace)","passivity":"Passive"}],"license":["AFL-1.2"],"name":"Patent peace (broad)","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"Mutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software."},{"generic":[{"description":"Dont use elements of the project that may be covered by Trademark Law (project name, logo) except as required for reasonable and customary use in describing the origin of the program.","metacategory":"Communication","name":"Respect trademarks","passivity":"Passive"}],"license":["AFL-1.2"],"name":"Respect trademarks","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"Exclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor."},{"generic":[{"description":"Names of the project or associated persons (authors, contributors, etc.) are not to be used for commercial or promotional purposes.","metacategory":"Communication","name":"Do not use project or contributor names for endorsement or promotion.","passivity":"Passive"}],"license":["AFL-1.2"],"name":"No use of names for endorsment","passivity":"","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"Exclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor."}],"osi_approved":true,"patent_grant":true,"radical":"AFL","spdx_id":"AFL-1.2","steward":"","url":"http://opensource.linux-mirror.org/licenses/afl-1.2.txt","verbatim":""},"type":"HermineLicense"},{"applicableLNs":{"contents":[{"contents":"foss-license:Academic Free License 1.2","tag":"LN"},[{"contents":"scancode:afl-1.2","tag":"LN"},{"contents":"AFL-1.2","tag":"LN"},{"contents":"Academic Free License 1.2","tag":"LN"},{"contents":"scancode://afl-1.2","tag":"LN"},{"contents":"AFL 1.2","tag":"LN"},{"contents":"AFL, Version 1.2","tag":"LN"},{"contents":"AFL, 1.2","tag":"LN"},{"contents":"scancode:afl-1.2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["FossLicense","e4c04854b7b1f805cc2b9543d0b9b42d"],"impliedStmts":[],"raw":{"aliases":["AFL-1.2","Academic Free License 1.2","scancode://afl-1.2","AFL 1.2","AFL, Version 1.2","AFL, 1.2","scancode:afl-1.2"],"meta":{"comment":"","disclaimer":"https://github.com/hesa/license-db/tree/main/var/disclamer.md"},"name":"Academic Free License 1.2","scancode_key":"afl-1.2","spdxid":"AFL-1.2","text":"Academic Free License\n\t\tVersion 1.2\n\nThis Academic Free License applies to any original work of authorship \n(the \"Original Work\") whose owner (the \"Licensor\") has placed the \nfollowing notice immediately following the copyright notice for the \nOriginal Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a \ncopy of the Original Work (\"You\") a world-wide, royalty-free, \nnon-exclusive, perpetual, non-sublicenseable license (1) to use, copy, \nmodify, merge, publish, perform, distribute and/or sell copies of the \nOriginal Work and derivative works thereof, and (2) under patent claims \nowned or controlled by the Licensor that are embodied in the Original \nWork as furnished by the Licensor, to make, use, sell and offer for \nsale the Original Work and derivative works thereof, subject to the \nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any \nDerivative Works that You create, all copyright, patent or trademark \nnotices from the Source Code of the Original Work, as well as any \nnotices of licensing and any descriptive text identified therein as an \n\"Attribution Notice.\" You must cause the Source Code for any Derivative \nWorks that You create to carry a prominent Attribution Notice reasonably \ncalculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the \nnames of any contributors to the Original Work, nor any of their \ntrademarks or service marks, may be used to endorse or promote products \nderived from this Original Work without express prior written permission \nof the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright \nin and to the Original Work is owned by the Licensor or that the Original \nWork is distributed by Licensor under a valid current license from the \ncopyright owner. Except as expressly stated in the immediately proceeding \nsentence, the Original Work is provided under this License on an \"AS IS\" \nBASIS and WITHOUT WARRANTY, either express or implied, including, without \nlimitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL \nWORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part \nof this License. No license to Original Work is granted hereunder except \nunder this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, \nwhether in tort (including negligence), contract, or otherwise, shall the \nLicensor be liable to any person for any direct, indirect, special, \nincidental, or consequential damages of any character arising as a result \nof this License or the use of the Original Work including, without \nlimitation, damages for loss of goodwill, work stoppage, computer failure \nor malfunction, or any and all other commercial damages or losses. This \nlimitation of liability shall not apply to liability for death or personal \ninjury resulting from Licensor's negligence to the extent applicable law \nprohibits such limitation. Some jurisdictions do not allow the exclusion or \nlimitation of incidental or consequential damages, so this exclusion and \nlimitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of \nthe Original Work for making modifications to it and all available \ndocumentation describing how to modify the Original Work. Licensor hereby \nagrees to provide a machine-readable copy of the Source Code of the Original \nWork along with each copy of the Original Work that Licensor distributes. \nLicensor reserves the right to satisfy this obligation by placing a \nmachine-readable copy of the Source Code in an information repository \nreasonably calculated to permit inexpensive and convenient access by You for \nas long as Licensor continues to distribute the Original Work, and by \npublishing the address of that information repository in a notice immediately \nfollowing the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate \nautomatically and You may no longer exercise any of the rights granted to You \nby this License if You file a lawsuit in any court alleging that any OSI \nCertified open source software that is licensed under any license containing \nthis \"Mutual Termination for Patent Action\" clause infringes any patent \nclaims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise \nrestricted or conditioned by this License or by law, and Licensor promises \nnot to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without \nmodification. This license may not be modified without the express written \npermission of its copyright owner."},"type":"FossLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fosslight:Academic Free License v1.2","tag":"LN"},[{"contents":"AFL-1.2","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["FOSSLight","dc2adbc16ab55ac328380710731a13cd"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}],"raw":{"_FOSSLightFact_License":{"_fossLight_ATTRIBUTION":"","_fossLight_CREATED_DATE":[],"_fossLight_CREATOR":[],"_fossLight_DESCRIPTION":"","_fossLight_LICENSE_TEXT":"Academic Free License\nVersion 1.2 \n\nThis Academic Free License applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the \nfollowing notice immediately following the copyright notice for the Original Work:\n\n     Licensed under the Academic Free License version 1.2 \n\nGrant of License. Licensor hereby grants to any person obtaining a copy of the Original Work (\"You\") a world-wide, royalty-free, non-exclusive, perpetual, non-sublicenseable license (1) to use, copy, modify, merge, publish, perform, distribute and/or sell copies of the Original Work and derivative works thereof, and (2) under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and derivative works thereof, subject to the \nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work is owned by the Licensor or that the Original Work is distributed by Licensor under a valid current license from the copyright owner. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available \ndocumentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License if You file a lawsuit in any court alleging that any OSI Certified open source software that is licensed under any license containing this \"Mutual Termination for Patent Action\" clause infringes any patent claims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","_fossLight_MODIFIED_DATE":[],"_fossLight_MODIFIER":[],"_fossLight_OBLIGATION_DISCLOSING_SRC":false,"_fossLight_OBLIGATION_NEEDS_CHECK":false,"_fossLight_OBLIGATION_NOTIFICATION":true,"_fossLight_REQ_LICENSE_TEXT":false,"_fossLight_RESTRICTION":null,"_fossLight_SHORT_IDENTIFIER":"AFL-1.2","_fossLight_USE":true,"_fossLight_WEBPAGE":"https://spdx.org/licenses/AFL-1.2.html","_fossLight_id":4,"_fossLight_name":"fosslight:Academic Free License v1.2","_fossLight_type":"FOSSLight_License_Type_Permissive"},"_FOSSLightFact_Nicks":[]},"type":"FOSSLight"}]