[{"applicableLNs":{"contents":[{"contents":"spdx:AFL-2.1","tag":"LN"},[{"contents":"Academic Free License v2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","b09e34f2a556d5c8f280eab390e6c859"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":null,"tag":"MaybeStatement"},{"contents":[{"contents":"The Academic Free License\nv.2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\n     Licensed under the Academic Free License version 2.1\n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\n     a) to reproduce the Original Work in copies;\n     b) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n     c) to distribute copies of the Original Work and Derivative Works to the public;\n     d) to perform the Original Work publicly; and\n     e) to display the Original Work publicly.\n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n5) This section intentionally omitted.\n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n 9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The Academic Free License\n        <br />\n\nv.2.1\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>This Academic Free License (the &quot;License&quot;) applies to any original work of authorship (the\n         &quot;Original Work&quot;) whose owner (the &quot;Licensor&quot;) has placed the following notice\n         immediately following the copyright notice for the Original Work:</p>\n\n         <p>Licensed under the Academic Free License version 2.1</p>\n\n      </div>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1)</var>\n          Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive,\n             perpetual, sublicenseable license to do the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            to reproduce the Original Work in copies;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            to prepare derivative works (&quot;Derivative Works&quot;) based upon the Original Work;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            to distribute copies of the Original Work and Derivative Works to the public;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            to perform the Original Work publicly; and\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            to display the Original Work publicly.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2)</var>\n          Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive,\n             perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor\n             that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and\n             offer for sale the Original Work and Derivative Works.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3)</var>\n          Grant of Source Code License. The term &quot;Source Code&quot; means the preferred form of the\n             Original Work for making modifications to it and all available documentation describing how to\n             modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the\n             Source Code of the Original Work along with each copy of the Original Work that Licensor\n             distributes. Licensor reserves the right to satisfy this obligation by placing a\n             machine-readable copy of the Source Code in an information repository reasonably calculated to\n             permit inexpensive and convenient access by You for as long as Licensor continues to\n             distribute the Original Work, and by publishing the address of that information repository in\n             a notice immediately following the copyright notice that applies to the Original Work.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4)</var>\n          Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors\n             to the Original Work, nor any of their trademarks or service marks, may be used to endorse or\n             promote products derived from this Original Work without express prior written permission of\n             the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks,\n             copyrights, patents, trade secrets or any other intellectual property of Licensor except as\n             expressly stated herein. No patent license is granted to make, use, sell or offer to sell\n             embodiments of any patent claims other than the licensed claims defined in Section 2. No right\n             is granted to the trademarks of Licensor even if such marks are included in the Original Work.\n             Nothing in this License shall be interpreted to prohibit Licensor from licensing under\n             different terms from this License any Original Work that Licensor otherwise would have a right\n             to license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5)</var>\n          This section intentionally omitted.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6)</var>\n          Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create,\n             all copyright, patent or trademark notices from the Source Code of the Original Work, as well\n             as any notices of licensing and any descriptive text identified therein as an\n             &quot;Attribution Notice.&quot; You must cause the Source Code for any Derivative Works that\n             You create to carry a prominent Attribution Notice reasonably calculated to inform recipients\n             that You have modified the Original Work.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7)</var>\n          Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to\n             the Original Work and the patent rights granted herein by Licensor are owned by the Licensor\n             or are sublicensed to You under the terms of this License with the permission of the\n             contributor(s) of those copyrights and patent rights. Except as expressly stated in the\n             immediately proceeding sentence, the Original Work is provided under this License on an\n             &quot;AS IS&quot; BASIS and WITHOUT WARRANTY, either express or implied, including, without\n             limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR\n             PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER\n             OF WARRANTY constitutes an essential part of this License. No license to Original Work is\n             granted hereunder except under this disclaimer.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8)</var>\n          Limitation of Liability. Under no circumstances and under no legal theory, whether in tort\n             (including negligence), contract, or otherwise, shall the Licensor be liable to any person for\n             any direct, indirect, special, incidental, or consequential damages of any character arising\n             as a result of this License or the use of the Original Work including, without limitation,\n             damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all\n             other commercial damages or losses. This limitation of liability shall not apply to liability\n             for death or personal injury resulting from Licensor&apos;s negligence to the extent\n             applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or\n             limitation of incidental or consequential damages, so this exclusion and limitation may not\n             apply to You.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9)</var>\n          Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work,\n             You must make a reasonable effort under the circumstances to obtain the express assent of\n             recipients to the terms of this License. Nothing else but this License (or another written\n             agreement between Licensor and You) grants You permission to create Derivative Works based\n             upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any\n             attempt to do so except under the terms of this License (or another written agreement between\n             Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other\n             countries, and by international treaty. Therefore, by exercising any of the rights granted to\n             You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and\n             conditions.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10)</var>\n          Termination for Patent Action. This License shall terminate automatically and You may no longer\n             exercise any of the rights granted to You by this License as of the date You commence an\n             action, including a cross-claim or counterclaim, against Licensor or any licensee alleging\n             that the Original Work infringes a patent. This termination provision shall not apply for an\n             action alleging patent infringement by combinations of the Original Work with other software\n             or hardware.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 11)</var>\n          Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought\n             only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor\n             conducts its primary business, and under the laws of that jurisdiction excluding its\n             conflict-of-law provisions. The application of the United Nations Convention on Contracts for\n             the International Sale of Goods is expressly excluded. Any use of the Original Work outside\n             the scope of this License or after its termination shall be subject to the requirements and\n             penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of\n             other countries, and international treaty. This section shall survive the termination of this\n             License.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 12)</var>\n          Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating\n             thereto, the prevailing party shall be entitled to recover its costs and expenses, including,\n             without limitation, reasonable attorneys&apos; fees and costs incurred in connection with such\n             action, including any appeal of such action. This section shall survive the termination of\n             this License.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 13)</var>\n          Miscellaneous. This License represents the complete agreement concerning the subject matter\n             hereof. If any provision of this License is held to be unenforceable, such provision shall be\n             reformed only to the extent necessary to make it enforceable.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 14)</var>\n          Definition of &quot;You&quot; in This License. &quot;You&quot; throughout this License, whether\n             in upper or lower case, means an individual or a legal entity exercising rights under, and\n             complying with all of the terms of, this License. For legal entities, &quot;You&quot; includes\n             any entity that controls, is controlled by, or is under common control with you. For purposes\n             of this definition, &quot;control&quot; means (i) the power, direct or indirect, to cause the\n             direction or management of such entity, whether by contract or otherwise, or (ii) ownership of\n             fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such\n             entity.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 15)</var>\n          Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned\n             by this License or by law, and Licensor promises not to interfere with or be responsible for\n             such uses by You.\n        </li>\n      \n</ul>\n      <p>This license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\n        <br />\n\nPermission is hereby granted to copy and distribute this license without modification. This license\n             may not be modified without the express written permission of its copyright owner.\n      </p>\n\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:02:03Z","url":"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":true,"licenseComments":null,"licenseId":"spdx:AFL-2.1","licenseText":"The Academic Free License\nv.2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\n     Licensed under the Academic Free License version 2.1\n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\n     a) to reproduce the Original Work in copies;\n     b) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n     c) to distribute copies of the Original Work and Derivative Works to the public;\n     d) to perform the Original Work publicly; and\n     e) to display the Original Work publicly.\n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n5) This section intentionally omitted.\n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n 9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The Academic Free License\n        <br />\n\nv.2.1\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>This Academic Free License (the &quot;License&quot;) applies to any original work of authorship (the\n         &quot;Original Work&quot;) whose owner (the &quot;Licensor&quot;) has placed the following notice\n         immediately following the copyright notice for the Original Work:</p>\n\n         <p>Licensed under the Academic Free License version 2.1</p>\n\n      </div>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1)</var>\n          Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive,\n             perpetual, sublicenseable license to do the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            to reproduce the Original Work in copies;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            to prepare derivative works (&quot;Derivative Works&quot;) based upon the Original Work;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            to distribute copies of the Original Work and Derivative Works to the public;\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            to perform the Original Work publicly; and\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            to display the Original Work publicly.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2)</var>\n          Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive,\n             perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor\n             that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and\n             offer for sale the Original Work and Derivative Works.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3)</var>\n          Grant of Source Code License. The term &quot;Source Code&quot; means the preferred form of the\n             Original Work for making modifications to it and all available documentation describing how to\n             modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the\n             Source Code of the Original Work along with each copy of the Original Work that Licensor\n             distributes. Licensor reserves the right to satisfy this obligation by placing a\n             machine-readable copy of the Source Code in an information repository reasonably calculated to\n             permit inexpensive and convenient access by You for as long as Licensor continues to\n             distribute the Original Work, and by publishing the address of that information repository in\n             a notice immediately following the copyright notice that applies to the Original Work.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4)</var>\n          Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors\n             to the Original Work, nor any of their trademarks or service marks, may be used to endorse or\n             promote products derived from this Original Work without express prior written permission of\n             the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks,\n             copyrights, patents, trade secrets or any other intellectual property of Licensor except as\n             expressly stated herein. No patent license is granted to make, use, sell or offer to sell\n             embodiments of any patent claims other than the licensed claims defined in Section 2. No right\n             is granted to the trademarks of Licensor even if such marks are included in the Original Work.\n             Nothing in this License shall be interpreted to prohibit Licensor from licensing under\n             different terms from this License any Original Work that Licensor otherwise would have a right\n             to license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5)</var>\n          This section intentionally omitted.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6)</var>\n          Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create,\n             all copyright, patent or trademark notices from the Source Code of the Original Work, as well\n             as any notices of licensing and any descriptive text identified therein as an\n             &quot;Attribution Notice.&quot; You must cause the Source Code for any Derivative Works that\n             You create to carry a prominent Attribution Notice reasonably calculated to inform recipients\n             that You have modified the Original Work.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7)</var>\n          Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to\n             the Original Work and the patent rights granted herein by Licensor are owned by the Licensor\n             or are sublicensed to You under the terms of this License with the permission of the\n             contributor(s) of those copyrights and patent rights. Except as expressly stated in the\n             immediately proceeding sentence, the Original Work is provided under this License on an\n             &quot;AS IS&quot; BASIS and WITHOUT WARRANTY, either express or implied, including, without\n             limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR\n             PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER\n             OF WARRANTY constitutes an essential part of this License. No license to Original Work is\n             granted hereunder except under this disclaimer.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8)</var>\n          Limitation of Liability. Under no circumstances and under no legal theory, whether in tort\n             (including negligence), contract, or otherwise, shall the Licensor be liable to any person for\n             any direct, indirect, special, incidental, or consequential damages of any character arising\n             as a result of this License or the use of the Original Work including, without limitation,\n             damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all\n             other commercial damages or losses. This limitation of liability shall not apply to liability\n             for death or personal injury resulting from Licensor&apos;s negligence to the extent\n             applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or\n             limitation of incidental or consequential damages, so this exclusion and limitation may not\n             apply to You.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9)</var>\n          Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work,\n             You must make a reasonable effort under the circumstances to obtain the express assent of\n             recipients to the terms of this License. Nothing else but this License (or another written\n             agreement between Licensor and You) grants You permission to create Derivative Works based\n             upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any\n             attempt to do so except under the terms of this License (or another written agreement between\n             Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other\n             countries, and by international treaty. Therefore, by exercising any of the rights granted to\n             You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and\n             conditions.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10)</var>\n          Termination for Patent Action. This License shall terminate automatically and You may no longer\n             exercise any of the rights granted to You by this License as of the date You commence an\n             action, including a cross-claim or counterclaim, against Licensor or any licensee alleging\n             that the Original Work infringes a patent. This termination provision shall not apply for an\n             action alleging patent infringement by combinations of the Original Work with other software\n             or hardware.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 11)</var>\n          Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought\n             only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor\n             conducts its primary business, and under the laws of that jurisdiction excluding its\n             conflict-of-law provisions. The application of the United Nations Convention on Contracts for\n             the International Sale of Goods is expressly excluded. Any use of the Original Work outside\n             the scope of this License or after its termination shall be subject to the requirements and\n             penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of\n             other countries, and international treaty. This section shall survive the termination of this\n             License.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 12)</var>\n          Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating\n             thereto, the prevailing party shall be entitled to recover its costs and expenses, including,\n             without limitation, reasonable attorneys&apos; fees and costs incurred in connection with such\n             action, including any appeal of such action. This section shall survive the termination of\n             this License.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 13)</var>\n          Miscellaneous. This License represents the complete agreement concerning the subject matter\n             hereof. If any provision of this License is held to be unenforceable, such provision shall be\n             reformed only to the extent necessary to make it enforceable.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 14)</var>\n          Definition of &quot;You&quot; in This License. &quot;You&quot; throughout this License, whether\n             in upper or lower case, means an individual or a legal entity exercising rights under, and\n             complying with all of the terms of, this License. For legal entities, &quot;You&quot; includes\n             any entity that controls, is controlled by, or is under common control with you. For purposes\n             of this definition, &quot;control&quot; means (i) the power, direct or indirect, to cause the\n             direction or management of such entity, whether by contract or otherwise, or (ii) ownership of\n             fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such\n             entity.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 15)</var>\n          Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned\n             by this License or by law, and Licensor promises not to interfere with or be responsible for\n             such uses by You.\n        </li>\n      \n</ul>\n      <p>This license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\n        <br />\n\nPermission is hereby granted to copy and distribute this license without modification. This license\n             may not be modified without the express written permission of its copyright owner.\n      </p>\n\n    ","name":"Academic Free License v2.1","seeAlso":["http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"standardLicenseTemplate":"<<beginOptional>>The Academic Free License\n\nv.2.1\n\n<<endOptional>><<beginOptional>> This Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n<<endOptional>>\n\n   <<var;name=\"bullet\";original=\"1)\";match=\".{0,20}\">> Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> to reproduce the Original Work in copies;\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> to distribute copies of the Original Work and Derivative Works to the public;\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> to perform the Original Work publicly; and\n\n      <<var;name=\"bullet\";original=\"e)\";match=\".{0,20}\">> to display the Original Work publicly.\n\n   <<var;name=\"bullet\";original=\"2)\";match=\".{0,20}\">> Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n   <<var;name=\"bullet\";original=\"3)\";match=\".{0,20}\">> Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n   <<var;name=\"bullet\";original=\"4)\";match=\".{0,20}\">> Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n   <<var;name=\"bullet\";original=\"5)\";match=\".{0,20}\">> This section intentionally omitted.\n\n   <<var;name=\"bullet\";original=\"6)\";match=\".{0,20}\">> Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n   <<var;name=\"bullet\";original=\"7)\";match=\".{0,20}\">> Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n   <<var;name=\"bullet\";original=\"8)\";match=\".{0,20}\">> Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n   <<var;name=\"bullet\";original=\"9)\";match=\".{0,20}\">> Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n   <<var;name=\"bullet\";original=\"10)\";match=\".{0,20}\">> Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n   <<var;name=\"bullet\";original=\"11)\";match=\".{0,20}\">> Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n   <<var;name=\"bullet\";original=\"12)\";match=\".{0,20}\">> Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n   <<var;name=\"bullet\";original=\"13)\";match=\".{0,20}\">> Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n   <<var;name=\"bullet\";original=\"14)\";match=\".{0,20}\">> Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n   <<var;name=\"bullet\";original=\"15)\";match=\".{0,20}\">> Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.\n\n"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"google:AFL21","tag":"LN"},[{"contents":"spdx:AFL-2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","f6a16662798f2224db86ad21fa85d086"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:AFL21","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:AFL-2.1"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:AFL-2.1","tag":"LN"},[{"contents":"spdx:AFL-2.1","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Academic Free License v2.1","tag":"LN"},{"contents":"AFL","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","679124daf7f8b8be19513bf9aecd1232"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"}],"raw":{"_fedora":{"_legacy_abbreviation":["AFL"],"_legacy_names":["Academic Free License v2.1"],"_notes":null},"_id":"AFL-2.1","_license":{"_expression":"spdx:AFL-2.1","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":[]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"BlueOak:AFL-2.1","tag":"LN"},[{"contents":"Academic Free License v2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","3d0eb738ab0c8cd9efa0b7808a684459"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Bronze",{"contents":"These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/AFL-2.1.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Bronze","These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.",{"_id":"AFL-2.1","_name":"Academic Free License v2.1","_url":"https://spdx.org/licenses/AFL-2.1.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"osadl:AFL-2.1","tag":"LN"},[{"contents":"spdx:AFL-2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["OSADLRule","18e49a609b32a0da4110937626058b2f"],"impliedStmts":[{"contents":[{"contents":"USE CASE Source code delivery OR Binary delivery\n\tYOU MUST Reference License text\n\tYOU MUST Search License acceptance\n\t\tATTRIBUTE Reasonable\n\tIF Software modification\n\t\tYOU MUST Forward Copyright notices\n\t\tYOU MUST Forward Patent notice\n\t\tYOU MUST Forward Trademark notice\n\t\tYOU MUST Forward License notice\n\t\tYOU MUST Provide Modification notice\n\t\tYOU MUST NOT Promote\n\t\tIF Modified work Under Original license\n\t\t\tEITHER\n\t\t\t\tYOU MUST Include Source code Of Modified work\n\t\t\t\t\tATTRIBUTE Machine-readable\n\t\t\tOR\n\t\t\t\tYOU MUST Provide Delayed source code delivery Of Modified work\n\t\t\t\t\tATTRIBUTE Machine-readable\n\t\t\t\t\tATTRIBUTE Via Internet\n\t\t\t\t\tATTRIBUTE No profit\n\t\t\t\t\tATTRIBUTE Duration As long as distributed\n\t\t\t\tYOU MUST Reference Source code\n\t\t\t\t\tATTRIBUTE Below Copyright notices\nPATENT HINTS Yes\n","tag":"LicenseRule"},[{"contents":null,"tag":"MaybeStatement"},{"contents":"Patent hint","tag":"LicenseStatement"},{"contents":null,"tag":"MaybeStatement"}]],"tag":"SubStatements"}],"raw":{"osadlRule":"USE CASE Source code delivery OR Binary delivery\n\tYOU MUST Reference License text\n\tYOU MUST Search License acceptance\n\t\tATTRIBUTE Reasonable\n\tIF Software modification\n\t\tYOU MUST Forward Copyright notices\n\t\tYOU MUST Forward Patent notice\n\t\tYOU MUST Forward Trademark notice\n\t\tYOU MUST Forward License notice\n\t\tYOU MUST Provide Modification notice\n\t\tYOU MUST NOT Promote\n\t\tIF Modified work Under Original license\n\t\t\tEITHER\n\t\t\t\tYOU MUST Include Source code Of Modified work\n\t\t\t\t\tATTRIBUTE Machine-readable\n\t\t\tOR\n\t\t\t\tYOU MUST Provide Delayed source code delivery Of Modified work\n\t\t\t\t\tATTRIBUTE Machine-readable\n\t\t\t\t\tATTRIBUTE Via Internet\n\t\t\t\t\tATTRIBUTE No profit\n\t\t\t\t\tATTRIBUTE Duration As long as distributed\n\t\t\t\tYOU MUST Reference Source code\n\t\t\t\t\tATTRIBUTE Below Copyright notices\nPATENT HINTS Yes\n","spdxId":"osadl:AFL-2.1"},"type":"OSADLRule"},{"applicableLNs":{"contents":"osadl:AFL-2.1","tag":"LN"},"id":["OSADLMatrix","3d75d1b9ec3e448398e6d3241d43695c"],"impliedStmts":[{"contents":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Same","_explanation":"n.a.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the AFL-2.1 license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC0-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC0-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the AFL-2.1 license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FTL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the AFL-2.1 license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the AFL-2.1 license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the AFL-2.1 license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the AFL-2.1 license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the AFL-2.1 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the AFL-2.1 license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ZPL-2.0"}],"tag":"LicenseCompatibilities"}],"raw":{"_name":"osadl:AFL-2.1","compatibilities":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Same","_explanation":"n.a.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the AFL-2.1 license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC0-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"CC0-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the AFL-2.1 license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FTL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the AFL-2.1 license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the AFL-2.1 license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the AFL-2.1 license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the AFL-2.1 license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the AFL-2.1 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the AFL-2.1 license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the AFL-2.1 license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the AFL-2.1 license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the AFL-2.1 license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the AFL-2.1 license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the AFL-2.1 license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the AFL-2.1 license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the AFL-2.1 license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the AFL-2.1 license are generally considered mutually compatible.","_other":"ZPL-2.0"}]},"type":"OSADLMatrix"},{"applicableLNs":{"contents":[{"contents":"scancode:afl-2.1","tag":"LN"},[{"contents":"AFL 2.1","tag":"LN"},{"contents":"Academic Free License 2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","622bad25f34afe901195e82cc9ba5fa3"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":"http://www.rosenlaw.com/afl21.htm","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":"http://opensource.org/licenses/afl-2.1.php","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license was OSI certified."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":["OSI","http://opensource.org/licenses/afl-2.1.php"],"tag":"LicenseUrl"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://web.archive.org/web/20060423052359/http://opensource.org/licenses/afl-2.1.php"],"tag":"LicenseUrl"},{"contents":[null,"http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"],"tag":"LicenseUrl"},{"contents":"The Academic Free License\nv. 2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\na) to reproduce the Original Work in copies;\n\nb) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\nc) to distribute copies of the Original Work and Derivative Works to the public;\n\nd) to perform the Original Work publicly; and\n\ne) to display the Original Work publicly.\n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n5) This section intentionally omitted.\n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved. Permission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","tag":"LicenseText"}],"raw":{"_category":"Permissive","_homepageUrl":"http://www.rosenlaw.com/afl21.htm","_key":"afl-2.1","_name":"Academic Free License 2.1","_notes":"Per SPDX.org, this license was OSI certified.","_osiUrl":"http://opensource.org/licenses/afl-2.1.php","_otherUrls":["http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"],"_owner":"Lawrence Rosen","_shortName":"AFL 2.1","_spdxId":"AFL-2.1","_text":"The Academic Free License\nv. 2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\na) to reproduce the Original Work in copies;\n\nb) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\nc) to distribute copies of the Original Work and Derivative Works to the public;\n\nd) to perform the Original Work publicly; and\n\ne) to display the Original Work publicly.\n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n5) This section intentionally omitted.\n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved. Permission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","_textUrls":["http://opensource.linux-mirror.org/licenses/afl-2.1.txt","http://web.archive.org/web/20060423052359/http://opensource.org/licenses/afl-2.1.php"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:AFL-2.1","tag":"LN"},[{"contents":"Academic Free License v2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","a52c74ca0f36dd08a233b2f32c76f879"],"impliedStmts":[{"contents":{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The Academic Free License\n\nv.2.1 This Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n   1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\n      a) to reproduce the Original Work in copies;\n\n      b) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\n      c) to distribute copies of the Original Work and Derivative Works to the public;\n\n      d) to perform the Original Work publicly; and\n\n      e) to display the Original Work publicly.\n\n   2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n   3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n   4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n   5) This section intentionally omitted.\n\n   6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n   7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n   8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n   9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n   10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n   11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n   12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n   13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n   14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n   15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Academic Free License v2.1","_rf_notes":"","_rf_risk":null,"_rf_shortname":"fossology:AFL-2.1","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The Academic Free License\n\nv.2.1 This Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n   1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\n      a) to reproduce the Original Work in copies;\n\n      b) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\n      c) to distribute copies of the Original Work and Derivative Works to the public;\n\n      d) to perform the Original Work publicly; and\n\n      e) to display the Original Work publicly.\n\n   2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n   3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n   4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n   5) This section intentionally omitted.\n\n   6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n   7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n   8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n   9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n   10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n   11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n   12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n   13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n   14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n   15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved.\n\nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","_rf_text_updatable":false,"_rf_url":"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:AFL-2.1","tag":"LN"},"id":["OrtLicenseCategorization","a61ea64cbb3f873856f1d08fb9b376dd"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"permissive"},{"description":null,"name":"include-in-notice-file"}],"_olcLicensename":"SPDX:AFL-2.1"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:AFL-2.1","tag":"LN"},"id":["OrtLicenseCategorization","176e6c9ac1100c1f7a664a5383d8dff8"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"contents":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:distribute-source-code",{"contents":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:patent-clause",{"contents":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","name":"permissive"},{"description":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","name":"property:distribute-source-code"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"},{"description":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","name":"property:patent-clause"}],"_olcLicensename":"SPDX:AFL-2.1"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:AFL-2.1","tag":"LN"},[{"contents":"AFL 2.1","tag":"LN"},{"contents":"AFL-2.1","tag":"LN"},{"contents":"Academic Free License 2.1","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","6953ac943fa25334f1a23a3ae98c328c"],"impliedStmts":[],"raw":{"_clcAlias":["AFL 2.1","AFL-2.1","Academic Free License 2.1"],"_clcName":"cavil:AFL-2.1"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Academic Free License 2.1","tag":"LN"},[{"contents":"spdx:AFL-2.1","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"AFL","tag":"LN"},{"contents":"AFL, Version 2.1","tag":"LN"},{"contents":"AFL, 2.1","tag":"LN"},{"contents":"AFL-2.1","tag":"LN"},{"contents":"Academic Free License version 2.1","tag":"LN"},{"contents":"Academic Free License v2.1","tag":"LN"},{"contents":"Academic Free License Version 2.1","tag":"LN"},{"contents":"ACADEMIC FREE LICENSE Version 2.1","tag":"LN"},{"contents":"Academic Free License v. 2.1","tag":"LN"},{"contents":"Academic Free Licence Version 2.1","tag":"LN"},{"contents":"scancode:afl-2.1","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","fb3fea557d2860f372ca394fbc4084d5"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prรผfung seitens Open CoDE sowohl der Open Source Definition (gemรคร Definition der Open Source Initiative [extern]) entspricht und darรผber hinaus keine fรผr die รffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Auรer in Ausnahmefรคllen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["AFL, Version 2.1","AFL, 2.1","AFL-2.1","Academic Free License version 2.1","Academic Free License v2.1","Academic Free License Version 2.1","ACADEMIC FREE LICENSE Version 2.1","Academic Free License v. 2.1","Academic Free Licence Version 2.1"],"_canonicalName":"metaeffekt:Academic Free License 2.1","_category":"AFL","_openCoDEStatus":"approved","_otherIds":["scancode:afl-2.1"],"_shortName":null,"_spdxIdentifier":"spdx:AFL-2.1"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"spdx:AFL-2.1","tag":"LN"},[{"contents":"Academic Free License v2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["HermineLicense","9a8502411233858a21b3039c456809f2"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["HermineLicense","FOSS - deduced",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["HermineLicense","11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":"","tag":"LicenseText"},{"contents":[null,"http://opensource.linux-mirror.org/licenses/afl-2.1.txt"],"tag":"LicenseUrl"},{"contents":"\"AFL-2.1\" is a license with a patent grant","tag":"LicenseStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense","\"AFL-2.1\" is of radical: AFL"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"autoupgrade":false,"comment":"11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.","copyleft":"None","ethical_clause":false,"foss":"Yes-Auto","fsf_approved":true,"inspiration_spdx":"","law_choice":"Laws of the jurisdiction excluding its conflict-of-law provisions","license_version":"2.1","long_name":"Academic Free License v2.1","non_commercial":false,"non_tivoisation":false,"obligations":[{"generic":[{"description":"Make the corresponding source code available (including modifications):\r\n-at the time of distribution of the software and on the same medium;\r\n-by including a written offer allowing others to obtain it;\r\n-by making it available online.","metacategory":"ProvidingSourceCode","name":"Providing CSC to end user","passivity":"Active"}],"license":["AFL-2.1"],"name":"Providing machine-readable copy of the Source Code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. \r\n\r\nLicensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work."},{"generic":[{"description":"Include specific mentions/attributions/ statements or warnings in the documentation. For instance : \"This product includes software developed by the Apache Group for use in the Apache HTTP server project (http://www.apache.org/).\"","metacategory":"Mentions","name":"Add specific legal mentions in the documentation","passivity":"Active"}],"license":["AFL-2.1"],"name":"Extra mentions in documentation","passivity":"Active","trigger_expl":"DistributionSource","trigger_mdf":"AlteredUnmodified","verbatim":"6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent, or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work."},{"generic":[{"description":"Keep all legal notices and license texts intact in the Source Code, including in the headers.","metacategory":"Mentions","name":"Preserve legal mentions in source code","passivity":"Active"}],"license":["AFL-2.1"],"name":"Preserve License and notices in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\""},{"generic":[{"description":"Document all your modifications made in the source code of third-party Open Source components in order to clearly attribute each contribution.","metacategory":"Mentions","name":"Track and mention modifications in the source code","passivity":"Active"}],"license":["AFL-2.1"],"name":"Marking modifications in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"6)[...]You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work."},{"generic":[{"description":"Enforcing patents against licensees or making a non-infringement agreement contrary to the license is prohibited and/or terminates your rights under the license.","metacategory":"IPManagement","name":"Do not enforce patent rights (Patent peace)","passivity":"Passive"}],"license":["AFL-2.1"],"name":"Patent peace","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware."},{"generic":[{"description":"Donโt use elements of the project that may be covered by Trademark Law (project name, logo) except as required for reasonable and customary use in describing the origin of the program.","metacategory":"Communication","name":"Respect trademarks","passivity":"Passive"}],"license":["AFL-2.1"],"name":"Respect trademarks","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license."},{"generic":[{"description":"Names of the project or associated persons (authors, contributors, etc.) are not to be used for commercial or promotional purposes.","metacategory":"Communication","name":"Do not use project or contributor names for endorsement or promotion.","passivity":"Passive"}],"license":["AFL-2.1"],"name":"No use of names for endorsment","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license."}],"osi_approved":true,"patent_grant":true,"radical":"AFL","spdx_id":"AFL-2.1","steward":"","url":"http://opensource.linux-mirror.org/licenses/afl-2.1.txt","verbatim":""},"type":"HermineLicense"},{"applicableLNs":{"contents":[{"contents":"foss-license:Academic Free License 2.1","tag":"LN"},[{"contents":"scancode:afl-2.1","tag":"LN"},{"contents":"Academic Free License v2.1","tag":"LN"},{"contents":"Academic Free License 2.1","tag":"LN"},{"contents":"Academic Free License Version 2.1","tag":"LN"},{"contents":"scancode://afl-2.1","tag":"LN"},{"contents":"AFL 2.1","tag":"LN"},{"contents":"AFL, Version 2.1","tag":"LN"},{"contents":"AFL, 2.1","tag":"LN"},{"contents":"Academic Free License version 2.1","tag":"LN"},{"contents":"ACADEMIC FREE LICENSE Version 2.1","tag":"LN"},{"contents":"Academic Free License v. 2.1","tag":"LN"},{"contents":"scancode:afl-2.1","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["FossLicense","9428006b96e1b28798bdbc269e5bcff0"],"impliedStmts":[],"raw":{"aliases":["Academic Free License v2.1","Academic Free License 2.1","Academic Free License Version 2.1","scancode://afl-2.1","AFL 2.1","AFL, Version 2.1","AFL, 2.1","Academic Free License version 2.1","ACADEMIC FREE LICENSE Version 2.1","Academic Free License v. 2.1","scancode:afl-2.1"],"meta":{"comment":"","disclaimer":"https://github.com/hesa/license-db/tree/main/var/disclamer.md"},"name":"Academic Free License 2.1","scancode_key":"afl-2.1","spdxid":"AFL-2.1","text":"The Academic Free License\nv. 2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work:\n\nLicensed under the Academic Free License version 2.1\n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following:\n\na) to reproduce the Original Work in copies;\n\nb) to prepare derivative works (\"Derivative Works\") based upon the Original Work;\n\nc) to distribute copies of the Original Work and Derivative Works to the public;\n\nd) to perform the Original Work publicly; and\n\ne) to display the Original Work publicly.\n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works.\n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work.\n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license.\n\n5) This section intentionally omitted.\n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer.\n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions.\n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License.\n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved. Permission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner."},"type":"FossLicense"},{"applicableLNs":{"contents":[{"contents":"hitachi:Academic Free License Version 2.1","tag":"LN"},[]],"tag":"AlternativeLNs"},"id":["HitachiOpenLicense","b19a4afc275022065b1fff05b1fbfbc5"],"impliedStmts":[{"contents":"The Academic Free License \nv.2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work: \n\nLicensed under the Academic Free License version 2.1 \n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following: \n\na) to reproduce the Original Work in copies; \nb) to prepare derivative works (\"Derivative Works\") based upon the Original Work; \nc) to distribute copies of the Original Work and Derivative Works to the public; \nd) to perform the Original Work publicly; and \ne) to display the Original Work publicly. \n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works. \n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work. \n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license. \n\n5) This section intentionally omitted. \n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work. \n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer. \n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor&apos;s negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You. \n\n9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions. \n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware. \n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License. \n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys&apos; fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License. \n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable. \n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity. \n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You. \n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","tag":"LicenseText"},{"contents":{"contents":["HitachiOpenLicense","Source Code means the documentation that describes the appropriate format for making modifications to the Software and how to modify it. Self means the person or entity exercising its rights under this License in accordance with all of the terms of this License. In the case of a legal entity, self includes any person who controls itself, is controlled by itself, or is an association of persons under common control with itself. For the purposes of this definition, \"control\" means any of the following (1) has the authority to direct and manage the corporation, directly or indirectly, by contract or otherwise, to direct and manage the corporation; (2) has more than 50% of the outstanding shares or beneficial ownership of the corporation"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"content":"The Academic Free License \nv.2.1\n\nThis Academic Free License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following the copyright notice for the Original Work: \n\nLicensed under the Academic Free License version 2.1 \n\n1) Grant of Copyright License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license to do the following: \n\na) to reproduce the Original Work in copies; \nb) to prepare derivative works (\"Derivative Works\") based upon the Original Work; \nc) to distribute copies of the Original Work and Derivative Works to the public; \nd) to perform the Original Work publicly; and \ne) to display the Original Work publicly. \n\n2) Grant of Patent License. Licensor hereby grants You a world-wide, royalty-free, non-exclusive, perpetual, sublicenseable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, to make, use, sell and offer for sale the Original Work and Derivative Works. \n\n3) Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor hereby agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work, and by publishing the address of that information repository in a notice immediately following the copyright notice that applies to the Original Work. \n\n4) Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior written permission of the Licensor. Nothing in this License shall be deemed to grant any rights to trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor except as expressly stated herein. No patent license is granted to make, use, sell or offer to sell embodiments of any patent claims other than the licensed claims defined in Section 2. No right is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under different terms from this License any Original Work that Licensor otherwise would have a right to license. \n\n5) This section intentionally omitted. \n\n6) Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work. \n\n7) Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately proceeding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to Original Work is granted hereunder except under this disclaimer. \n\n8) Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to any person for any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to liability for death or personal injury resulting from Licensor&apos;s negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You. \n\n9) Acceptance and Termination. If You distribute copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. Nothing else but this License (or another written agreement between Licensor and You) grants You permission to create Derivative Works based upon the Original Work or to exercise any of the rights granted in Section 1 herein, and any attempt to do so except under the terms of this License (or another written agreement between Licensor and You) is expressly prohibited by U.S. copyright law, the equivalent laws of other countries, and by international treaty. Therefore, by exercising any of the rights granted to You in Section 1 herein, You indicate Your acceptance of this License and all of its terms and conditions. \n\n10) Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware. \n\n11) Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of the U.S. Copyright Act, 17 U.S.C. ยง 101 et seq., the equivalent laws of other countries, and international treaty. This section shall survive the termination of this License. \n\n12) Attorneys Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys&apos; fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License. \n\n13) Miscellaneous. This License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable. \n\n14) Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity. \n\n15) Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You. \n\nThis license is Copyright (C) 2003-2004 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without modification. This license may not be modified without the express written permission of its copyright owner.","description":"Source Code means the documentation that describes the appropriate format for making modifications to the Software and how to modify it. Self means the person or entity exercising its rights under this License in accordance with all of the terms of this License. In the case of a legal entity, self includes any person who controls itself, is controlled by itself, or is an association of persons under common control with itself. For the purposes of this definition, \"control\" means any of the following (1) has the authority to direct and manage the corporation, directly or indirectly, by contract or otherwise, to direct and manage the corporation; (2) has more than 50% of the outstanding shares or beneficial ownership of the corporation","name":"hitachi:Academic Free License Version 2.1","notices":[{"contents":{"content":"If any provision of this license is deemed unenforceable, that provision shall be amended only to the extent necessary to make it enforceable."},"tag":"Ol"},{"contents":{"content":"If a lawsuit is brought in connection with this license, the losing party shall bear the costs of the lawsuit and reasonable attorney's fees."},"tag":"Ol"},{"contents":{"content":"The application of the UN contractual provisions on international trade in goods is expressly excluded."},"tag":"Ol"},{"contents":{"content":"Any action with respect to this License shall be filed only in the court of the jurisdiction in which Licensor resides or maintains its principal place of business, and the laws of that jurisdiction shall apply, except for the conflict of law provisions."},"tag":"Ol"},{"contents":{"content":"the original software is provided \"as-is\" and without any warranties of any kind, either express or implied, including, but not limited to, warranties of non-infringement, commercial usability, and fitness for a particular purpose. The warranties include, but are not limited to, the warranties of non-infringement, commercial usability, and fitness for a particular purpose. the entire risk to the quality of the original software is borne by you.","description":"There is no guarantee."},"tag":"Ol"},{"contents":{"content":"Any use of the original Software outside of the scope of this license or after the termination of this license is subject to the requirements and penalties of Section 101 of the U.S. Copyright Act, equivalent laws of other countries, and international treaties."},"tag":"Ol"},{"contents":{"content":"Under no conditions and on no theory of law, whether in tort (including negligence), contract or otherwise, shall Licensor be liable for any direct, indirect, special, incidental or consequential damages (including loss of goodwill, loss of business (including but not limited to commercial damage or loss, including but not limited to damage or loss due to outages, computer failure or malfunction). To the extent that applicable law does not permit such a limitation on liability for death or personal injury caused by the negligence of the copyright holder, such limitation shall not apply to such liability. Some countries or jurisdictions do not allow the exclusion or limitation of incidental or consequential damages as a matter of law, in which case this exclusion and limitation will not apply."},"tag":"Ol"},{"contents":{"content":"If you file a patent action, including cross-claims or counterclaims, alleging that the original Software directly or indirectly infringes a patent, this license will terminate upon formal filing of the patent action, unless you allege that the original Software infringes a patent by a combination of the original Software and other software or hardware. The license shall terminate upon formal filing of the patent action, unless the original software in combination with other software or hardware is alleged to infringe the patent."},"tag":"Ol"}],"permissions":[{"_str":"Actions:\n- Ol Use the obtained source code without modification (Use the fetched code as it is.)\n- Ol Using Modified Source Code\n- Ol Use the retrieved object code (Use the fetched code as it is.)\n- Ol Use the object code generated from the modified source code\n- Ol Distribute the obtained source code without modification (Redistribute the code as it was obtained)\n- Ol Display the obtained source code publicly\n- Ol Executing the fetched source code publicly\n- Ol Display the retrieved object code publicly\n- Ol Publicly execute the fetched object code\n- Ol Display modified source code publicly\n- Ol Publicly execute the modified source code\n- Ol Publicly display the object code generated from the modified source code\n- Ol Publicly execute the object code generated from the modified source code\n- Ol Use the retrieved executable (Use the obtained executable as is.)\n- Ol Use the executable generated from the modified source code\n- Ol Display the retrieved executable publicly\n- Ol Publicly execute the retrieved executable\n- Ol Publicly display the executable generated from modified source code\n- Ol Publicly execute executables generated from modified source code\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol RESTRICTION: An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n\n","actions":[{"contents":{"description":"Use the fetched code as it is.","name":"Use the obtained source code without modification"},"tag":"Ol"},{"contents":{"name":"Using Modified Source Code"},"tag":"Ol"},{"contents":{"description":"Use the fetched code as it is.","name":"Use the retrieved object code"},"tag":"Ol"},{"contents":{"name":"Use the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"description":"Redistribute the code as it was obtained","name":"Distribute the obtained source code without modification"},"tag":"Ol"},{"contents":{"name":"Display the obtained source code publicly"},"tag":"Ol"},{"contents":{"name":"Executing the fetched source code publicly"},"tag":"Ol"},{"contents":{"name":"Display the retrieved object code publicly"},"tag":"Ol"},{"contents":{"name":"Publicly execute the fetched object code"},"tag":"Ol"},{"contents":{"name":"Display modified source code publicly"},"tag":"Ol"},{"contents":{"name":"Publicly execute the modified source code"},"tag":"Ol"},{"contents":{"name":"Publicly display the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"name":"Publicly execute the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"description":"Use the obtained executable as is.","name":"Use the retrieved executable"},"tag":"Ol"},{"contents":{"name":"Use the executable generated from the modified source code"},"tag":"Ol"},{"contents":{"name":"Display the retrieved executable publicly"},"tag":"Ol"},{"contents":{"name":"Publicly execute the retrieved executable"},"tag":"Ol"},{"contents":{"name":"Publicly display the executable generated from modified source code"},"tag":"Ol"},{"contents":{"name":"Publicly execute executables generated from modified source code"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license.","type":"RESTRICTION"},"tag":"Ol"}]}},{"_str":"Actions:\n- Ol Distribute the obtained object code (Redistribute the code as it was obtained)\n- Ol Distribute the obtained executable (Redistribute the obtained executable as-is)\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol RESTRICTION: An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  OR\n    Ol OBLIGATION: Attach the source code corresponding to the software in question.\n    Ol OBLIGATION: The location of the repository that provides the source code corresponding to the original software at a lower cost is listed immediately after the copyright notice that applies to the original software.\n\n","actions":[{"contents":{"description":"Redistribute the code as it was obtained","name":"Distribute the obtained object code"},"tag":"Ol"},{"contents":{"description":"Redistribute the obtained executable as-is","name":"Distribute the obtained executable"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license.","type":"RESTRICTION"},"tag":"Ol"},{"OR":[{"contents":{"name":"Attach the source code corresponding to the software in question.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"The location of the repository that provides the source code corresponding to the original software at a lower cost is listed immediately after the copyright notice that applies to the original software.","type":"OBLIGATION"},"tag":"Ol"}]}]}},{"_str":"Description: Make sure the recipient knows that the change has been made.\nActions:\n- Ol Modify the obtained source code.\n- Ol Distribution of Modified Source Code\n- Ol Distribute the object code generated from the modified source code\n- Ol Distribute the executable generated from the modified source code\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol RESTRICTION: An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Include a description of any copyrights, patents, and trademarks contained in the software, as well as any trademark notices, licensing notices, and attributions to the initial developer or contributors.\n\n","actions":[{"contents":{"name":"Modify the obtained source code."},"tag":"Ol"},{"contents":{"name":"Distribution of Modified Source Code"},"tag":"Ol"},{"contents":{"name":"Distribute the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"name":"Distribute the executable generated from the modified source code"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, worldwide, royalty-free supplyable patent license is granted pursuant to this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Include a description of any copyrights, patents, and trademarks contained in the software, as well as any trademark notices, licensing notices, and attributions to the initial developer or contributors.","type":"OBLIGATION"},"tag":"Ol"}]},"description":"Make sure the recipient knows that the change has been made."},{"_str":"Actions:\n- Ol Use the contributor's name, trademark, or service mark to endorse or promote the derived product\n\nConditions:\nOl REQUISITE: Get special permission in writing.\n","actions":[{"contents":{"name":"Use the contributor's name, trademark, or service mark to endorse or promote the derived product"},"tag":"Ol"}],"conditions":{"contents":{"name":"Get special permission in writing.","type":"REQUISITE"},"tag":"Ol"}}]},"type":"HitachiOpenLicense"}]