[{"applicableLNs":{"contents":[{"contents":"spdx:Artistic-2.0","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","b8105ae3d175ac93ccd3a35fb648eaba"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","This license was released: 2006"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"The Artistic License 2.0\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package.  If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement.\n\nDefinitions\n\n     \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n     \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n     \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n     \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n     \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n     \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party.  It does not mean licensing fees.\n\n     \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n     \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder.\n\n     \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n     \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n     \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n(1) You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n(2) You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers.  At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n(3) You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder.  The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source\n\n(4) You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n     (a) make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n     (b) ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n     (c) allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n          (i) the Original License or\n          (ii) a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version.  Such instructions must be valid at the time of your distribution.  If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package\n\n(7)  You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package.  Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version\n\n(9) Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version.  In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n(11)  If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n(12)  This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The Artistic License 2.0</p>\n\n      </div>\n      <p>Copyright (c) 2000-2006, The Perl Foundation.</p>\n\n      <p>Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is\n         not allowed.</p>\n\n      <p>Preamble</p>\n\n      <p>This license establishes the terms under which a given free software Package may be copied, modified,\n         distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic\n         control over the development of that Package while still keeping the Package available as open source\n         and free software.</p>\n\n      <p>You are always permitted to make arrangements wholly outside of this license directly with the Copyright\n         Holder of a given Package. If the terms of this license do not permit the full use that you propose to\n         make of the Package, you should contact the Copyright Holder and seek a different licensing\n         arrangement.</p>\n\n      <p>Definitions</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <p>&quot;Copyright Holder&quot; means the individual(s) or organization(s) named in the copyright notice for\n         the entire Package.</p>\n\n         </li>\n        \n<li>\n            <p>&quot;Contributor&quot; means any party that has contributed code or other material to the Package, in\n         accordance with the Copyright Holder&apos;s procedures.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;You&quot; and &quot;your&quot; means any person who would like to copy, distribute, or modify the Package.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Package&quot; means the collection of files distributed by the Copyright Holder, and derivatives of\n         that collection and/or of those files. A given Package may consist of either the Standard Version, or\n         a Modified Version.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Distribute&quot; means providing a copy of the Package or making it accessible to anyone else, or\n         in the case of a company or organization, to others outside of your company or organization.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Distributor Fee&quot; means any fee that you charge for Distributing this Package or providing\n         support for this Package to another party. It does not mean licensing fees.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Standard Version&quot; refers to the Package if it has not been modified, or has been modified only\n         in ways explicitly requested by the Copyright Holder.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Modified Version&quot; means the Package, if it has been changed, and such changes were not\n         explicitly requested by the Copyright Holder.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Original License&quot; means this Artistic License as Distributed with the Standard Version of the\n         Package, in its current version or as it may be modified by The Perl Foundation in the future.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Source&quot; form means the source code, documentation source, and configuration files for the\n         Package.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Compiled&quot; form means the compiled bytecode, object code, binary, or any other form resulting\n         from mechanical transformation or translation of the Source form.</p>\n\n        </li>\n      \n</ul>\n\n      <p>Permission for Use and Modification Without Distribution</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (1)</var>\n          You are permitted to use the Standard Version and create and use Modified Versions for any\n             purpose without restriction, provided that you do not Distribute the Modified Version.\n        </li>\n      \n</ul>\n\n      <p>Permissions for Redistribution of the Standard Version</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (2)</var>\n          You may Distribute verbatim copies of the Source form of the Standard Version of this Package in\n             any medium without restriction, either gratis or for a Distributor Fee, provided that you\n             duplicate all of the original copyright notices and associated disclaimers. At your\n             discretion, such verbatim copies may or may not include a Compiled form of the Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (3)</var>\n          You may apply any bug fixes, portability changes, and other modifications made available from the\n             Copyright Holder. The resulting Package will still be considered the Standard Version, and as\n             such will be subject to the Original License.\n        </li>\n      \n</ul>\n\n      <p>Distribution of Modified Versions of the Package as Source</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (4)</var>\n          You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and\n             with or without a Compiled form of the Modified Version) provided that you clearly document\n             how it differs from the Standard Version, including, but not limited to, documenting any\n             non-standard features, executables, or modules, and provided that you do at least ONE of the\n             following:\n\t  \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (a)</var>\n              make the Modified Version available to the Copyright Holder of the Standard Version, under\n                 the Original License, so that the Copyright Holder may include your modifications in the\n                 Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (b)</var>\n              ensure that installation of your Modified Version does not prevent the user installing or\n                 running the Standard Version. In addition, the Modified Version must bear a name that is\n                 different from the name of the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (c)</var>\n              allow anyone who receives a copy of the Modified Version to make the Source form of the\n                 Modified Version available to others under\n            </li>\n\t       \n<li>\n\t       \n<ul style=\"list-style:none\">\n                  \n<li>\n                     <var class=\"replaceable-license-text\"> (i)</var>\n                the Original License or\n              </li>\n                  \n<li>\n                     <var class=\"replaceable-license-text\"> (ii)</var>\n                a license that permits the licensee to freely copy, modify and redistribute the Modified\n                   Version using the same licensing terms that apply to the copy that the licensee\n                   received, and requires that the Source form of the Modified Version, and of any works\n                   derived from it, be made freely available in that license fees are prohibited but\n                   Distributor Fees are allowed.\n              </li>\n               \n</ul>\n       \t       </li>\n          \n</ul>\n  \t</li>\n      \n</ul>\n\n      <p>Distribution of Compiled Forms of the Standard Version or Modified Versions without the Source</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (5)</var>\n          You may Distribute Compiled forms of the Standard Version without the Source, provided that you\n             include complete instructions on how to get the Source of the Standard Version. Such\n             instructions must be valid at the time of your distribution. If these instructions, at any\n             time while you are carrying out such distribution, become invalid, you must provide new\n             instructions on demand or cease further distribution. If you provide valid instructions or\n             cease distribution within thirty days after you become aware that the instructions are\n             invalid, then you do not forfeit any of your rights under this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (6)</var>\n          You may Distribute a Modified Version in Compiled form without the Source, provided that you\n             comply with Section 4 with respect to the Source of the Modified Version.\n        </li>\n      \n</ul>\n\n      <p>Aggregating or Linking the Package</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (7)</var>\n          You may aggregate the Package (either the Standard Version or Modified Version) with other\n             packages and Distribute the resulting aggregation provided that you do not charge a licensing\n             fee for the Package. Distributor Fees are permitted, and licensing fees for other components\n             in the aggregation are permitted. The terms of this license apply to the use and Distribution\n             of the Standard or Modified Versions as included in the aggregation.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (8)</var>\n          You are permitted to link Modified and Standard Versions with other works, to embed the Package\n             in a larger work of your own, or to build stand-alone binary or bytecode versions of\n             applications that include the Package, and Distribute the result without restriction, provided\n             the result does not expose a direct interface to the Package.\n        </li>\n      \n</ul>\n\n      <p>Items That are Not Considered Part of a Modified Version</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (9)</var>\n          Works (including, but not limited to, modules and scripts) that merely extend or make use of the\n             Package, do not, by themselves, cause the Package to be a Modified Version. In addition, such\n             works are not considered parts of the Package itself, and are not subject to the terms of this\n             license.\n        </li>\n      \n</ul>\n\n      <p>General Provisions</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (10)</var>\n          Any use, modification, and distribution of the Standard or Modified Versions is governed by this\n             Artistic License. By using, modifying or distributing the Package, you accept this license. Do\n             not use, modify, or distribute the Package, if you do not accept this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (11)</var>\n          If your Modified Version has been derived from a Modified Version made by someone other than you,\n             you are nevertheless required to ensure that your Modified Version complies with the\n             requirements of this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (12)</var>\n          This license does not grant you the right to use any trademark, service mark, tradename, or logo\n             of the Copyright Holder.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (13)</var>\n          This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have\n             made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any\n             patent claims licensable by the Copyright Holder that are necessarily infringed by the\n             Package. If you institute patent litigation (including a cross-claim or counterclaim) against\n             any party alleging that the Package constitutes direct or contributory patent infringement,\n             then this Artistic License to you shall terminate on the date that such litigation is\n             filed.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (14)</var>\n          Disclaimer of Warranty:\n          <p>THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS &quot;AS IS&quot; AND WITHOUT ANY\n         EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\n         PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED\n         BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR\n         CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE\n         POSSIBILITY OF SUCH DAMAGE.</p>\n\n        </li>\n      \n</ul>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/artistic-license-2.0"],"tag":"LicenseUrl"},{"contents":[null,"https://www.perlfoundation.org/artistic-license-20.html"],"tag":"LicenseUrl"},{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},{"contents":[null,"https://www.perlfoundation.org/artistic-license-20.html"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/artistic-license-2.0"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:01:07Z","url":"http://www.perlfoundation.org/artistic_license_2_0"},{"isLive":false,"isValid":true,"isWayBackLink":false,"match":"N/A","order":2,"timestamp":"2024-04-17T05:01:08Z","url":"https://opensource.org/licenses/artistic-license-2.0"},{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":1,"timestamp":"2024-04-17T05:01:08Z","url":"https://www.perlfoundation.org/artistic-license-20.html"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":true,"licenseComments":"This license was released: 2006","licenseId":"spdx:Artistic-2.0","licenseText":"The Artistic License 2.0\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package.  If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement.\n\nDefinitions\n\n     \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n     \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n     \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n     \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n     \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n     \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party.  It does not mean licensing fees.\n\n     \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n     \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder.\n\n     \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n     \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n     \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n(1) You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n(2) You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers.  At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n(3) You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder.  The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source\n\n(4) You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n     (a) make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n     (b) ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n     (c) allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n          (i) the Original License or\n          (ii) a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version.  Such instructions must be valid at the time of your distribution.  If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package\n\n(7)  You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package.  Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version\n\n(9) Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version.  In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n(11)  If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n(12)  This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The Artistic License 2.0</p>\n\n      </div>\n      <p>Copyright (c) 2000-2006, The Perl Foundation.</p>\n\n      <p>Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is\n         not allowed.</p>\n\n      <p>Preamble</p>\n\n      <p>This license establishes the terms under which a given free software Package may be copied, modified,\n         distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic\n         control over the development of that Package while still keeping the Package available as open source\n         and free software.</p>\n\n      <p>You are always permitted to make arrangements wholly outside of this license directly with the Copyright\n         Holder of a given Package. If the terms of this license do not permit the full use that you propose to\n         make of the Package, you should contact the Copyright Holder and seek a different licensing\n         arrangement.</p>\n\n      <p>Definitions</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <p>&quot;Copyright Holder&quot; means the individual(s) or organization(s) named in the copyright notice for\n         the entire Package.</p>\n\n         </li>\n        \n<li>\n            <p>&quot;Contributor&quot; means any party that has contributed code or other material to the Package, in\n         accordance with the Copyright Holder&apos;s procedures.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;You&quot; and &quot;your&quot; means any person who would like to copy, distribute, or modify the Package.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Package&quot; means the collection of files distributed by the Copyright Holder, and derivatives of\n         that collection and/or of those files. A given Package may consist of either the Standard Version, or\n         a Modified Version.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Distribute&quot; means providing a copy of the Package or making it accessible to anyone else, or\n         in the case of a company or organization, to others outside of your company or organization.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Distributor Fee&quot; means any fee that you charge for Distributing this Package or providing\n         support for this Package to another party. It does not mean licensing fees.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Standard Version&quot; refers to the Package if it has not been modified, or has been modified only\n         in ways explicitly requested by the Copyright Holder.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Modified Version&quot; means the Package, if it has been changed, and such changes were not\n         explicitly requested by the Copyright Holder.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Original License&quot; means this Artistic License as Distributed with the Standard Version of the\n         Package, in its current version or as it may be modified by The Perl Foundation in the future.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Source&quot; form means the source code, documentation source, and configuration files for the\n         Package.</p>\n\n        </li>\n        \n<li>\n            <p>&quot;Compiled&quot; form means the compiled bytecode, object code, binary, or any other form resulting\n         from mechanical transformation or translation of the Source form.</p>\n\n        </li>\n      \n</ul>\n\n      <p>Permission for Use and Modification Without Distribution</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (1)</var>\n          You are permitted to use the Standard Version and create and use Modified Versions for any\n             purpose without restriction, provided that you do not Distribute the Modified Version.\n        </li>\n      \n</ul>\n\n      <p>Permissions for Redistribution of the Standard Version</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (2)</var>\n          You may Distribute verbatim copies of the Source form of the Standard Version of this Package in\n             any medium without restriction, either gratis or for a Distributor Fee, provided that you\n             duplicate all of the original copyright notices and associated disclaimers. At your\n             discretion, such verbatim copies may or may not include a Compiled form of the Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (3)</var>\n          You may apply any bug fixes, portability changes, and other modifications made available from the\n             Copyright Holder. The resulting Package will still be considered the Standard Version, and as\n             such will be subject to the Original License.\n        </li>\n      \n</ul>\n\n      <p>Distribution of Modified Versions of the Package as Source</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (4)</var>\n          You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and\n             with or without a Compiled form of the Modified Version) provided that you clearly document\n             how it differs from the Standard Version, including, but not limited to, documenting any\n             non-standard features, executables, or modules, and provided that you do at least ONE of the\n             following:\n\t  \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (a)</var>\n              make the Modified Version available to the Copyright Holder of the Standard Version, under\n                 the Original License, so that the Copyright Holder may include your modifications in the\n                 Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (b)</var>\n              ensure that installation of your Modified Version does not prevent the user installing or\n                 running the Standard Version. In addition, the Modified Version must bear a name that is\n                 different from the name of the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> (c)</var>\n              allow anyone who receives a copy of the Modified Version to make the Source form of the\n                 Modified Version available to others under\n            </li>\n\t       \n<li>\n\t       \n<ul style=\"list-style:none\">\n                  \n<li>\n                     <var class=\"replaceable-license-text\"> (i)</var>\n                the Original License or\n              </li>\n                  \n<li>\n                     <var class=\"replaceable-license-text\"> (ii)</var>\n                a license that permits the licensee to freely copy, modify and redistribute the Modified\n                   Version using the same licensing terms that apply to the copy that the licensee\n                   received, and requires that the Source form of the Modified Version, and of any works\n                   derived from it, be made freely available in that license fees are prohibited but\n                   Distributor Fees are allowed.\n              </li>\n               \n</ul>\n       \t       </li>\n          \n</ul>\n  \t</li>\n      \n</ul>\n\n      <p>Distribution of Compiled Forms of the Standard Version or Modified Versions without the Source</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (5)</var>\n          You may Distribute Compiled forms of the Standard Version without the Source, provided that you\n             include complete instructions on how to get the Source of the Standard Version. Such\n             instructions must be valid at the time of your distribution. If these instructions, at any\n             time while you are carrying out such distribution, become invalid, you must provide new\n             instructions on demand or cease further distribution. If you provide valid instructions or\n             cease distribution within thirty days after you become aware that the instructions are\n             invalid, then you do not forfeit any of your rights under this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (6)</var>\n          You may Distribute a Modified Version in Compiled form without the Source, provided that you\n             comply with Section 4 with respect to the Source of the Modified Version.\n        </li>\n      \n</ul>\n\n      <p>Aggregating or Linking the Package</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (7)</var>\n          You may aggregate the Package (either the Standard Version or Modified Version) with other\n             packages and Distribute the resulting aggregation provided that you do not charge a licensing\n             fee for the Package. Distributor Fees are permitted, and licensing fees for other components\n             in the aggregation are permitted. The terms of this license apply to the use and Distribution\n             of the Standard or Modified Versions as included in the aggregation.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (8)</var>\n          You are permitted to link Modified and Standard Versions with other works, to embed the Package\n             in a larger work of your own, or to build stand-alone binary or bytecode versions of\n             applications that include the Package, and Distribute the result without restriction, provided\n             the result does not expose a direct interface to the Package.\n        </li>\n      \n</ul>\n\n      <p>Items That are Not Considered Part of a Modified Version</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (9)</var>\n          Works (including, but not limited to, modules and scripts) that merely extend or make use of the\n             Package, do not, by themselves, cause the Package to be a Modified Version. In addition, such\n             works are not considered parts of the Package itself, and are not subject to the terms of this\n             license.\n        </li>\n      \n</ul>\n\n      <p>General Provisions</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> (10)</var>\n          Any use, modification, and distribution of the Standard or Modified Versions is governed by this\n             Artistic License. By using, modifying or distributing the Package, you accept this license. Do\n             not use, modify, or distribute the Package, if you do not accept this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (11)</var>\n          If your Modified Version has been derived from a Modified Version made by someone other than you,\n             you are nevertheless required to ensure that your Modified Version complies with the\n             requirements of this license.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (12)</var>\n          This license does not grant you the right to use any trademark, service mark, tradename, or logo\n             of the Copyright Holder.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (13)</var>\n          This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have\n             made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any\n             patent claims licensable by the Copyright Holder that are necessarily infringed by the\n             Package. If you institute patent litigation (including a cross-claim or counterclaim) against\n             any party alleging that the Package constitutes direct or contributory patent infringement,\n             then this Artistic License to you shall terminate on the date that such litigation is\n             filed.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> (14)</var>\n          Disclaimer of Warranty:\n          <p>THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS &quot;AS IS&quot; AND WITHOUT ANY\n         EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\n         PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED\n         BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR\n         CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE\n         POSSIBILITY OF SUCH DAMAGE.</p>\n\n        </li>\n      \n</ul>\n    ","name":"Artistic License 2.0","seeAlso":["http://www.perlfoundation.org/artistic_license_2_0","https://www.perlfoundation.org/artistic-license-20.html","https://opensource.org/licenses/artistic-license-2.0"],"standardLicenseTemplate":"<<beginOptional>>The Artistic License 2.0\n\n<<endOptional>>\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package. If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement.\n\nDefinitions\n\n   \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n   \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n   \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n   \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n   \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n   \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party. It does not mean licensing fees.\n\n   \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n   \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder.\n\n   \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n   \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n   \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n   <<var;name=\"bullet\";original=\"(1)\";match=\".{0,20}\">> You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n   <<var;name=\"bullet\";original=\"(2)\";match=\".{0,20}\">> You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers. At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n   <<var;name=\"bullet\";original=\"(3)\";match=\".{0,20}\">> You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder. The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source\n\n   <<var;name=\"bullet\";original=\"(4)\";match=\".{0,20}\">> You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"(a)\";match=\".{0,20}\">> make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n\n      <<var;name=\"bullet\";original=\"(b)\";match=\".{0,20}\">> ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n\n      <<var;name=\"bullet\";original=\"(c)\";match=\".{0,20}\">> allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n         <<var;name=\"bullet\";original=\"(i)\";match=\".{0,20}\">> the Original License or\n\n         <<var;name=\"bullet\";original=\"(ii)\";match=\".{0,20}\">> a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n   <<var;name=\"bullet\";original=\"(5)\";match=\".{0,20}\">> You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version. Such instructions must be valid at the time of your distribution. If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n   <<var;name=\"bullet\";original=\"(6)\";match=\".{0,20}\">> You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package\n\n   <<var;name=\"bullet\";original=\"(7)\";match=\".{0,20}\">> You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package. Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n   <<var;name=\"bullet\";original=\"(8)\";match=\".{0,20}\">> You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version\n\n   <<var;name=\"bullet\";original=\"(9)\";match=\".{0,20}\">> Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version. In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n   <<var;name=\"bullet\";original=\"(10)\";match=\".{0,20}\">> Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n   <<var;name=\"bullet\";original=\"(11)\";match=\".{0,20}\">> If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n   <<var;name=\"bullet\";original=\"(12)\";match=\".{0,20}\">> This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n   <<var;name=\"bullet\";original=\"(13)\";match=\".{0,20}\">> This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n   <<var;name=\"bullet\";original=\"(14)\";match=\".{0,20}\">> Disclaimer of Warranty:\n\n   THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n   "},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"osi:Artistic-2.0","tag":"LN"},[{"contents":"Artistic License, Version 2.0","tag":"LN"},{"contents":"DEP5:Artistic-2.0","tag":"LN"},{"contents":"SPDX:Artistic-2.0","tag":"LN"},{"contents":"Trove:License :: OSI Approved :: Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["OSILicense","fd9b7e47b13a3489e4f3bae0c944fb25"],"impliedStmts":[{"contents":["OSI Page","https://opensource.org/licenses/Artistic-2.0"],"tag":"LicenseUrl"},{"contents":"miscellaneous","tag":"LicenseStatement"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"id":"Artistic-2.0","identifiers":[{"identifier":"Artistic-2.0","scheme":"DEP5"},{"identifier":"Artistic-2.0","scheme":"SPDX"},{"identifier":"License :: OSI Approved :: Artistic License","scheme":"Trove"}],"keywords":["miscellaneous","osi-approved"],"links":[{"note":"OSI Page","url":"https://opensource.org/licenses/Artistic-2.0"}],"name":"Artistic License, Version 2.0","other_names":[],"superseded_by":null,"text":[{"media_type":"text/html","title":"HTML","url":"https://opensource.org/licenses/Artistic-2.0"}]},"type":"OSILicense"},{"applicableLNs":{"contents":[{"contents":"google:Artistic20","tag":"LN"},[{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","36a7f1ce15eaccd0c00d2bc123ecba35"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:Artistic20","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:Artistic-2.0"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:Artistic-2.0","tag":"LN"},[{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic 2.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","168f83ef5b02f761f5737c9b60360887"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":["Artistic 2.0"],"_legacy_names":["Artistic 2.0"],"_notes":null},"_id":"Artistic-2.0","_license":{"_expression":"spdx:Artistic-2.0","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":["http://www.perlfoundation.org/artistic_license_2_0"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"BlueOak:Artistic-2.0","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","af10a2ec2405bf5870e9d8e5d93c221a"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Bronze",{"contents":"These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/Artistic-2.0.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Bronze","These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.",{"_id":"Artistic-2.0","_name":"Artistic License 2.0","_url":"https://spdx.org/licenses/Artistic-2.0.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"osadl:Artistic-2.0","tag":"LN"},[{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["OSADLRule","5aaf3f716e5813d9772ee24af003352f"],"impliedStmts":[{"contents":[{"contents":"USE CASE Source code delivery\n\tYOU MUST Provide Copyright notices\n\tYOU MUST Provide Warranty disclaimer\n\tIF Software modification\n\t\tEXCEPT IF Provided By Copyright holder\n\t\t\tYOU MUST Provide Modification report\n\t\tEITHER\n\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\tATTRIBUTE Original license\n\t\tOR\n\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\tYOU MUST Rename Modified work\n\t\tOR\n\t\t\tEITHER\n\t\t\t\tYOU MUST Use Original license\n\t\t\tOR\n\t\t\t\tYOU MUST Use Strong copyleft license\n\tYOU MUST NOT Require License fee\nUSE CASE Binary delivery\n\tYOU MUST Provide Pointer To Source code\n\t\tIF Pointer Expires\n\t\t\tEITHER\n\t\t\t\tYOU MUST Provide Pointer On Request\n\t\t\t\t\tATTRIBUTE Within 30 days\n\t\t\tOR\n\t\t\t\tYOU MUST End Binary delivery\n\t\t\t\t\tATTRIBUTE Within 30 days\n\tIF Software modification\n\t\tEXCEPT IF Provided By Copyright holder\n\t\t\tYOU MUST Provide Modification report\n\t\tEITHER\n\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\tATTRIBUTE Original license\n\t\tOR\n\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\tYOU MUST Rename Modified work\n\t\tOR\n\t\t\tEITHER\n\t\t\t\tYOU MUST Use Original license\n\t\t\tOR\n\t\t\t\tYOU MUST Use Strong copyleft license\n\tIF Linked work\n\t\tEITHER\n\t\t\tYOU MUST NOT Provide Interface To Work\n\t\tOR\n\t\t\tYOU MUST Provide Modification report\n\t\t\tEITHER\n\t\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\t\tATTRIBUTE Original license\n\t\t\tOR\n\t\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\t\tYOU MUST Rename Modified work\n\t\t\tOR\n\t\t\t\tEITHER\n\t\t\t\t\tYOU MUST Use Original license\n\t\t\t\tOR\n\t\t\t\t\tYOU MUST Use Strong copyleft license\n\tYOU MUST NOT Require License fee\nPATENT HINTS Yes\n","tag":"LicenseRule"},[{"contents":null,"tag":"MaybeStatement"},{"contents":"Patent hint","tag":"LicenseStatement"},{"contents":null,"tag":"MaybeStatement"}]],"tag":"SubStatements"}],"raw":{"osadlRule":"USE CASE Source code delivery\n\tYOU MUST Provide Copyright notices\n\tYOU MUST Provide Warranty disclaimer\n\tIF Software modification\n\t\tEXCEPT IF Provided By Copyright holder\n\t\t\tYOU MUST Provide Modification report\n\t\tEITHER\n\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\tATTRIBUTE Original license\n\t\tOR\n\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\tYOU MUST Rename Modified work\n\t\tOR\n\t\t\tEITHER\n\t\t\t\tYOU MUST Use Original license\n\t\t\tOR\n\t\t\t\tYOU MUST Use Strong copyleft license\n\tYOU MUST NOT Require License fee\nUSE CASE Binary delivery\n\tYOU MUST Provide Pointer To Source code\n\t\tIF Pointer Expires\n\t\t\tEITHER\n\t\t\t\tYOU MUST Provide Pointer On Request\n\t\t\t\t\tATTRIBUTE Within 30 days\n\t\t\tOR\n\t\t\t\tYOU MUST End Binary delivery\n\t\t\t\t\tATTRIBUTE Within 30 days\n\tIF Software modification\n\t\tEXCEPT IF Provided By Copyright holder\n\t\t\tYOU MUST Provide Modification report\n\t\tEITHER\n\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\tATTRIBUTE Original license\n\t\tOR\n\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\tYOU MUST Rename Modified work\n\t\tOR\n\t\t\tEITHER\n\t\t\t\tYOU MUST Use Original license\n\t\t\tOR\n\t\t\t\tYOU MUST Use Strong copyleft license\n\tIF Linked work\n\t\tEITHER\n\t\t\tYOU MUST NOT Provide Interface To Work\n\t\tOR\n\t\t\tYOU MUST Provide Modification report\n\t\t\tEITHER\n\t\t\t\tYOU MUST Provide Source code Of Modified work\n\t\t\t\t\tATTRIBUTE To Copyright holder Of Original work\n\t\t\t\t\tATTRIBUTE Original license\n\t\t\tOR\n\t\t\t\tYOU MUST NOT Impede Installation Of Original work\n\t\t\t\tYOU MUST NOT Impede Running Original work\n\t\t\t\tYOU MUST Rename Modified work\n\t\t\tOR\n\t\t\t\tEITHER\n\t\t\t\t\tYOU MUST Use Original license\n\t\t\t\tOR\n\t\t\t\t\tYOU MUST Use Strong copyleft license\n\tYOU MUST NOT Require License fee\nPATENT HINTS Yes\n","spdxId":"osadl:Artistic-2.0"},"type":"OSADLRule"},{"applicableLNs":{"contents":"osadl:Artistic-2.0","tag":"LN"},"id":["OSADLMatrix","0d64c11e28b1cb67e8b1d699b963c0f2"],"impliedStmts":[{"contents":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Same","_explanation":"n.a.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BlueOak-1.0.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BlueOak-1.0.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4.3TAHOE license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4.3TAHOE"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FTL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-bsla-no-advert license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-bsla-no-advert"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT-0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OGC-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"OGC-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Spencer-86 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Spencer-86"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ZPL-2.0"}],"tag":"LicenseCompatibilities"}],"raw":{"_name":"osadl:Artistic-2.0","compatibilities":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Same","_explanation":"n.a.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BlueOak-1.0.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BlueOak-1.0.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4.3TAHOE license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-4.3TAHOE"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FTL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-bsla-no-advert license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-bsla-no-advert"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT-0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OGC-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"OGC-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the Artistic-2.0 license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Spencer-86 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Spencer-86"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the Artistic-2.0 license are generally considered mutually compatible.","_other":"ZPL-2.0"}]},"type":"OSADLMatrix"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fsf:ArtisticLicense2","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FSF","a29a025805288360e2133d07ec392967"],"impliedStmts":[{"contents":[null,"https://www.gnu.org/licenses/license-list.html#ArtisticLicense2"],"tag":"LicenseUrl"},{"contents":[null,"http://directory.fsf.org/wiki/License:ArtisticLicense2.0"],"tag":"LicenseUrl"},{"contents":{"contents":["FSF","gpl-2-compatible",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["FSF","gpl-3-compatible",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_id":"fsf:ArtisticLicense2","_identifiers":{"spdx":["Artistic-2.0"]},"_name":"Artistic License 2.0","_tags":["gpl-2-compatible","gpl-3-compatible","libre"],"_uris":["https://www.gnu.org/licenses/license-list.html#ArtisticLicense2","http://directory.fsf.org/wiki/License:ArtisticLicense2.0"]},"type":"FSF"},{"applicableLNs":{"contents":[{"contents":[{"contents":"cal:artistic-2","tag":"LN"},[{"contents":"spdx:Artistic-2.0","tag":"LN"},{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["ChooseALicense","9e0a9fcd2a478f06ba3878007099ee47"],"impliedStmts":[{"contents":{"contents":{"contents":["ChooseALicense","Heavily favored by the Perl community, the Artistic license requires that modified versions of the software do not prevent users from running the standard version."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["ChooseALicense","How to apply this license:\nCreate a text file (typically named LICENSE or LICENSE.txt) in the root of your source code and copy the text of the license into the file. Do not replace the copyright notice (year, author), which refers to the license itself, not the licensed project."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":{"_conditions":["include-copyright","document-changes"],"_limitations":["liability","trademark-use","warranty"],"_permissions":["commercial-use","modifications","distribution","patent-use","private-use"],"_restrictions":[]},"tag":"LicensePCLR"}],"raw":{"_cal_conditions":["include-copyright","document-changes"],"_cal_limitations":["liability","trademark-use","warranty"],"_cal_permissions":["commercial-use","modifications","distribution","patent-use","private-use"],"_description":"Heavily favored by the Perl community, the Artistic license requires that modified versions of the software do not prevent users from running the standard version.","_featured":null,"_hidden":null,"_how":"Create a text file (typically named LICENSE or LICENSE.txt) in the root of your source code and copy the text of the license into the file. Do not replace the copyright notice (year, author), which refers to the license itself, not the licensed project.","_id":"cal:artistic-2","_name":null,"_nickname":null,"_spdxId":"spdx:Artistic-2.0","_title":"Artistic License 2.0"},"type":"ChooseALicense"},{"applicableLNs":{"contents":[{"contents":"scancode:artistic-2.0","tag":"LN"},[{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","00f49ab10cbf288b4c1fa48464ee5147"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://www.perlfoundation.org/","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":"https://www.opensource.org/licenses/artistic-license-2.0.php","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this version was released 2006 This license is OSI\ncertifified.\n"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":["OSI","https://www.opensource.org/licenses/artistic-license-2.0.php"],"tag":"LicenseUrl"},{"contents":[null,"https://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},{"contents":[null,"https://www.perlfoundation.org/attachment/legal/artistic-2_0.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/artistic-license-2.0"],"tag":"LicenseUrl"},{"contents":[null,"https://www.opensource.org/licenses/artistic-license-2.0"],"tag":"LicenseUrl"},{"contents":[null,"https://www.perlfoundation.org/artistic-license-20.html"],"tag":"LicenseUrl"},{"contents":"               The Artistic License 2.0\n\n        Copyright (c) 2000-2006, The Perl Foundation.\n\n     Everyone is permitted to copy and distribute verbatim copies\n      of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software\nPackage may be copied, modified, distributed, and/or redistributed.\nThe intent is that the Copyright Holder maintains some artistic\ncontrol over the development of that Package while still keeping the\nPackage available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this\nlicense directly with the Copyright Holder of a given Package.  If the\nterms of this license do not permit the full use that you propose to\nmake of the Package, you should contact the Copyright Holder and seek\na different licensing arrangement. \n\nDefinitions\n\n    \"Copyright Holder\" means the individual(s) or organization(s)\n    named in the copyright notice for the entire Package.\n\n    \"Contributor\" means any party that has contributed code or other\n    material to the Package, in accordance with the Copyright Holder's\n    procedures.\n\n    \"You\" and \"your\" means any person who would like to copy,\n    distribute, or modify the Package.\n\n    \"Package\" means the collection of files distributed by the\n    Copyright Holder, and derivatives of that collection and/or of\n    those files. A given Package may consist of either the Standard\n    Version, or a Modified Version.\n\n    \"Distribute\" means providing a copy of the Package or making it\n    accessible to anyone else, or in the case of a company or\n    organization, to others outside of your company or organization.\n\n    \"Distributor Fee\" means any fee that you charge for Distributing\n    this Package or providing support for this Package to another\n    party.  It does not mean licensing fees.\n\n    \"Standard Version\" refers to the Package if it has not been\n    modified, or has been modified only in ways explicitly requested\n    by the Copyright Holder.\n\n    \"Modified Version\" means the Package, if it has been changed, and\n    such changes were not explicitly requested by the Copyright\n    Holder. \n\n    \"Original License\" means this Artistic License as Distributed with\n    the Standard Version of the Package, in its current version or as\n    it may be modified by The Perl Foundation in the future.\n\n    \"Source\" form means the source code, documentation source, and\n    configuration files for the Package.\n\n    \"Compiled\" form means the compiled bytecode, object code, binary,\n    or any other form resulting from mechanical transformation or\n    translation of the Source form.\n\n\nPermission for Use and Modification Without Distribution\n\n(1)  You are permitted to use the Standard Version and create and use\nModified Versions for any purpose without restriction, provided that\nyou do not Distribute the Modified Version.\n\n\nPermissions for Redistribution of the Standard Version\n\n(2)  You may Distribute verbatim copies of the Source form of the\nStandard Version of this Package in any medium without restriction,\neither gratis or for a Distributor Fee, provided that you duplicate\nall of the original copyright notices and associated disclaimers.  At\nyour discretion, such verbatim copies may or may not include a\nCompiled form of the Package.\n\n(3)  You may apply any bug fixes, portability changes, and other\nmodifications made available from the Copyright Holder.  The resulting\nPackage will still be considered the Standard Version, and as such\nwill be subject to the Original License.\n\n\nDistribution of Modified Versions of the Package as Source \n\n(4)  You may Distribute your Modified Version as Source (either gratis\nor for a Distributor Fee, and with or without a Compiled form of the\nModified Version) provided that you clearly document how it differs\nfrom the Standard Version, including, but not limited to, documenting\nany non-standard features, executables, or modules, and provided that\nyou do at least ONE of the following:\n\n    (a)  make the Modified Version available to the Copyright Holder\n    of the Standard Version, under the Original License, so that the\n    Copyright Holder may include your modifications in the Standard\n    Version.\n\n    (b)  ensure that installation of your Modified Version does not\n    prevent the user installing or running the Standard Version. In\n    addition, the Modified Version must bear a name that is different\n    from the name of the Standard Version.\n\n    (c)  allow anyone who receives a copy of the Modified Version to\n    make the Source form of the Modified Version available to others\n    under\n        \n    (i)  the Original License or\n\n    (ii)  a license that permits the licensee to freely copy,\n    modify and redistribute the Modified Version using the same\n    licensing terms that apply to the copy that the licensee\n    received, and requires that the Source form of the Modified\n    Version, and of any works derived from it, be made freely\n    available in that license fees are prohibited but Distributor\n    Fees are allowed.\n\n\nDistribution of Compiled Forms of the Standard Version \nor Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without\nthe Source, provided that you include complete instructions on how to\nget the Source of the Standard Version.  Such instructions must be\nvalid at the time of your distribution.  If these instructions, at any\ntime while you are carrying out such distribution, become invalid, you\nmust provide new instructions on demand or cease further distribution.\nIf you provide valid instructions or cease distribution within thirty\ndays after you become aware that the instructions are invalid, then\nyou do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without\nthe Source, provided that you comply with Section 4 with respect to\nthe Source of the Modified Version.\n\n\nAggregating or Linking the Package \n\n(7)  You may aggregate the Package (either the Standard Version or\nModified Version) with other packages and Distribute the resulting\naggregation provided that you do not charge a licensing fee for the\nPackage.  Distributor Fees are permitted, and licensing fees for other\ncomponents in the aggregation are permitted. The terms of this license\napply to the use and Distribution of the Standard or Modified Versions\nas included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with\nother works, to embed the Package in a larger work of your own, or to\nbuild stand-alone binary or bytecode versions of applications that\ninclude the Package, and Distribute the result without restriction,\nprovided the result does not expose a direct interface to the Package.\n\n\nItems That are Not Considered Part of a Modified Version \n\n(9) Works (including, but not limited to, modules and scripts) that\nmerely extend or make use of the Package, do not, by themselves, cause\nthe Package to be a Modified Version.  In addition, such works are not\nconsidered parts of the Package itself, and are not subject to the\nterms of this license.\n\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or\nModified Versions is governed by this Artistic License. By using,\nmodifying or distributing the Package, you accept this license. Do not\nuse, modify, or distribute the Package, if you do not accept this\nlicense.\n\n(11)  If your Modified Version has been derived from a Modified\nVersion made by someone other than you, you are nevertheless required\nto ensure that your Modified Version complies with the requirements of\nthis license.\n\n(12)  This license does not grant you the right to use any trademark,\nservice mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide,\nfree-of-charge patent license to make, have made, use, offer to sell,\nsell, import and otherwise transfer the Package with respect to any\npatent claims licensable by the Copyright Holder that are necessarily\ninfringed by the Package. If you institute patent litigation\n(including a cross-claim or counterclaim) against any party alleging\nthat the Package constitutes direct or contributory patent\ninfringement, then this Artistic License to you shall terminate on the\ndate that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\nIS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\nNON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\nLAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\nBE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://www.perlfoundation.org/","_key":"artistic-2.0","_name":"Artistic License 2.0","_notes":"Per SPDX.org, this version was released 2006 This license is OSI\ncertifified.\n","_osiUrl":"https://www.opensource.org/licenses/artistic-license-2.0.php","_otherUrls":["http://www.perlfoundation.org/artistic_license_2_0","https://opensource.org/licenses/artistic-license-2.0","https://www.opensource.org/licenses/artistic-license-2.0","https://www.perlfoundation.org/artistic-license-20.html"],"_owner":"Perl Foundation","_shortName":"Artistic 2.0","_spdxId":"Artistic-2.0","_text":"               The Artistic License 2.0\n\n        Copyright (c) 2000-2006, The Perl Foundation.\n\n     Everyone is permitted to copy and distribute verbatim copies\n      of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software\nPackage may be copied, modified, distributed, and/or redistributed.\nThe intent is that the Copyright Holder maintains some artistic\ncontrol over the development of that Package while still keeping the\nPackage available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this\nlicense directly with the Copyright Holder of a given Package.  If the\nterms of this license do not permit the full use that you propose to\nmake of the Package, you should contact the Copyright Holder and seek\na different licensing arrangement. \n\nDefinitions\n\n    \"Copyright Holder\" means the individual(s) or organization(s)\n    named in the copyright notice for the entire Package.\n\n    \"Contributor\" means any party that has contributed code or other\n    material to the Package, in accordance with the Copyright Holder's\n    procedures.\n\n    \"You\" and \"your\" means any person who would like to copy,\n    distribute, or modify the Package.\n\n    \"Package\" means the collection of files distributed by the\n    Copyright Holder, and derivatives of that collection and/or of\n    those files. A given Package may consist of either the Standard\n    Version, or a Modified Version.\n\n    \"Distribute\" means providing a copy of the Package or making it\n    accessible to anyone else, or in the case of a company or\n    organization, to others outside of your company or organization.\n\n    \"Distributor Fee\" means any fee that you charge for Distributing\n    this Package or providing support for this Package to another\n    party.  It does not mean licensing fees.\n\n    \"Standard Version\" refers to the Package if it has not been\n    modified, or has been modified only in ways explicitly requested\n    by the Copyright Holder.\n\n    \"Modified Version\" means the Package, if it has been changed, and\n    such changes were not explicitly requested by the Copyright\n    Holder. \n\n    \"Original License\" means this Artistic License as Distributed with\n    the Standard Version of the Package, in its current version or as\n    it may be modified by The Perl Foundation in the future.\n\n    \"Source\" form means the source code, documentation source, and\n    configuration files for the Package.\n\n    \"Compiled\" form means the compiled bytecode, object code, binary,\n    or any other form resulting from mechanical transformation or\n    translation of the Source form.\n\n\nPermission for Use and Modification Without Distribution\n\n(1)  You are permitted to use the Standard Version and create and use\nModified Versions for any purpose without restriction, provided that\nyou do not Distribute the Modified Version.\n\n\nPermissions for Redistribution of the Standard Version\n\n(2)  You may Distribute verbatim copies of the Source form of the\nStandard Version of this Package in any medium without restriction,\neither gratis or for a Distributor Fee, provided that you duplicate\nall of the original copyright notices and associated disclaimers.  At\nyour discretion, such verbatim copies may or may not include a\nCompiled form of the Package.\n\n(3)  You may apply any bug fixes, portability changes, and other\nmodifications made available from the Copyright Holder.  The resulting\nPackage will still be considered the Standard Version, and as such\nwill be subject to the Original License.\n\n\nDistribution of Modified Versions of the Package as Source \n\n(4)  You may Distribute your Modified Version as Source (either gratis\nor for a Distributor Fee, and with or without a Compiled form of the\nModified Version) provided that you clearly document how it differs\nfrom the Standard Version, including, but not limited to, documenting\nany non-standard features, executables, or modules, and provided that\nyou do at least ONE of the following:\n\n    (a)  make the Modified Version available to the Copyright Holder\n    of the Standard Version, under the Original License, so that the\n    Copyright Holder may include your modifications in the Standard\n    Version.\n\n    (b)  ensure that installation of your Modified Version does not\n    prevent the user installing or running the Standard Version. In\n    addition, the Modified Version must bear a name that is different\n    from the name of the Standard Version.\n\n    (c)  allow anyone who receives a copy of the Modified Version to\n    make the Source form of the Modified Version available to others\n    under\n        \n    (i)  the Original License or\n\n    (ii)  a license that permits the licensee to freely copy,\n    modify and redistribute the Modified Version using the same\n    licensing terms that apply to the copy that the licensee\n    received, and requires that the Source form of the Modified\n    Version, and of any works derived from it, be made freely\n    available in that license fees are prohibited but Distributor\n    Fees are allowed.\n\n\nDistribution of Compiled Forms of the Standard Version \nor Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without\nthe Source, provided that you include complete instructions on how to\nget the Source of the Standard Version.  Such instructions must be\nvalid at the time of your distribution.  If these instructions, at any\ntime while you are carrying out such distribution, become invalid, you\nmust provide new instructions on demand or cease further distribution.\nIf you provide valid instructions or cease distribution within thirty\ndays after you become aware that the instructions are invalid, then\nyou do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without\nthe Source, provided that you comply with Section 4 with respect to\nthe Source of the Modified Version.\n\n\nAggregating or Linking the Package \n\n(7)  You may aggregate the Package (either the Standard Version or\nModified Version) with other packages and Distribute the resulting\naggregation provided that you do not charge a licensing fee for the\nPackage.  Distributor Fees are permitted, and licensing fees for other\ncomponents in the aggregation are permitted. The terms of this license\napply to the use and Distribution of the Standard or Modified Versions\nas included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with\nother works, to embed the Package in a larger work of your own, or to\nbuild stand-alone binary or bytecode versions of applications that\ninclude the Package, and Distribute the result without restriction,\nprovided the result does not expose a direct interface to the Package.\n\n\nItems That are Not Considered Part of a Modified Version \n\n(9) Works (including, but not limited to, modules and scripts) that\nmerely extend or make use of the Package, do not, by themselves, cause\nthe Package to be a Modified Version.  In addition, such works are not\nconsidered parts of the Package itself, and are not subject to the\nterms of this license.\n\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or\nModified Versions is governed by this Artistic License. By using,\nmodifying or distributing the Package, you accept this license. Do not\nuse, modify, or distribute the Package, if you do not accept this\nlicense.\n\n(11)  If your Modified Version has been derived from a Modified\nVersion made by someone other than you, you are nevertheless required\nto ensure that your Modified Version complies with the requirements of\nthis license.\n\n(12)  This license does not grant you the right to use any trademark,\nservice mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide,\nfree-of-charge patent license to make, have made, use, offer to sell,\nsell, import and otherwise transfer the Package with respect to any\npatent claims licensable by the Copyright Holder that are necessarily\ninfringed by the Package. If you institute patent litigation\n(including a cross-claim or counterclaim) against any party alleging\nthat the Package constitutes direct or contributory patent\ninfringement, then this Artistic License to you shall terminate on the\ndate that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\nIS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\nNON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\nLAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\nBE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","_textUrls":["https://www.perlfoundation.org/artistic_license_2_0","https://www.perlfoundation.org/attachment/legal/artistic-2_0.txt"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"oslc:Artistic-2","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"},{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["OSLC","25b4ae1ce4a75f6b07ed604fd2dc8210"],"impliedStmts":[{"contents":{"contents":{"contents":["OSLC","This license has specific use cases and conditions that are difficult to summarize; please see sections 4-9 and relevant definitions for more details."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"}],"raw":{"_id":"oslc:Artistic-2","_licenseId":["spdx:Artistic-2.0"],"_name":"Artistic License 2.0","_notes":"This license has specific use cases and conditions that are difficult to summarize; please see sections 4-9 and relevant definitions for more details.","_terms":[{"_termComplianceNotes":"Copyright notices and other notices","_termDescription":"Retain all notices","_termSeeAlso":null,"_termType":"condition","_termUseCases":["UB","US"]},{"_termComplianceNotes":"Document how the modified version differs from the standard version","_termDescription":"Notice of modifications","_termSeeAlso":null,"_termType":"condition","_termUseCases":["MB","MS"]},{"_termComplianceNotes":"Do at least one of the following: make modified version available to copyright holder under same license; OR ensure modified version does not prevent user from installing or running standard version and use different name; OR allow any recipients of modified version to make source available to others under same license or a similarly free/open license (see section 4 for more details)","_termDescription":"Provide access to modified version","_termSeeAlso":null,"_termType":"condition","_termUseCases":["MB","MS"]},{"_termComplianceNotes":"Provide complete instructions on how to get source for standard version; instructions must be kept current for your distribution","_termDescription":"Access to source","_termSeeAlso":null,"_termType":"condition","_termUseCases":["UB"]},{"_termComplianceNotes":null,"_termDescription":"You may distribute this package as part of a larger (commercial) distribution, but cannot charge a licensing fee for the standalone package. You may charge distributor fees or licensing fees for other components in the distribution.","_termSeeAlso":null,"_termType":"condition","_termUseCases":["UB","MB","US","MS"]},{"_termComplianceNotes":null,"_termDescription":"Any patent claims accusing the work by a licensee results in termination of all licenses to the licensee","_termSeeAlso":null,"_termType":"termination","_termUseCases":null},{"_termComplianceNotes":null,"_termDescription":"Modified or standard versions linked with other works; embedding the package in a larger work of your own; or stand-alone binary or bytecode versions of applications that include the package may be distributed without restriction provided the result does not expose a direct interface to the package. See sections 8 for more details.","_termSeeAlso":null,"_termType":"other","_termUseCases":null},{"_termComplianceNotes":null,"_termDescription":"Works that merely extend or make use of the package do not cause the package to be a modified version, are not considered parts of the package itself, and are not subject to the terms of this license. See section 9 for more details.","_termSeeAlso":null,"_termType":"other","_termUseCases":null}]},"type":"OSLC"},{"applicableLNs":{"contents":[{"contents":"fossology:Artistic-2.0","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","e7717e89de7a2058af5944348d4e360d"],"impliedStmts":[{"contents":{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","This license was released: 2006"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The Artistic License 2.0\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package. If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement.\n\nDefinitions\n\n   \n\n   \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n   \n\n   \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n   \n\n   \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n   \n\n   \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n   \n\n   \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n   \n\n   \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party. It does not mean licensing fees.\n\n   \n\n   \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n   \n\n   \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder.\n\n   \n\n   \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n   \n\n   \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n   \n\n   \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n   (1) You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n   (2) You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers. At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n   (3) You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder. The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source\n\n   (4) You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n      (a) make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n\n      (b) ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n\n      (c) allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n         (i) the Original License or\n\n         (ii) a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n   (5) You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version. Such instructions must be valid at the time of your distribution. If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n   (6) You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package\n\n   (7) You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package. Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n   (8) You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version\n\n   (9) Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version. In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n   (10) Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n   (11) If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n   (12) This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n   (13) This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n   (14) Disclaimer of Warranty:\n\n   THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Artistic License 2.0","_rf_notes":"This license was released: 2006","_rf_risk":null,"_rf_shortname":"fossology:Artistic-2.0","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The Artistic License 2.0\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package. If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement.\n\nDefinitions\n\n   \n\n   \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n   \n\n   \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n   \n\n   \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n   \n\n   \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n   \n\n   \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n   \n\n   \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party. It does not mean licensing fees.\n\n   \n\n   \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n   \n\n   \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder.\n\n   \n\n   \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n   \n\n   \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n   \n\n   \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n   (1) You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n   (2) You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers. At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n   (3) You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder. The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source\n\n   (4) You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n      (a) make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n\n      (b) ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n\n      (c) allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n         (i) the Original License or\n\n         (ii) a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n   (5) You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version. Such instructions must be valid at the time of your distribution. If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n   (6) You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package\n\n   (7) You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package. Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n   (8) You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version\n\n   (9) Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version. In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n   (10) Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n   (11) If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n   (12) This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n   (13) This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n   (14) Disclaimer of Warranty:\n\n   THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","_rf_text_updatable":false,"_rf_url":"http://www.perlfoundation.org/artistic_license_2_0"},"type":"Fossology"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Artistic-2.0","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"artistic-license-2.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["OKFN","2949fd8d636e6dd60a46194196940ca4"],"impliedStmts":[{"contents":[null,"https://opensource.org/licenses/Artistic-2.0"],"tag":"LicenseUrl"},{"contents":{"contents":{"contents":["OKFN status","active",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["Open Definition","not reviewed",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_domain_content":false,"_domain_data":false,"_domain_software":true,"_family":null,"_id":"Artistic-2.0","_legacy_ids":["artistic-license-2.0"],"_maintainer":"Perl Foundation","_od_conformance":"not reviewed","_osd_conformance":"approved","_status":"active","_title":"Artistic License 2.0","_url":"https://opensource.org/licenses/Artistic-2.0"},"type":"OKFN"},{"applicableLNs":{"contents":"SPDX:Artistic-2.0","tag":"LN"},"id":["OrtLicenseCategorization","eb7cb455aac9a61badb333336512f693"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:Artistic-2.0"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:Artistic-2.0","tag":"LN"},"id":["OrtLicenseCategorization","2af2521633ea13c52824ff9e183b70dc"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-module-level",{"contents":"Open source license that requires you to license modifications made into the same software module with the same license as the original open source software module. This also applies, if you add code from this module to your own module. Examples: EPL-1.1, CPL-1.0.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:modification-related-obligations",{"contents":"This property indicates that the license contains obligations that are triggered by modifying the licensed content. The scope of obligations could vary, but typically it is about somehow making sure that the recipients of the modified content don't attribute the modifications to the wrong author and/or that the unmodified content is available to the recipients. The obligations go beoynd of mere marking of the modifications. Artistic-type licenses have this property, but also some others.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:distribute-source-code",{"contents":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:patent-clause",{"contents":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that requires you to license modifications made into the same software module with the same license as the original open source software module. This also applies, if you add code from this module to your own module. Examples: EPL-1.1, CPL-1.0.","name":"copyleft-module-level"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"},{"description":"This property indicates that the license contains obligations that are triggered by modifying the licensed content. The scope of obligations could vary, but typically it is about somehow making sure that the recipients of the modified content don't attribute the modifications to the wrong author and/or that the unmodified content is available to the recipients. The obligations go beoynd of mere marking of the modifications. Artistic-type licenses have this property, but also some others.","name":"property:modification-related-obligations"},{"description":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","name":"property:distribute-source-code"},{"description":"This property indicates that the license has patent licensing related terms. All patent related provisions in a license, with the exception of a basic patent license, trigger this clause. For example Apache-2.0 license includes a license cancellation clause due to patent disputes.","name":"property:patent-clause"}],"_olcLicensename":"SPDX:Artistic-2.0"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:Artistic-2.0","tag":"LN"},[{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic-2.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","6364599dd5175b2de28430f4f8cea9a1"],"impliedStmts":[],"raw":{"_clcAlias":["Artistic 2.0","Artistic-2.0"],"_clcName":"cavil:Artistic-2.0"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Artistic License 2.0","tag":"LN"},[{"contents":"spdx:Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Artistic License","tag":"LN"},{"contents":"Artistic, Version 2.0","tag":"LN"},{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic License, Version 2.0","tag":"LN"},{"contents":"Artistic License 2.0","tag":"LN"},{"contents":"Artistic License (2.0)","tag":"LN"},{"contents":"Artistic-2","tag":"LN"},{"contents":"scancode:artistic-2.0","tag":"LN"},{"contents":"osi:Artistic-2.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","0502d8cfa0a5c3f7f806e30129559125"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prfung seitens Open CoDE sowohl der Open Source Definition (gem Definition der Open Source Initiative [extern]) entspricht und darber hinaus keine fr die ffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Auer in Ausnahmefllen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["Artistic, Version 2.0","Artistic 2.0","Artistic License, Version 2.0","Artistic License 2.0","Artistic License (2.0)","Artistic-2"],"_canonicalName":"metaeffekt:Artistic License 2.0","_category":"Artistic License","_openCoDEStatus":"approved","_otherIds":["scancode:artistic-2.0","osi:Artistic-2.0"],"_shortName":null,"_spdxIdentifier":"spdx:Artistic-2.0"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":"warpr:Artistic-2","tag":"LN"},"id":["WarprLicense","3787cecf0795951608df08c57e7e10dc"],"impliedStmts":[],"raw":{"_graph":"Graph, formulae: \narcs: \n    (<https://licensedb.org/id/Artistic-2>,cc:legalcode,<http://www.perlfoundation.org/artistic_license_2_0>)\n    (<https://licensedb.org/id/Artistic-2>,dc:creator,<http://perlfoundation.org/>)\n    (<https://licensedb.org/id/Artistic-2>,dc:hasVersion,\"2.0\")\n    (<https://licensedb.org/id/Artistic-2>,dc:replaces,<https://licensedb.org/id/Artistic>)\n    (<https://licensedb.org/id/Artistic-2>,dc:title,\"Artistic License 2.0\")\n    (<https://licensedb.org/id/Artistic-2>,schema:sameAs,<http://www.perlfoundation.org/artistic_license_2_0>)\n    (<https://licensedb.org/id/Artistic-2>,spdx:licenseId,\"Artistic-2.0\")\n    (<https://licensedb.org/id/Artistic-2>,rdf:type,cc:License)\n    (<https://licensedb.org/id/Artistic-2>,owl:sameAs,<magnet:?xt=urn:btih:54fd2283f9dbdf29466d2df1a98bf8f65cafe314&dn=artistic-2.0.txt>)\n    (<https://licensedb.org/id/Artistic-2>,li:id,\"Artistic-2\")\n    (<https://licensedb.org/id/Artistic-2>,li:libre,<http://debian.org/>)\n    (<https://licensedb.org/id/Artistic-2>,li:libre,<http://fsf.org/>)\n    (<https://licensedb.org/id/Artistic-2>,li:libre,<http://opensource.org/>)\n    (<https://licensedb.org/id/Artistic-2>,li:name,\"Artistic 2.0\")\n    (<https://licensedb.org/id/Artistic-2>,li:notice,_:notice1)\n    (<https://licensedb.org/id/Artistic-2>,li:plaintext,<http://www.perlfoundation.org/attachment/legal/artistic-2_0.txt>)\n    (_:notice1,li:canonical,true)\n    (_:notice1,li:orlater,false)\n    (_:notice1,li:short,true)\n    (_:notice1,li:text,\"{{title}} is Copyright {{years}}, {{rightshoolder}}.\\n\\n{{title}} is free software; you\\ncan redistribute it and/or modify it under the terms of the\\nArtistic License 2.0. For details, see the full text of the\\nlicense in the file LICENSE.\\n\")","_id":"warpr:Artistic-2"},"type":"WarprLicense"},{"applicableLNs":{"contents":[{"contents":"foss-license:Artistic License 2.0","tag":"LN"},[{"contents":"scancode:artistic-2.0","tag":"LN"},{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic License (v. 2.0)","tag":"LN"},{"contents":"Artistic License 2.0","tag":"LN"},{"contents":"artistic-2.0","tag":"LN"},{"contents":"artistic-license-2.0","tag":"LN"},{"contents":"Artistic License, Version 2.0","tag":"LN"},{"contents":"The Artistic License 2.0","tag":"LN"},{"contents":"scancode://artistic-2.0","tag":"LN"},{"contents":"Artistic, Version 2.0","tag":"LN"},{"contents":"Artistic License (2.0)","tag":"LN"},{"contents":"Artistic-2","tag":"LN"},{"contents":"scancode:artistic-2.0","tag":"LN"},{"contents":"osi:Artistic-2.0","tag":"LN"},{"contents":"osi:artistic-license-2.0","tag":"LN"},{"contents":"AFL-2","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["FossLicense","6e58c80c46054106ee2085b8a0f8cfa5"],"impliedStmts":[],"raw":{"aliases":["Artistic 2.0","Artistic License (v. 2.0)","Artistic License 2.0","artistic-2.0","artistic-license-2.0","Artistic License, Version 2.0","The Artistic License 2.0","scancode://artistic-2.0","Artistic, Version 2.0","Artistic License (2.0)","Artistic-2","scancode:artistic-2.0","osi:Artistic-2.0","osi:artistic-license-2.0","AFL-2"],"meta":{"comment":"","disclaimer":"https://github.com/hesa/license-db/tree/main/var/disclamer.md"},"name":"Artistic License 2.0","scancode_key":"artistic-2.0","spdxid":"Artistic-2.0","text":"               The Artistic License 2.0\n\n        Copyright (c) 2000-2006, The Perl Foundation.\n\n     Everyone is permitted to copy and distribute verbatim copies\n      of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software\nPackage may be copied, modified, distributed, and/or redistributed.\nThe intent is that the Copyright Holder maintains some artistic\ncontrol over the development of that Package while still keeping the\nPackage available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this\nlicense directly with the Copyright Holder of a given Package.  If the\nterms of this license do not permit the full use that you propose to\nmake of the Package, you should contact the Copyright Holder and seek\na different licensing arrangement. \n\nDefinitions\n\n    \"Copyright Holder\" means the individual(s) or organization(s)\n    named in the copyright notice for the entire Package.\n\n    \"Contributor\" means any party that has contributed code or other\n    material to the Package, in accordance with the Copyright Holder's\n    procedures.\n\n    \"You\" and \"your\" means any person who would like to copy,\n    distribute, or modify the Package.\n\n    \"Package\" means the collection of files distributed by the\n    Copyright Holder, and derivatives of that collection and/or of\n    those files. A given Package may consist of either the Standard\n    Version, or a Modified Version.\n\n    \"Distribute\" means providing a copy of the Package or making it\n    accessible to anyone else, or in the case of a company or\n    organization, to others outside of your company or organization.\n\n    \"Distributor Fee\" means any fee that you charge for Distributing\n    this Package or providing support for this Package to another\n    party.  It does not mean licensing fees.\n\n    \"Standard Version\" refers to the Package if it has not been\n    modified, or has been modified only in ways explicitly requested\n    by the Copyright Holder.\n\n    \"Modified Version\" means the Package, if it has been changed, and\n    such changes were not explicitly requested by the Copyright\n    Holder. \n\n    \"Original License\" means this Artistic License as Distributed with\n    the Standard Version of the Package, in its current version or as\n    it may be modified by The Perl Foundation in the future.\n\n    \"Source\" form means the source code, documentation source, and\n    configuration files for the Package.\n\n    \"Compiled\" form means the compiled bytecode, object code, binary,\n    or any other form resulting from mechanical transformation or\n    translation of the Source form.\n\n\nPermission for Use and Modification Without Distribution\n\n(1)  You are permitted to use the Standard Version and create and use\nModified Versions for any purpose without restriction, provided that\nyou do not Distribute the Modified Version.\n\n\nPermissions for Redistribution of the Standard Version\n\n(2)  You may Distribute verbatim copies of the Source form of the\nStandard Version of this Package in any medium without restriction,\neither gratis or for a Distributor Fee, provided that you duplicate\nall of the original copyright notices and associated disclaimers.  At\nyour discretion, such verbatim copies may or may not include a\nCompiled form of the Package.\n\n(3)  You may apply any bug fixes, portability changes, and other\nmodifications made available from the Copyright Holder.  The resulting\nPackage will still be considered the Standard Version, and as such\nwill be subject to the Original License.\n\n\nDistribution of Modified Versions of the Package as Source \n\n(4)  You may Distribute your Modified Version as Source (either gratis\nor for a Distributor Fee, and with or without a Compiled form of the\nModified Version) provided that you clearly document how it differs\nfrom the Standard Version, including, but not limited to, documenting\nany non-standard features, executables, or modules, and provided that\nyou do at least ONE of the following:\n\n    (a)  make the Modified Version available to the Copyright Holder\n    of the Standard Version, under the Original License, so that the\n    Copyright Holder may include your modifications in the Standard\n    Version.\n\n    (b)  ensure that installation of your Modified Version does not\n    prevent the user installing or running the Standard Version. In\n    addition, the Modified Version must bear a name that is different\n    from the name of the Standard Version.\n\n    (c)  allow anyone who receives a copy of the Modified Version to\n    make the Source form of the Modified Version available to others\n    under\n        \n    (i)  the Original License or\n\n    (ii)  a license that permits the licensee to freely copy,\n    modify and redistribute the Modified Version using the same\n    licensing terms that apply to the copy that the licensee\n    received, and requires that the Source form of the Modified\n    Version, and of any works derived from it, be made freely\n    available in that license fees are prohibited but Distributor\n    Fees are allowed.\n\n\nDistribution of Compiled Forms of the Standard Version \nor Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without\nthe Source, provided that you include complete instructions on how to\nget the Source of the Standard Version.  Such instructions must be\nvalid at the time of your distribution.  If these instructions, at any\ntime while you are carrying out such distribution, become invalid, you\nmust provide new instructions on demand or cease further distribution.\nIf you provide valid instructions or cease distribution within thirty\ndays after you become aware that the instructions are invalid, then\nyou do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without\nthe Source, provided that you comply with Section 4 with respect to\nthe Source of the Modified Version.\n\n\nAggregating or Linking the Package \n\n(7)  You may aggregate the Package (either the Standard Version or\nModified Version) with other packages and Distribute the resulting\naggregation provided that you do not charge a licensing fee for the\nPackage.  Distributor Fees are permitted, and licensing fees for other\ncomponents in the aggregation are permitted. The terms of this license\napply to the use and Distribution of the Standard or Modified Versions\nas included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with\nother works, to embed the Package in a larger work of your own, or to\nbuild stand-alone binary or bytecode versions of applications that\ninclude the Package, and Distribute the result without restriction,\nprovided the result does not expose a direct interface to the Package.\n\n\nItems That are Not Considered Part of a Modified Version \n\n(9) Works (including, but not limited to, modules and scripts) that\nmerely extend or make use of the Package, do not, by themselves, cause\nthe Package to be a Modified Version.  In addition, such works are not\nconsidered parts of the Package itself, and are not subject to the\nterms of this license.\n\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or\nModified Versions is governed by this Artistic License. By using,\nmodifying or distributing the Package, you accept this license. Do not\nuse, modify, or distribute the Package, if you do not accept this\nlicense.\n\n(11)  If your Modified Version has been derived from a Modified\nVersion made by someone other than you, you are nevertheless required\nto ensure that your Modified Version complies with the requirements of\nthis license.\n\n(12)  This license does not grant you the right to use any trademark,\nservice mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide,\nfree-of-charge patent license to make, have made, use, offer to sell,\nsell, import and otherwise transfer the Package with respect to any\npatent claims licensable by the Copyright Holder that are necessarily\ninfringed by the Package. If you institute patent litigation\n(including a cross-claim or counterclaim) against any party alleging\nthat the Package constitutes direct or contributory patent\ninfringement, then this Artistic License to you shall terminate on the\ndate that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\nIS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\nNON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\nLAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\nBE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE."},"type":"FossLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fosslight:Artistic License 2.0","tag":"LN"},[{"contents":"Artistic-2.0","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["FOSSLight","75eec378e019254b3d72ae83dafa7b21"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}],"raw":{"_FOSSLightFact_License":{"_fossLight_ATTRIBUTION":"","_fossLight_CREATED_DATE":[],"_fossLight_CREATOR":[],"_fossLight_DESCRIPTION":"?? ?? ??? ??? ??? ? ?? ?? ??? ????, ??? ?? ??? ????? ??? Source Code ?? ?? ??? ???? ?? ??? ?????.\nTo distribute the standard version, notifying where to get the standard version is required. And to distribute the modified version, either disclosing source code including the modification or enclose standard version with document for the modification is required.","_fossLight_LICENSE_TEXT":"The Artistic License 2.0\n\nCopyright (c) 2000-2006, The Perl Foundation.\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThis license establishes the terms under which a given free software Package may be copied, modified, distributed, and/or redistributed. The intent is that the Copyright Holder maintains some artistic control over the development of that Package while still keeping the Package available as open source and free software.\n\nYou are always permitted to make arrangements wholly outside of this license directly with the Copyright Holder of a given Package.  If the terms of this license do not permit the full use that you propose to make of the Package, you should contact the Copyright Holder and seek a different licensing arrangement. \n\nDefinitions\n\n     \"Copyright Holder\" means the individual(s) or organization(s) named in the copyright notice for the entire Package.\n\n     \"Contributor\" means any party that has contributed code or other material to the Package, in accordance with the Copyright Holder's procedures.\n\n     \"You\" and \"your\" means any person who would like to copy, distribute, or modify the Package.\n\n     \"Package\" means the collection of files distributed by the Copyright Holder, and derivatives of that collection and/or of those files. A given Package may consist of either the Standard Version, or a Modified Version.\n\n     \"Distribute\" means providing a copy of the Package or making it accessible to anyone else, or in the case of a company or organization, to others outside of your company or organization.\n\n     \"Distributor Fee\" means any fee that you charge for Distributing this Package or providing support for this Package to another party.  It does not mean licensing fees.\n\n     \"Standard Version\" refers to the Package if it has not been modified, or has been modified only in ways explicitly requested by the Copyright Holder.\n\n     \"Modified Version\" means the Package, if it has been changed, and such changes were not explicitly requested by the Copyright Holder. \n\n     \"Original License\" means this Artistic License as Distributed with the Standard Version of the Package, in its current version or as it may be modified by The Perl Foundation in the future.\n\n     \"Source\" form means the source code, documentation source, and configuration files for the Package.\n\n     \"Compiled\" form means the compiled bytecode, object code, binary, or any other form resulting from mechanical transformation or translation of the Source form.\n\nPermission for Use and Modification Without Distribution\n\n(1) You are permitted to use the Standard Version and create and use Modified Versions for any purpose without restriction, provided that you do not Distribute the Modified Version.\n\nPermissions for Redistribution of the Standard Version\n\n(2) You may Distribute verbatim copies of the Source form of the Standard Version of this Package in any medium without restriction, either gratis or for a Distributor Fee, provided that you duplicate all of the original copyright notices and associated disclaimers.  At your discretion, such verbatim copies may or may not include a Compiled form of the Package.\n\n(3) You may apply any bug fixes, portability changes, and other modifications made available from the Copyright Holder.  The resulting Package will still be considered the Standard Version, and as such will be subject to the Original License.\n\nDistribution of Modified Versions of the Package as Source \n\n(4) You may Distribute your Modified Version as Source (either gratis or for a Distributor Fee, and with or without a Compiled form of the Modified Version) provided that you clearly document how it differs from the Standard Version, including, but not limited to, documenting any non-standard features, executables, or modules, and provided that you do at least ONE of the following:\n\n     (a) make the Modified Version available to the Copyright Holder of the Standard Version, under the Original License, so that the Copyright Holder may include your modifications in the Standard Version.\n     (b) ensure that installation of your Modified Version does not prevent the user installing or running the Standard Version. In addition, the Modified Version must bear a name that is different from the name of the Standard Version.\n     (c) allow anyone who receives a copy of the Modified Version to make the Source form of the Modified Version available to others under\n\n          (i) the Original License or\n          (ii) a license that permits the licensee to freely copy, modify and redistribute the Modified Version using the same licensing terms that apply to the copy that the licensee received, and requires that the Source form of the Modified Version, and of any works derived from it, be made freely available in that license fees are prohibited but Distributor Fees are allowed.\n\nDistribution of Compiled Forms of the Standard Version or Modified Versions without the Source\n\n(5)  You may Distribute Compiled forms of the Standard Version without the Source, provided that you include complete instructions on how to get the Source of the Standard Version.  Such instructions must be valid at the time of your distribution.  If these instructions, at any time while you are carrying out such distribution, become invalid, you must provide new instructions on demand or cease further distribution. If you provide valid instructions or cease distribution within thirty days after you become aware that the instructions are invalid, then you do not forfeit any of your rights under this license.\n\n(6)  You may Distribute a Modified Version in Compiled form without the Source, provided that you comply with Section 4 with respect to the Source of the Modified Version.\n\nAggregating or Linking the Package \n\n(7)  You may aggregate the Package (either the Standard Version or Modified Version) with other packages and Distribute the resulting aggregation provided that you do not charge a licensing fee for the Package.  Distributor Fees are permitted, and licensing fees for other components in the aggregation are permitted. The terms of this license apply to the use and Distribution of the Standard or Modified Versions as included in the aggregation.\n\n(8) You are permitted to link Modified and Standard Versions with other works, to embed the Package in a larger work of your own, or to build stand-alone binary or bytecode versions of applications that include the Package, and Distribute the result without restriction, provided the result does not expose a direct interface to the Package.\n\nItems That are Not Considered Part of a Modified Version \n\n(9) Works (including, but not limited to, modules and scripts) that merely extend or make use of the Package, do not, by themselves, cause the Package to be a Modified Version.  In addition, such works are not considered parts of the Package itself, and are not subject to the terms of this license.\n\nGeneral Provisions\n\n(10)  Any use, modification, and distribution of the Standard or Modified Versions is governed by this Artistic License. By using, modifying or distributing the Package, you accept this license. Do not use, modify, or distribute the Package, if you do not accept this license.\n\n(11)  If your Modified Version has been derived from a Modified Version made by someone other than you, you are nevertheless required to ensure that your Modified Version complies with the requirements of this license.\n\n(12)  This license does not grant you the right to use any trademark, service mark, tradename, or logo of the Copyright Holder.\n\n(13)  This license includes the non-exclusive, worldwide, free-of-charge patent license to make, have made, use, offer to sell, sell, import and otherwise transfer the Package with respect to any patent claims licensable by the Copyright Holder that are necessarily infringed by the Package. If you institute patent litigation (including a cross-claim or counterclaim) against any party alleging that the Package constitutes direct or contributory patent infringement, then this Artistic License to you shall terminate on the date that such litigation is filed.\n\n(14)  Disclaimer of Warranty:\nTHE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS IS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","_fossLight_MODIFIED_DATE":[],"_fossLight_MODIFIER":[],"_fossLight_OBLIGATION_DISCLOSING_SRC":false,"_fossLight_OBLIGATION_NEEDS_CHECK":false,"_fossLight_OBLIGATION_NOTIFICATION":true,"_fossLight_REQ_LICENSE_TEXT":false,"_fossLight_RESTRICTION":"","_fossLight_SHORT_IDENTIFIER":"Artistic-2.0","_fossLight_USE":true,"_fossLight_WEBPAGE":"https://spdx.org/licenses/Artistic-2.0.html","_fossLight_id":17,"_fossLight_name":"fosslight:Artistic License 2.0","_fossLight_type":"FOSSLight_License_Type_Permissive"},"_FOSSLightFact_Nicks":[]},"type":"FOSSLight"},{"applicableLNs":{"contents":[{"contents":"hitachi:The Artistic License 2.0","tag":"LN"},[]],"tag":"AlternativeLNs"},"id":["HitachiOpenLicense","9ce14359723e4bdcf84a429f536542e9"],"impliedStmts":[{"contents":"    The Artistic License 2.0\n\n    Copyright (c) 2000-2006, The Perl Foundation.\n\n    Everyone is permitted to copy and distribute verbatim copies\n    of this license document, but changing it is not allowed.\n\n    Preamble\n\n    This license establishes the terms under which a given free software\n    Package may be copied, modified, distributed, and/or redistributed.\n    The intent is that the Copyright Holder maintains some artistic\n    control over the development of that Package while still keeping the\n    Package available as open source and free software.\n\n    You are always permitted to make arrangements wholly outside of this\n    license directly with the Copyright Holder of a given Package.  If the\n    terms of this license do not permit the full use that you propose to\n    make of the Package, you should contact the Copyright Holder and seek\n    a different licensing arrangement.\n\n    Definitions\n\n        \"Copyright Holder\" means the individual(s) or organization(s)\n        named in the copyright notice for the entire Package.\n\n        \"Contributor\" means any party that has contributed code or other\n        material to the Package, in accordance with the Copyright Holder's\n        procedures.\n\n        \"You\" and \"your\" means any person who would like to copy,\n        distribute, or modify the Package.\n\n        \"Package\" means the collection of files distributed by the\n        Copyright Holder, and derivatives of that collection and/or of\n        those files. A given Package may consist of either the Standard\n        Version, or a Modified Version.\n\n        \"Distribute\" means providing a copy of the Package or making it\n        accessible to anyone else, or in the case of a company or\n        organization, to others outside of your company or organization.\n\n        \"Distributor Fee\" means any fee that you charge for Distributing\n        this Package or providing support for this Package to another\n        party.  It does not mean licensing fees.\n\n        \"Standard Version\" refers to the Package if it has not been\n        modified, or has been modified only in ways explicitly requested\n        by the Copyright Holder.\n\n        \"Modified Version\" means the Package, if it has been changed, and\n        such changes were not explicitly requested by the Copyright\n        Holder.\n\n        \"Original License\" means this Artistic License as Distributed with\n        the Standard Version of the Package, in its current version or as\n        it may be modified by The Perl Foundation in the future.\n\n        \"Source\" form means the source code, documentation source, and\n        configuration files for the Package.\n\n        \"Compiled\" form means the compiled bytecode, object code, binary,\n        or any other form resulting from mechanical transformation or\n        translation of the Source form.\n\n\n    Permission for Use and Modification Without Distribution\n\n    (1)  You are permitted to use the Standard Version and create and use\n    Modified Versions for any purpose without restriction, provided that\n    you do not Distribute the Modified Version.\n\n\n    Permissions for Redistribution of the Standard Version\n\n    (2)  You may Distribute verbatim copies of the Source form of the\n    Standard Version of this Package in any medium without restriction,\n    either gratis or for a Distributor Fee, provided that you duplicate\n    all of the original copyright notices and associated disclaimers.  At\n    your discretion, such verbatim copies may or may not include a\n    Compiled form of the Package.\n\n    (3)  You may apply any bug fixes, portability changes, and other\n    modifications made available from the Copyright Holder.  The resulting\n    Package will still be considered the Standard Version, and as such\n    will be subject to the Original License.\n\n\n    Distribution of Modified Versions of the Package as Source\n\n    (4)  You may Distribute your Modified Version as Source (either gratis\n    or for a Distributor Fee, and with or without a Compiled form of the\n    Modified Version) provided that you clearly document how it differs\n    from the Standard Version, including, but not limited to, documenting\n    any non-standard features, executables, or modules, and provided that\n    you do at least ONE of the following:\n\n        (a)  make the Modified Version available to the Copyright Holder\n        of the Standard Version, under the Original License, so that the\n        Copyright Holder may include your modifications in the Standard\n        Version.\n\n        (b)  ensure that installation of your Modified Version does not\n        prevent the user installing or running the Standard Version. In\n        addition, the Modified Version must bear a name that is different\n        from the name of the Standard Version.\n\n        (c)  allow anyone who receives a copy of the Modified Version to\n        make the Source form of the Modified Version available to others\n        under\n\n            (i)  the Original License or\n\n            (ii)  a license that permits the licensee to freely copy,\n            modify and redistribute the Modified Version using the same\n            licensing terms that apply to the copy that the licensee\n            received, and requires that the Source form of the Modified\n            Version, and of any works derived from it, be made freely\n            available in that license fees are prohibited but Distributor\n            Fees are allowed.\n\n\n    Distribution of Compiled Forms of the Standard Version\n    or Modified Versions without the Source\n\n    (5)  You may Distribute Compiled forms of the Standard Version without\n    the Source, provided that you include complete instructions on how to\n    get the Source of the Standard Version.  Such instructions must be\n    valid at the time of your distribution.  If these instructions, at any\n    time while you are carrying out such distribution, become invalid, you\n    must provide new instructions on demand or cease further distribution.\n    If you provide valid instructions or cease distribution within thirty\n    days after you become aware that the instructions are invalid, then\n    you do not forfeit any of your rights under this license.\n\n    (6)  You may Distribute a Modified Version in Compiled form without\n    the Source, provided that you comply with Section 4 with respect to\n    the Source of the Modified Version.\n\n\n    Aggregating or Linking the Package\n\n    (7)  You may aggregate the Package (either the Standard Version or\n    Modified Version) with other packages and Distribute the resulting\n    aggregation provided that you do not charge a licensing fee for the\n    Package.  Distributor Fees are permitted, and licensing fees for other\n    components in the aggregation are permitted. The terms of this license\n    apply to the use and Distribution of the Standard or Modified Versions\n    as included in the aggregation.\n\n    (8) You are permitted to link Modified and Standard Versions with\n    other works, to embed the Package in a larger work of your own, or to\n    build stand-alone binary or bytecode versions of applications that\n    include the Package, and Distribute the result without restriction,\n    provided the result does not expose a direct interface to the Package.\n\n\n    Items That are Not Considered Part of a Modified Version\n\n    (9) Works (including, but not limited to, modules and scripts) that\n    merely extend or make use of the Package, do not, by themselves, cause\n    the Package to be a Modified Version.  In addition, such works are not\n    considered parts of the Package itself, and are not subject to the\n    terms of this license.\n\n\n    General Provisions\n\n    (10)  Any use, modification, and distribution of the Standard or\n    Modified Versions is governed by this Artistic License. By using,\n    modifying or distributing the Package, you accept this license. Do not\n    use, modify, or distribute the Package, if you do not accept this\n    license.\n\n    (11)  If your Modified Version has been derived from a Modified\n    Version made by someone other than you, you are nevertheless required\n    to ensure that your Modified Version complies with the requirements of\n    this license.\n\n    (12)  This license does not grant you the right to use any trademark,\n    service mark, tradename, or logo of the Copyright Holder.\n\n    (13)  This license includes the non-exclusive, worldwide,\n    free-of-charge patent license to make, have made, use, offer to sell,\n    sell, import and otherwise transfer the Package with respect to any\n    patent claims licensable by the Copyright Holder that are necessarily\n    infringed by the Package. If you institute patent litigation\n    (including a cross-claim or counterclaim) against any party alleging\n    that the Package constitutes direct or contributory patent\n    infringement, then this Artistic License to you shall terminate on the\n    date that such litigation is filed.\n\n    (14)  Disclaimer of Warranty:\n    THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\n    IS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\n    WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\n    NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\n    LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\n    BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\n    DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\n    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","tag":"LicenseText"},{"contents":{"contents":["HitachiOpenLicense","Source code refers to the source code, documentation and configuration files. This license does not grant you the right to use the copyright owner's registered trademarks, service marks, trademark names, or logos."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"content":"    The Artistic License 2.0\n\n    Copyright (c) 2000-2006, The Perl Foundation.\n\n    Everyone is permitted to copy and distribute verbatim copies\n    of this license document, but changing it is not allowed.\n\n    Preamble\n\n    This license establishes the terms under which a given free software\n    Package may be copied, modified, distributed, and/or redistributed.\n    The intent is that the Copyright Holder maintains some artistic\n    control over the development of that Package while still keeping the\n    Package available as open source and free software.\n\n    You are always permitted to make arrangements wholly outside of this\n    license directly with the Copyright Holder of a given Package.  If the\n    terms of this license do not permit the full use that you propose to\n    make of the Package, you should contact the Copyright Holder and seek\n    a different licensing arrangement.\n\n    Definitions\n\n        \"Copyright Holder\" means the individual(s) or organization(s)\n        named in the copyright notice for the entire Package.\n\n        \"Contributor\" means any party that has contributed code or other\n        material to the Package, in accordance with the Copyright Holder's\n        procedures.\n\n        \"You\" and \"your\" means any person who would like to copy,\n        distribute, or modify the Package.\n\n        \"Package\" means the collection of files distributed by the\n        Copyright Holder, and derivatives of that collection and/or of\n        those files. A given Package may consist of either the Standard\n        Version, or a Modified Version.\n\n        \"Distribute\" means providing a copy of the Package or making it\n        accessible to anyone else, or in the case of a company or\n        organization, to others outside of your company or organization.\n\n        \"Distributor Fee\" means any fee that you charge for Distributing\n        this Package or providing support for this Package to another\n        party.  It does not mean licensing fees.\n\n        \"Standard Version\" refers to the Package if it has not been\n        modified, or has been modified only in ways explicitly requested\n        by the Copyright Holder.\n\n        \"Modified Version\" means the Package, if it has been changed, and\n        such changes were not explicitly requested by the Copyright\n        Holder.\n\n        \"Original License\" means this Artistic License as Distributed with\n        the Standard Version of the Package, in its current version or as\n        it may be modified by The Perl Foundation in the future.\n\n        \"Source\" form means the source code, documentation source, and\n        configuration files for the Package.\n\n        \"Compiled\" form means the compiled bytecode, object code, binary,\n        or any other form resulting from mechanical transformation or\n        translation of the Source form.\n\n\n    Permission for Use and Modification Without Distribution\n\n    (1)  You are permitted to use the Standard Version and create and use\n    Modified Versions for any purpose without restriction, provided that\n    you do not Distribute the Modified Version.\n\n\n    Permissions for Redistribution of the Standard Version\n\n    (2)  You may Distribute verbatim copies of the Source form of the\n    Standard Version of this Package in any medium without restriction,\n    either gratis or for a Distributor Fee, provided that you duplicate\n    all of the original copyright notices and associated disclaimers.  At\n    your discretion, such verbatim copies may or may not include a\n    Compiled form of the Package.\n\n    (3)  You may apply any bug fixes, portability changes, and other\n    modifications made available from the Copyright Holder.  The resulting\n    Package will still be considered the Standard Version, and as such\n    will be subject to the Original License.\n\n\n    Distribution of Modified Versions of the Package as Source\n\n    (4)  You may Distribute your Modified Version as Source (either gratis\n    or for a Distributor Fee, and with or without a Compiled form of the\n    Modified Version) provided that you clearly document how it differs\n    from the Standard Version, including, but not limited to, documenting\n    any non-standard features, executables, or modules, and provided that\n    you do at least ONE of the following:\n\n        (a)  make the Modified Version available to the Copyright Holder\n        of the Standard Version, under the Original License, so that the\n        Copyright Holder may include your modifications in the Standard\n        Version.\n\n        (b)  ensure that installation of your Modified Version does not\n        prevent the user installing or running the Standard Version. In\n        addition, the Modified Version must bear a name that is different\n        from the name of the Standard Version.\n\n        (c)  allow anyone who receives a copy of the Modified Version to\n        make the Source form of the Modified Version available to others\n        under\n\n            (i)  the Original License or\n\n            (ii)  a license that permits the licensee to freely copy,\n            modify and redistribute the Modified Version using the same\n            licensing terms that apply to the copy that the licensee\n            received, and requires that the Source form of the Modified\n            Version, and of any works derived from it, be made freely\n            available in that license fees are prohibited but Distributor\n            Fees are allowed.\n\n\n    Distribution of Compiled Forms of the Standard Version\n    or Modified Versions without the Source\n\n    (5)  You may Distribute Compiled forms of the Standard Version without\n    the Source, provided that you include complete instructions on how to\n    get the Source of the Standard Version.  Such instructions must be\n    valid at the time of your distribution.  If these instructions, at any\n    time while you are carrying out such distribution, become invalid, you\n    must provide new instructions on demand or cease further distribution.\n    If you provide valid instructions or cease distribution within thirty\n    days after you become aware that the instructions are invalid, then\n    you do not forfeit any of your rights under this license.\n\n    (6)  You may Distribute a Modified Version in Compiled form without\n    the Source, provided that you comply with Section 4 with respect to\n    the Source of the Modified Version.\n\n\n    Aggregating or Linking the Package\n\n    (7)  You may aggregate the Package (either the Standard Version or\n    Modified Version) with other packages and Distribute the resulting\n    aggregation provided that you do not charge a licensing fee for the\n    Package.  Distributor Fees are permitted, and licensing fees for other\n    components in the aggregation are permitted. The terms of this license\n    apply to the use and Distribution of the Standard or Modified Versions\n    as included in the aggregation.\n\n    (8) You are permitted to link Modified and Standard Versions with\n    other works, to embed the Package in a larger work of your own, or to\n    build stand-alone binary or bytecode versions of applications that\n    include the Package, and Distribute the result without restriction,\n    provided the result does not expose a direct interface to the Package.\n\n\n    Items That are Not Considered Part of a Modified Version\n\n    (9) Works (including, but not limited to, modules and scripts) that\n    merely extend or make use of the Package, do not, by themselves, cause\n    the Package to be a Modified Version.  In addition, such works are not\n    considered parts of the Package itself, and are not subject to the\n    terms of this license.\n\n\n    General Provisions\n\n    (10)  Any use, modification, and distribution of the Standard or\n    Modified Versions is governed by this Artistic License. By using,\n    modifying or distributing the Package, you accept this license. Do not\n    use, modify, or distribute the Package, if you do not accept this\n    license.\n\n    (11)  If your Modified Version has been derived from a Modified\n    Version made by someone other than you, you are nevertheless required\n    to ensure that your Modified Version complies with the requirements of\n    this license.\n\n    (12)  This license does not grant you the right to use any trademark,\n    service mark, tradename, or logo of the Copyright Holder.\n\n    (13)  This license includes the non-exclusive, worldwide,\n    free-of-charge patent license to make, have made, use, offer to sell,\n    sell, import and otherwise transfer the Package with respect to any\n    patent claims licensable by the Copyright Holder that are necessarily\n    infringed by the Package. If you institute patent litigation\n    (including a cross-claim or counterclaim) against any party alleging\n    that the Package constitutes direct or contributory patent\n    infringement, then this Artistic License to you shall terminate on the\n    date that such litigation is filed.\n\n    (14)  Disclaimer of Warranty:\n    THE PACKAGE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS \"AS\n    IS' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES. THE IMPLIED\n    WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\n    NON-INFRINGEMENT ARE DISCLAIMED TO THE EXTENT PERMITTED BY YOUR LOCAL\n    LAW. UNLESS REQUIRED BY LAW, NO COPYRIGHT HOLDER OR CONTRIBUTOR WILL\n    BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\n    DAMAGES ARISING IN ANY WAY OUT OF THE USE OF THE PACKAGE, EVEN IF\n    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","description":"Source code refers to the source code, documentation and configuration files. This license does not grant you the right to use the copyright owner's registered trademarks, service marks, trademark names, or logos.","name":"hitachi:The Artistic License 2.0","notices":[{"contents":{"content":"Unless otherwise ordered by law, neither the copyright holder nor the contributor shall be liable for any direct, indirect, incidental or consequential damages resulting from the use of the software, even if they have been advised of the possibility of such damages."},"tag":"Ol"},{"contents":{"content":"If you file a patent action, including cross-claims or counterclaims, alleging that the Software directly or indirectly infringes a patent, this license will terminate upon formal filing of the patent action."},"tag":"Ol"},{"contents":{"content":"the software is provided by the copyright holders and contributors \"as-is\" and without warranty of any kind, either express or implied, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose. to the extent permitted by local law, there are no implied warranties of commercial usability, applicability for a particular purpose, or non-infringement.","description":"There is no guarantee."},"tag":"Ol"}],"permissions":[{"_str":"Description: Source code refers to the source code, documentation and configuration files. Source code refers to source code, documentation and configuration files.\nActions:\n- Ol Use the obtained source code without modification (Use the fetched code as it is.)\n- Ol Modify the obtained source code.\n- Ol Using Modified Source Code\n- Ol Use the retrieved object code (Use the fetched code as it is.)\n- Ol Use the object code generated from the modified source code\n- Ol Use the retrieved executable (Use the obtained executable as is.)\n- Ol Use the executable generated from the modified source code\n\nConditions:\nOl RESTRICTION: A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license (However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.)\n","actions":[{"contents":{"description":"Use the fetched code as it is.","name":"Use the obtained source code without modification"},"tag":"Ol"},{"contents":{"name":"Modify the obtained source code."},"tag":"Ol"},{"contents":{"name":"Using Modified Source Code"},"tag":"Ol"},{"contents":{"description":"Use the fetched code as it is.","name":"Use the retrieved object code"},"tag":"Ol"},{"contents":{"name":"Use the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"description":"Use the obtained executable as is.","name":"Use the retrieved executable"},"tag":"Ol"},{"contents":{"name":"Use the executable generated from the modified source code"},"tag":"Ol"}],"conditions":{"contents":{"description":"However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.","name":"A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license","type":"RESTRICTION"},"tag":"Ol"},"description":"Source code refers to the source code, documentation and configuration files. Source code refers to source code, documentation and configuration files."},{"_str":"Description: Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution.\nActions:\n- Ol Distribute the obtained source code without modification (Redistribute the code as it was obtained)\n\nConditions:\nAND\n  Ol OBLIGATION: Include a copyright notice, list of terms and conditions, and disclaimer contained in such software\n  Ol RESTRICTION: A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license (However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.)\n\n","actions":[{"contents":{"description":"Redistribute the code as it was obtained","name":"Distribute the obtained source code without modification"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"name":"Include a copyright notice, list of terms and conditions, and disclaimer contained in such software","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"description":"However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.","name":"A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license","type":"RESTRICTION"},"tag":"Ol"}]},"description":"Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution."},{"_str":"Description: Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution.\nActions:\n- Ol Distribution of Modified Source Code\n- Ol Distribute the object code generated from the modified source code\n- Ol Distribute the executable generated from the modified source code\n\nConditions:\nAND\n  Ol OBLIGATION: Include a summary of the changes you have made\n  OR\n    Ol OBLIGATION: Make available to the original software copyright holder the corresponding source code for that software under this license. (The copyright holder of the original software may incorporate any modifications contained in the software into the original software.)\n    AND\n      Ol RESTRICTION: The installation of such software does not interfere with the installation and execution of the original software.\n      Ol REQUISITE: Change the name of the software\n    Ol RESTRICTION: Allow the recipient of such software to make the corresponding source code for such software available to others under one of the following licenses Such license means this license, or the license terms applicable to such software, which requires the licensee to permit the licensee to copy, modify, and redistribute the software or its derivative works under the terms of this license or the license terms applicable to such software, and to make the source code of such software or its derivative works freely available for use at no charge, but without a fee for distribution A license that may impose a\n  Ol RESTRICTION: A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license (However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.)\n\n","actions":[{"contents":{"name":"Distribution of Modified Source Code"},"tag":"Ol"},{"contents":{"name":"Distribute the object code generated from the modified source code"},"tag":"Ol"},{"contents":{"name":"Distribute the executable generated from the modified source code"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"name":"Include a summary of the changes you have made","type":"OBLIGATION"},"tag":"Ol"},{"OR":[{"contents":{"description":"The copyright holder of the original software may incorporate any modifications contained in the software into the original software.","name":"Make available to the original software copyright holder the corresponding source code for that software under this license.","type":"OBLIGATION"},"tag":"Ol"},{"AND":[{"contents":{"name":"The installation of such software does not interfere with the installation and execution of the original software.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Change the name of the software","type":"REQUISITE"},"tag":"Ol"}]},{"contents":{"name":"Allow the recipient of such software to make the corresponding source code for such software available to others under one of the following licenses Such license means this license, or the license terms applicable to such software, which requires the licensee to permit the licensee to copy, modify, and redistribute the software or its derivative works under the terms of this license or the license terms applicable to such software, and to make the source code of such software or its derivative works freely available for use at no charge, but without a fee for distribution A license that may impose a","type":"RESTRICTION"},"tag":"Ol"}]},{"contents":{"description":"However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.","name":"A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license","type":"RESTRICTION"},"tag":"Ol"}]},"description":"Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution."},{"_str":"Description: Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution. If the source code is made available in an obsolete manner, notify the user on demand of the new method of distribution or stop distribution. You do not lose your rights under this license if you do so within 30 days of becoming aware of the invalidation.\nActions:\n- Ol Distribute the obtained object code (Redistribute the code as it was obtained)\n- Ol Distribute the obtained executable (Redistribute the obtained executable as-is)\n\nConditions:\nAND\n  Ol OBLIGATION: Communicate that the corresponding source code for the software is available on media commonly used for software interchange and in a reasonable manner.\n  Ol RESTRICTION: A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license (However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.)\n\n","actions":[{"contents":{"description":"Redistribute the code as it was obtained","name":"Distribute the obtained object code"},"tag":"Ol"},{"contents":{"description":"Redistribute the obtained executable as-is","name":"Distribute the obtained executable"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"name":"Communicate that the corresponding source code for the software is available on media commonly used for software interchange and in a reasonable manner.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"description":"However, it applies only to those claims that are licensable by the contributor that are necessarily infringed by using the contributor's contribution alone or in combination with the software in question.","name":"A worldwide, non-exclusive, royalty-free contributor's patent license is granted pursuant to such license","type":"RESTRICTION"},"tag":"Ol"}]},"description":"Source code refers to the source code, documentation and configuration files. You may charge a fee for distribution. You may charge a fee for distribution. If the source code is made available in an obsolete manner, notify the user on demand of the new method of distribution or stop distribution. You do not lose your rights under this license if you do so within 30 days of becoming aware of the invalidation."},{"_str":"Actions:\n- Ol Linking software with other software\n- Ol Embedding software into its own software\n- Ol Building and distributing application binaries and bytecode, including software\n\nConditions:\nOl RESTRICTION: Not directly exposing the interface of the software in question\n","actions":[{"contents":{"name":"Linking software with other software"},"tag":"Ol"},{"contents":{"name":"Embedding software into its own software"},"tag":"Ol"},{"contents":{"name":"Building and distributing application binaries and bytecode, including software"},"tag":"Ol"}],"conditions":{"contents":{"name":"Not directly exposing the interface of the software in question","type":"RESTRICTION"},"tag":"Ol"}}]},"type":"HitachiOpenLicense"},{"applicableLNs":{"contents":[{"contents":"eclipse:Artistic-2.0","tag":"LN"},[{"contents":"Artistic License 2.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["EclipseLicense","bfb313ef28f522d820f34330bd2e4870"],"impliedStmts":[{"contents":{"contents":{"contents":["EclipseLicense","Approved",{"contents":"This approved license list enumerates the licenses that the Eclipse Foundation has approved for third-party content used by its projects. Inclusion in this list does not imply that the Eclipse Foundation has determined that every one of these licenses can be used by your Eclipse Foundation project. That is, the licenses on this list are not necessarily compatible with every Eclipse Foundation project license, or with each other. ","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"contents":["eclipse:Artistic-2.0","Artistic License 2.0"],"tag":"ApprovedLicense"},"type":"EclipseLicense"},{"applicableLNs":{"contents":[{"contents":"ifrOSS:Artistic License (v. 2.0)","tag":"LN"},[{"contents":"Artistic License (v. 2.0)","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["ifrOSS License","73cbc843bc3fe24d1ecd037cee7ff83f"],"impliedStmts":[{"contents":[null,"http://www.perlfoundation.org/artistic_license_2_0"],"tag":"LicenseUrl"},{"contents":[{"contents":[{"contents":{"contents":{"contents":["ifrOSS Classification","Lizenzen mit Wahlmglichkeiten",{"contents":"Diese Lizenzen sehen unterschiedliche rechtliche Folgen vor, je nachdem wie umfangreich eine Modifikation ist. Zudem werden dem Lizenznehmer verschiedene Wahlmglichkeiten eingerumt, wie Weiterentwicklungen weiterverbreitet werden knnen.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"}]],"tag":"SubStatements"},[{"contents":{"contents":{"contents":["ifrOSS Classification","Open Source Lizenzen",{"contents":"Die hier aufgefhrten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschrnktem Copyleft-Effekt](#lizenzen-mit-beschrnktem-copyleft-effekt)\n* [Lizenzen mit Wahlmglichkeiten](#lizenzen-mit-wahlmglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgefhrten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"}],"raw":{"ifrossCategoriesWithDescription":[["Open Source Lizenzen","Die hier aufgefhrten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschrnktem Copyleft-Effekt](#lizenzen-mit-beschrnktem-copyleft-effekt)\n* [Lizenzen mit Wahlmglichkeiten](#lizenzen-mit-wahlmglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgefhrten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n"],["Lizenzen mit Wahlmglichkeiten","Diese Lizenzen sehen unterschiedliche rechtliche Folgen vor, je nachdem wie umfangreich eine Modifikation ist. Zudem werden dem Lizenznehmer verschiedene Wahlmglichkeiten eingerumt, wie Weiterentwicklungen weiterverbreitet werden knnen."]],"ifrossLicenseName":"ifrOSS:Artistic License (v. 2.0)","ifrossLicenseNameShortened":"Artistic License (v. 2.0)","ifrossLicenseUrl":"http://www.perlfoundation.org/artistic_license_2_0"},"type":"ifrOSS License"},{"applicableLNs":{"contents":[{"contents":"Artistic-2.0","tag":"LN"},[{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic License (v. 2.0)","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Curation","bc6a0d3a73c79f0a5daf9a8205bac59c"],"impliedStmts":[],"raw":[{"contents":[{"contents":"Artistic-2.0","tag":"LN"},[{"contents":"Artistic 2.0","tag":"LN"},{"contents":"Artistic License (v. 2.0)","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"type":"Curation"}]