[{"applicableLNs":{"contents":[{"contents":"spdx:Artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic License 1.0 w/clause 8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","f137a51001d0138cec5a0946bcfa9130"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","This license was superseded by v2.0. This is Artistic License 1.0 as found on OSI site, including clause 8."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"The Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n     \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n     \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n     \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n     \"You\" is you, if you're thinking about copying or distributing this Package.\n\n     \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n     \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n     b) use the modified Package only within your corporation or organization.\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n     d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n     c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n     d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n7. C or perl subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n\n8.Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The Artistic License</p>\n\n      </div>\n\n      <p>Preamble</p>\n\n      <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Reasonable copying fee&quot; is whatever you can justify on the basis of media cost, duplication\n         charges, time of people involved, and so on. (You will not be required to justify it to the Copyright\n         Holder, but only to the computing community at large as a market that must bear the fee.)</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the item itself, though there may be fees\n         involved in handling the item. It also means that recipients of the item may redistribute it under the\n         same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public Domain\n             or from the Copyright Holder. A Package modified in such a way shall still be considered the\n             Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n              place your modifications in the Public Domain or otherwise make them Freely Available, such\n                 as by posting said modifications to Usenet or an equivalent medium, or placing the\n                 modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright\n                 Holder to include your modifications in the Standard Version of the Package.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n              use the modified Package only within your corporation or organization.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n              rename any non-standard executables so the names do not conflict with standard executables,\n                 which must also be provided, and provide a separate manual page for each non-standard\n                 executable that clearly documents how it differs from the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n              make other distribution arrangements with the Copyright Holder.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n              distribute a Standard Version of the executables and library files, together with\n                 instructions (in the manual page or equivalent) on where to get the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n              accompany the distribution with the machine-readable source of the Package with your modifications.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n              accompany any non-standard executables with their corresponding Standard Version executables,\n                 giving the non-standard executables non-standard names, and clearly documenting the\n                 differences in manual pages (or equivalent), together with instructions on where to get\n                 the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n              make other distribution arrangements with the Copyright Holder.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a reasonable copying fee for any distribution of this Package. You may charge any\n             fee you choose for support of this Package. You may not charge a fee for this Package itself.\n             However, you may distribute this Package in aggregate with other (possibly commercial)\n             programs as part of a larger (possibly commercial) software distribution provided that you do\n             not advertise this Package as a product of your own.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whomever generated them, and may be sold commercially, and may be aggregated with this\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C or perl subroutines supplied by you and linked into this Package shall not be considered part\n             of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Aggregation of this Package with a commercial distribution is always permitted provided that\n             the use of this Package is embedded; that is, when no overt attempt is made to make this\n             Package&apos;s interfaces visible to the end user of the commercial distribution. Such use\n             shall not be construed as a distribution of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>The End</p>\n\n      </div>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"https://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":false,"isValid":true,"isWayBackLink":false,"match":"N/A","order":0,"timestamp":"2024-04-17T05:02:09Z","url":"https://opensource.org/licenses/Artistic-1.0"}],"isDeprecatedLicenseId":false,"isFsfLibre":null,"isOsiApproved":true,"licenseComments":"This license was superseded by v2.0. This is Artistic License 1.0 as found on OSI site, including clause 8.","licenseId":"spdx:Artistic-1.0-cl8","licenseText":"The Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n     \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n     \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n     \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n     \"You\" is you, if you're thinking about copying or distributing this Package.\n\n     \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n     \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n     b) use the modified Package only within your corporation or organization.\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n     d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n     c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n     d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n7. C or perl subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n\n8.Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The Artistic License</p>\n\n      </div>\n\n      <p>Preamble</p>\n\n      <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Reasonable copying fee&quot; is whatever you can justify on the basis of media cost, duplication\n         charges, time of people involved, and so on. (You will not be required to justify it to the Copyright\n         Holder, but only to the computing community at large as a market that must bear the fee.)</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the item itself, though there may be fees\n         involved in handling the item. It also means that recipients of the item may redistribute it under the\n         same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public Domain\n             or from the Copyright Holder. A Package modified in such a way shall still be considered the\n             Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n              place your modifications in the Public Domain or otherwise make them Freely Available, such\n                 as by posting said modifications to Usenet or an equivalent medium, or placing the\n                 modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright\n                 Holder to include your modifications in the Standard Version of the Package.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n              use the modified Package only within your corporation or organization.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n              rename any non-standard executables so the names do not conflict with standard executables,\n                 which must also be provided, and provide a separate manual page for each non-standard\n                 executable that clearly documents how it differs from the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n              make other distribution arrangements with the Copyright Holder.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n              distribute a Standard Version of the executables and library files, together with\n                 instructions (in the manual page or equivalent) on where to get the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n              accompany the distribution with the machine-readable source of the Package with your modifications.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n              accompany any non-standard executables with their corresponding Standard Version executables,\n                 giving the non-standard executables non-standard names, and clearly documenting the\n                 differences in manual pages (or equivalent), together with instructions on where to get\n                 the Standard Version.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n              make other distribution arrangements with the Copyright Holder.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a reasonable copying fee for any distribution of this Package. You may charge any\n             fee you choose for support of this Package. You may not charge a fee for this Package itself.\n             However, you may distribute this Package in aggregate with other (possibly commercial)\n             programs as part of a larger (possibly commercial) software distribution provided that you do\n             not advertise this Package as a product of your own.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whomever generated them, and may be sold commercially, and may be aggregated with this\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C or perl subroutines supplied by you and linked into this Package shall not be considered part\n             of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Aggregation of this Package with a commercial distribution is always permitted provided that\n             the use of this Package is embedded; that is, when no overt attempt is made to make this\n             Package&apos;s interfaces visible to the end user of the commercial distribution. Such use\n             shall not be construed as a distribution of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>The End</p>\n\n      </div>\n    ","name":"Artistic License 1.0 w/clause 8","seeAlso":["https://opensource.org/licenses/Artistic-1.0"],"standardLicenseTemplate":"<<beginOptional>>The Artistic License\n\n<<endOptional>>\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> use the modified Package only within your corporation or organization.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> C or perl subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n\n   <<var;name=\"bullet\";original=\"8.\";match=\".{0,20}\">> Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   <<var;name=\"bullet\";original=\"9.\";match=\".{0,20}\">> The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   <<var;name=\"bullet\";original=\"10.\";match=\".{0,20}\">> THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.<<beginOptional>> The End\n\n<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"google:Artistic10cl8","tag":"LN"},[{"contents":"spdx:Artistic-1.0-cl8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","2c7db799c6d2ce29684aacd42fa71ba8"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:Artistic10cl8","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:Artistic-1.0-cl8"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":"BlueOak:Artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic License 1.0 w/clause 8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","b0ad7605cd6e667597c4453b48107ec3"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Lead",{"contents":"These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/Artistic-1.0-cl8.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Lead","These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.",{"_id":"Artistic-1.0-cl8","_name":"Artistic License 1.0 w/clause 8","_url":"https://spdx.org/licenses/Artistic-1.0-cl8.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"scancode:artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic 1.0 w/clause 8","tag":"LN"},{"contents":"Artistic License 1.0 w/clause 8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","d90962ec33e85049920b50513f20e23d"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://spdx.org/licenses/Artistic-1.0-cl8","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":"http://opensource.org/licenses/Artistic-1.0","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license was superseded by v2.0 This is Artistic License\n1.0 as found on OSI site, including clause 8.\n"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":["OSI","http://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"},{"contents":[null,"http://spdx.org/licenses/Artistic-1.0-cl8"],"tag":"LicenseUrl"},{"contents":[null,"http://www.gnu.org/licenses/license-list.html#ArtisticLicense"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"},{"contents":"Preamble\n\nThe intent of this document is to state the conditions under which a Package may\nbe copied, such that the Copyright Holder maintains some semblance of artistic\ncontrol over the development of the package, while giving the users of the\npackage the right to use and distribute the Package in a more-or-less customary\nfashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder,\nand derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has\nbeen modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the\npackage.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost,\nduplication charges, time of people involved, and so on. (You will not be\nrequired to justify it to the Copyright Holder, but only to the computing\ncommunity at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though\nthere may be fees involved in handling the item. It also means that recipients\nof the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard\nVersion of this Package without restriction, provided that you duplicate all of\nthe original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived\nfrom the Public Domain or from the Copyright Holder. A Package modified in such\na way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that\nyou insert a prominent notice in each changed file stating how and when you\nchanged that file, and provided that you do at least ONE of the following:\n\na) place your modifications in the Public Domain or otherwise make them Freely\nAvailable, such as by posting said modifications to Usenet or an equivalent\nmedium, or placing the modifications on a major archive site such as ftp.uu.net,\nor by allowing the Copyright Holder to include your modifications in the\nStandard Version of the Package.\n\nb) use the modified Package only within your corporation or organization.\n\nc) rename any non-standard executables so the names do not conflict with\nstandard executables, which must also be provided, and provide a separate manual\npage for each non-standard executable that clearly documents how it differs from\nthe Standard Version.\n\nd) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable\nform, provided that you do at least ONE of the following:\n\na) distribute a Standard Version of the executables and library files, together\nwith instructions (in the manual page or equivalent) on where to get the\nStandard Version.\n\nb) accompany the distribution with the machine-readable source of the Package\nwith your modifications.\n\nc) accompany any non-standard executables with their corresponding Standard\nVersion executables, giving the non-standard executables non-standard names, and\nclearly documenting the differences in manual pages (or equivalent), together\nwith instructions on where to get the Standard Version.\n\nd) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package.\nYou may charge any fee you choose for support of this Package. You may not\ncharge a fee for this Package itself. However, you may distribute this Package\nin aggregate with other (possibly commercial) programs as part of a larger\n(possibly commercial) software distribution provided that you do not advertise\nthis Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from\nthe programs of this Package do not automatically fall under the copyright of\nthis Package, but belong to whomever generated them, and may be sold\ncommercially, and may be aggregated with this Package.\n\n7. C or perl subroutines supplied by you and linked into this Package shall not\nbe considered part of this Package.\n\n8.Aggregation of this Package with a commercial distribution is always permitted\nprovided that the use of this Package is embedded; that is, when no overt\nattempt is made to make this Package's interfaces visible to the end user of the\ncommercial distribution. Such use shall not be construed as a distribution of\nthis Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF\nMERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://spdx.org/licenses/Artistic-1.0-cl8","_key":"artistic-1.0-cl8","_name":"Artistic License 1.0 w/clause 8","_notes":"Per SPDX.org, this license was superseded by v2.0 This is Artistic License\n1.0 as found on OSI site, including clause 8.\n","_osiUrl":"http://opensource.org/licenses/Artistic-1.0","_otherUrls":["http://www.gnu.org/licenses/license-list.html#ArtisticLicense","https://opensource.org/licenses/Artistic-1.0"],"_owner":"OSI - Open Source Initiative","_shortName":"Artistic 1.0 w/clause 8","_spdxId":"Artistic-1.0-cl8","_text":"Preamble\n\nThe intent of this document is to state the conditions under which a Package may\nbe copied, such that the Copyright Holder maintains some semblance of artistic\ncontrol over the development of the package, while giving the users of the\npackage the right to use and distribute the Package in a more-or-less customary\nfashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder,\nand derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has\nbeen modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the\npackage.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost,\nduplication charges, time of people involved, and so on. (You will not be\nrequired to justify it to the Copyright Holder, but only to the computing\ncommunity at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though\nthere may be fees involved in handling the item. It also means that recipients\nof the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard\nVersion of this Package without restriction, provided that you duplicate all of\nthe original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived\nfrom the Public Domain or from the Copyright Holder. A Package modified in such\na way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that\nyou insert a prominent notice in each changed file stating how and when you\nchanged that file, and provided that you do at least ONE of the following:\n\na) place your modifications in the Public Domain or otherwise make them Freely\nAvailable, such as by posting said modifications to Usenet or an equivalent\nmedium, or placing the modifications on a major archive site such as ftp.uu.net,\nor by allowing the Copyright Holder to include your modifications in the\nStandard Version of the Package.\n\nb) use the modified Package only within your corporation or organization.\n\nc) rename any non-standard executables so the names do not conflict with\nstandard executables, which must also be provided, and provide a separate manual\npage for each non-standard executable that clearly documents how it differs from\nthe Standard Version.\n\nd) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable\nform, provided that you do at least ONE of the following:\n\na) distribute a Standard Version of the executables and library files, together\nwith instructions (in the manual page or equivalent) on where to get the\nStandard Version.\n\nb) accompany the distribution with the machine-readable source of the Package\nwith your modifications.\n\nc) accompany any non-standard executables with their corresponding Standard\nVersion executables, giving the non-standard executables non-standard names, and\nclearly documenting the differences in manual pages (or equivalent), together\nwith instructions on where to get the Standard Version.\n\nd) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package.\nYou may charge any fee you choose for support of this Package. You may not\ncharge a fee for this Package itself. However, you may distribute this Package\nin aggregate with other (possibly commercial) programs as part of a larger\n(possibly commercial) software distribution provided that you do not advertise\nthis Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from\nthe programs of this Package do not automatically fall under the copyright of\nthis Package, but belong to whomever generated them, and may be sold\ncommercially, and may be aggregated with this Package.\n\n7. C or perl subroutines supplied by you and linked into this Package shall not\nbe considered part of this Package.\n\n8.Aggregation of this Package with a commercial distribution is always permitted\nprovided that the use of this Package is embedded; that is, when no overt\nattempt is made to make this Package's interfaces visible to the end user of the\ncommercial distribution. Such use shall not be construed as a distribution of\nthis Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF\nMERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End","_textUrls":["http://spdx.org/licenses/Artistic-1.0-cl8"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:Artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic License 1.0 w/clause 8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","634e10f62c051e3f763334556f7619a2"],"impliedStmts":[{"contents":{"contents":[null,"https://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","This license was superseded by v2.0. This is Artistic License 1.0 as found on OSI site, including clause 8."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   7. C or perl subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n\n   8.Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Artistic License 1.0 w/clause 8","_rf_notes":"This license was superseded by v2.0. This is Artistic License 1.0 as found on OSI site, including clause 8.","_rf_risk":null,"_rf_shortname":"fossology:Artistic-1.0-cl8","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   7. C or perl subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n\n   8.Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","_rf_text_updatable":false,"_rf_url":"https://opensource.org/licenses/Artistic-1.0"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:Artistic-1.0-cl8","tag":"LN"},"id":["OrtLicenseCategorization","ca0a2a7b25f45c29de571a9a64b941a1"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:Artistic-1.0-cl8"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:Artistic-1.0-cl8","tag":"LN"},"id":["OrtLicenseCategorization","603479befe765dc7fda4d3bde0ae3bf6"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-file-level",{"contents":"Open source license that requires you to license modifications made into the same file with the same license as the original open source file. This also applies, if you add code from this file to your own file. Example: MPL-2.0.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:distribute-source-code",{"contents":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:modification-related-obligations",{"contents":"This property indicates that the license contains obligations that are triggered by modifying the licensed content. The scope of obligations could vary, but typically it is about somehow making sure that the recipients of the modified content don't attribute the modifications to the wrong author and/or that the unmodified content is available to the recipients. The obligations go beoynd of mere marking of the modifications. Artistic-type licenses have this property, but also some others.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that requires you to license modifications made into the same file with the same license as the original open source file. This also applies, if you add code from this file to your own file. Example: MPL-2.0.","name":"copyleft-file-level"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"},{"description":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","name":"property:distribute-source-code"},{"description":"This property indicates that the license contains obligations that are triggered by modifying the licensed content. The scope of obligations could vary, but typically it is about somehow making sure that the recipients of the modified content don't attribute the modifications to the wrong author and/or that the unmodified content is available to the recipients. The obligations go beoynd of mere marking of the modifications. Artistic-type licenses have this property, but also some others.","name":"property:modification-related-obligations"}],"_olcLicensename":"SPDX:Artistic-1.0-cl8"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:Artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic-1.0-cl8","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","fcfef29607462b326453a77154745f02"],"impliedStmts":[],"raw":{"_clcAlias":["Artistic-1.0-cl8"],"_clcName":"cavil:Artistic-1.0-cl8"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Artistic License 1.0 (cl8)","tag":"LN"},[{"contents":"spdx:Artistic-1.0-cl8","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Artistic License","tag":"LN"},{"contents":"Artistic 1.0, Version cl8","tag":"LN"},{"contents":"Artistic 1.0 cl8","tag":"LN"},{"contents":"Artistic-1.0, Version cl8","tag":"LN"},{"contents":"Artistic-1.0 cl8","tag":"LN"},{"contents":"Artistic 1.0 License, Version cl8","tag":"LN"},{"contents":"Artistic 1.0 License cl8","tag":"LN"},{"contents":"Artistic-1.0 License, Version cl8","tag":"LN"},{"contents":"Artistic-1.0 License cl8","tag":"LN"},{"contents":"scancode:artistic-1.0-cl8","tag":"LN"},{"contents":"osi:Artistic-1.0-Perl","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","46b14525aa545ce1109ea0ac0de59d99"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prfung seitens Open CoDE sowohl der Open Source Definition (gem Definition der Open Source Initiative [extern]) entspricht und darber hinaus keine fr die ffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Auer in Ausnahmefllen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["Artistic 1.0, Version cl8","Artistic 1.0 cl8","Artistic-1.0, Version cl8","Artistic-1.0 cl8","Artistic 1.0 License, Version cl8","Artistic 1.0 License cl8","Artistic-1.0 License, Version cl8","Artistic-1.0 License cl8"],"_canonicalName":"metaeffekt:Artistic License 1.0 (cl8)","_category":"Artistic License","_openCoDEStatus":"approved","_otherIds":["scancode:artistic-1.0-cl8","osi:Artistic-1.0-Perl"],"_shortName":null,"_spdxIdentifier":"spdx:Artistic-1.0-cl8"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"spdx:Artistic-1.0-cl8","tag":"LN"},[{"contents":"Artistic License 1.0 w/clause 8","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["HermineLicense","50733ecf5e129b7756be3abb2562599c"],"impliedStmts":[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["HermineLicense","We consider it is FOSS",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["HermineLicense",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":"","tag":"LicenseText"},{"contents":[null,"https://opensource.org/licenses/Artistic-1.0"],"tag":"LicenseUrl"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense","\"Artistic-1.0-cl8\" is of radical: Artistic"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"autoupgrade":null,"comment":"","copyleft":"Weak","ethical_clause":false,"foss":"Yes","fsf_approved":null,"inspiration_spdx":"","law_choice":"","license_version":"1.0","long_name":"Artistic License 1.0 w/clause 8","non_commercial":false,"non_tivoisation":false,"obligations":[{"generic":[{"description":"Make the corresponding source code available (including modifications):\r\n-at the time of distribution of the software and on the same medium;\r\n-by including a written offer allowing others to obtain it;\r\n-by making it available online.","metacategory":"ProvidingSourceCode","name":"Providing CSC to end user","passivity":"Active"}],"license":["Artistic-1.0-cl8"],"name":"Providing CSC to end user or specific actions","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\r\n\r\n    a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\r\n    b) accompany the distribution with the machine-readable source of the Package with your modifications.\r\n    c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\r\n    d) make other distribution arrangements with the Copyright Holder."},{"generic":[{"description":"Keep all legal notices and license texts intact in the Source Code, including in the headers.","metacategory":"Mentions","name":"Preserve legal mentions in source code","passivity":"Active"}],"license":["Artistic-1.0-cl8"],"name":"Preserve License and notices in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers."},{"generic":[{"description":"Document all your modifications made in the source code of third-party Open Source components in order to clearly attribute each contribution.","metacategory":"Mentions","name":"Track and mention modifications in the source code","passivity":"Active"}],"license":["Artistic-1.0-cl8"],"name":"Marking modifications in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file,"},{"generic":[{"description":"You can't ask for a fee for the right to use the software, but it is possible to charge for access to the software a reasonable amount or to sell a larger work that includes the software, but not the software in itself.","metacategory":"LicenseAgreement","name":"Don't sell the software in itself","passivity":"Passive"}],"license":["Artistic-1.0-cl8"],"name":"Don't charge a fee for this Package itself.","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own."},{"generic":[{"description":"Some categories of derivative works or of works based on the Open Source Software must be distributed under the initial license or another license approved by the initial license.","metacategory":"IPManagement","name":"Weak Copyleft","passivity":"Active"}],"license":["Artistic-1.0-cl8"],"name":"Weak Copyleft or renaming","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"3. You may otherwise modify your copy of this Package in any way[...] provided that you do at least ONE of the following:\r\n\r\n    a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\r\n    b) use the modified Package only within your corporation or organization.\r\n    c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\r\n    d) make other distribution arrangements with the Copyright Holder.\r\n\r\n5.[...] However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\r\n\r\n8.Aggregation of this Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package."},{"generic":[{"description":"Names of the project or associated persons (authors, contributors, etc.) are not to be used for commercial or promotional purposes.","metacategory":"Communication","name":"Do not use project or contributor names for endorsement or promotion.","passivity":"Passive"}],"license":["Artistic-1.0-cl8"],"name":"No use of names for endorsement","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission."}],"osi_approved":true,"patent_grant":false,"radical":"Artistic","spdx_id":"Artistic-1.0-cl8","steward":"","url":"https://opensource.org/licenses/Artistic-1.0","verbatim":""},"type":"HermineLicense"}]