[{"applicableLNs":{"contents":[{"contents":"spdx:BSD-Protection","tag":"LN"},[{"contents":"BSD Protection License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","7c0f9b52a64284732a0179c763b25201"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":null,"tag":"MaybeStatement"},{"contents":[{"contents":"BSD Protection License\nFebruary 2002\n\nPreamble\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n----------------------------------------------------------------\n\n0. Definitions.\n\n     a) \"Program\", below, refers to any program or work distributed under the terms of this license.\n     b) A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law.\n     c) \"Modification\", below, refers to the act of creating derivative works.\n     d) \"You\", below, refers to each licensee.\n\n1. Scope.\nThis license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n2. Verbatim copies.\nYou may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license.\nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n     b) The derivative work must be clearly identified as such, in order that it may not be confused with the original work.\n     c) The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license.\nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n     b) You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found.\n     c) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n5. Implied acceptance.\nYou may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n6. NO WARRANTY.\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>BSD Protection License\n        <br />\n\nFebruary 2002\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Preamble\n        <br />\n\n--------\n      </p>\n\n         <p>The Berkeley Software Distribution (&quot;BSD&quot;) license has proven very effective over the years at\n         allowing for a wide spread of work throughout both commercial and non-commercial products. For\n         programmers whose primary intention is to improve the general quality of available software, it is\n         arguable that there is no better license than the BSD license, as it permits improvements to be used\n         wherever they will help, without idealogical or metallic constraint.</p>\n\n         <p>This is of particular value to those who produce reference implementations of proposed standards: The\n         case of TCP/IP clearly illustrates that freely and universally available implementations leads the\n         rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network\n         models).</p>\n\n         <p>With the rapid proliferation of software licensed under the GNU General Public License, however, the\n         continued success of this role is called into question. Given that the inclusion of a few lines of\n         &quot;GPL-tainted&quot; work into a larger body of work will result in restricted distribution -- and\n         given that further work will likely build upon the &quot;tainted&quot; portions, making them difficult\n         to remove at a future date -- there are inevitable circumstances where authors would, in order to\n         protect their goal of providing for the widespread usage of their work, wish to guard against such\n         &quot;GPL-taint&quot;.</p>\n\n         <p>In addition, one can imagine that companies which operate by producing and selling (possibly\n         closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor.\n         While under existing licenses this would mean not releasing their code under any form of open license,\n         if a license existed under which they could incorporate any improvements back into their own\n         (commercial) products then they might be far more willing to provide for non-closed distribution.</p>\n\n         <p>For the above reasons, we put forth this &quot;BSD Protection License&quot;: A license designed to retain\n         the freedom granted by the BSD license to use licensed works in a wide variety of settings, both\n         non-commercial and commercial, while protecting the work from having future contributors restrict that\n         freedom.</p>\n\n         <p>The precise terms and conditions for copying, distribution, and modification follow.</p>\n\n      </div>\n\n      <p>BSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION</p>\n\n      <var class=\"optional-license-text\"> ----------------------------------------------------------------</var>\n      \n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 0.</var>\n          Definitions.\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            &quot;Program&quot;, below, refers to any program or work distributed under the terms of this\n               license.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            A &quot;work based on the Program&quot;, below, refers to either the Program or any\n               derivative work under copyright law.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            &quot;Modification&quot;, below, refers to the act of creating derivative works.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            &quot;You&quot;, below, refers to each licensee.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          Scope.\n            <br />\n\n   This license governs the copying, distribution, and modification of the Program. Other\n                 activities are outside the scope of this license; The act of running the Program is\n                 not restricted, and the output from the Program is covered only if its contents\n                 constitute a work based on the Program.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Verbatim copies.\n            <br />\n\n   You may copy and distribute verbatim copies of the Program as you receive it, in any\n                 medium, provided that you conspicuously and appropriately publish on each copy an\n                 appropriate copyright notice; keep intact all the notices that refer to this License\n                 and to the absence of any warranty; and give any other recipients of the Program a\n                 copy of this License along with the Program.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Modification and redistribution under closed license.\n            <br />\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative\n                 works, provided that you meet the following conditions:\n\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            The copyright notice and disclaimer on the Program must be reproduced and included in the\n               source code, documentation, and/or other materials provided in a manner in which such\n               notices are normally distributed.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            The derivative work must be clearly identified as such, in order that it may not be confused\n               with the original work.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            The license under which the derivative work is distributed must expressly prohibit the\n               distribution of further derivative works.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Modification and redistribution under open license.\n            <br />\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative\n                 works, provided that you meet the following conditions:\n\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            The copyright notice and disclaimer on the Program must be reproduced and included in the\n               source code, documentation, and/or other materials provided in a manner in which such\n               notices are normally distributed.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            You must clearly indicate the nature and date of any changes made to the Program. The full\n               details need not necessarily be included in the individual modified files, provided that\n               each modified file is clearly marked as such and instructions are included on where the\n               full details of the modifications may be found.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            You must cause any work that you distribute or publish, that in whole or in part contains or\n               is derived from the Program or any part thereof, to be licensed as a whole at no charge to\n               all third parties under the terms of this License.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          Implied acceptance.\n            <br />\n\n   You may not copy or distribute the Program or any derivative works except as expressly\n                 provided under this license. Consequently, any such action will be taken as implied\n                 acceptance of the terms of this license.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          NO WARRANTY.\n        </li>\n      \n</ul>\n      <p>THIS SOFTWARE IS PROVIDED &quot;AS IS&quot; AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n         LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n         DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n         REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n         EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING,\n         BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n         BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n         LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\n         DAMAGES.</p>\n\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"tag":"LicenseUrl"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:01:24Z","url":"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"}],"isDeprecatedLicenseId":false,"isFsfLibre":null,"isOsiApproved":false,"licenseComments":null,"licenseId":"spdx:BSD-Protection","licenseText":"BSD Protection License\nFebruary 2002\n\nPreamble\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n----------------------------------------------------------------\n\n0. Definitions.\n\n     a) \"Program\", below, refers to any program or work distributed under the terms of this license.\n     b) A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law.\n     c) \"Modification\", below, refers to the act of creating derivative works.\n     d) \"You\", below, refers to each licensee.\n\n1. Scope.\nThis license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n2. Verbatim copies.\nYou may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license.\nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n     b) The derivative work must be clearly identified as such, in order that it may not be confused with the original work.\n     c) The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license.\nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n     b) You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found.\n     c) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n5. Implied acceptance.\nYou may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n6. NO WARRANTY.\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>BSD Protection License\n        <br />\n\nFebruary 2002\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Preamble\n        <br />\n\n--------\n      </p>\n\n         <p>The Berkeley Software Distribution (&quot;BSD&quot;) license has proven very effective over the years at\n         allowing for a wide spread of work throughout both commercial and non-commercial products. For\n         programmers whose primary intention is to improve the general quality of available software, it is\n         arguable that there is no better license than the BSD license, as it permits improvements to be used\n         wherever they will help, without idealogical or metallic constraint.</p>\n\n         <p>This is of particular value to those who produce reference implementations of proposed standards: The\n         case of TCP/IP clearly illustrates that freely and universally available implementations leads the\n         rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network\n         models).</p>\n\n         <p>With the rapid proliferation of software licensed under the GNU General Public License, however, the\n         continued success of this role is called into question. Given that the inclusion of a few lines of\n         &quot;GPL-tainted&quot; work into a larger body of work will result in restricted distribution -- and\n         given that further work will likely build upon the &quot;tainted&quot; portions, making them difficult\n         to remove at a future date -- there are inevitable circumstances where authors would, in order to\n         protect their goal of providing for the widespread usage of their work, wish to guard against such\n         &quot;GPL-taint&quot;.</p>\n\n         <p>In addition, one can imagine that companies which operate by producing and selling (possibly\n         closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor.\n         While under existing licenses this would mean not releasing their code under any form of open license,\n         if a license existed under which they could incorporate any improvements back into their own\n         (commercial) products then they might be far more willing to provide for non-closed distribution.</p>\n\n         <p>For the above reasons, we put forth this &quot;BSD Protection License&quot;: A license designed to retain\n         the freedom granted by the BSD license to use licensed works in a wide variety of settings, both\n         non-commercial and commercial, while protecting the work from having future contributors restrict that\n         freedom.</p>\n\n         <p>The precise terms and conditions for copying, distribution, and modification follow.</p>\n\n      </div>\n\n      <p>BSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION</p>\n\n      <var class=\"optional-license-text\"> ----------------------------------------------------------------</var>\n      \n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 0.</var>\n          Definitions.\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            &quot;Program&quot;, below, refers to any program or work distributed under the terms of this\n               license.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            A &quot;work based on the Program&quot;, below, refers to either the Program or any\n               derivative work under copyright law.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            &quot;Modification&quot;, below, refers to the act of creating derivative works.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            &quot;You&quot;, below, refers to each licensee.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          Scope.\n            <br />\n\n   This license governs the copying, distribution, and modification of the Program. Other\n                 activities are outside the scope of this license; The act of running the Program is\n                 not restricted, and the output from the Program is covered only if its contents\n                 constitute a work based on the Program.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Verbatim copies.\n            <br />\n\n   You may copy and distribute verbatim copies of the Program as you receive it, in any\n                 medium, provided that you conspicuously and appropriately publish on each copy an\n                 appropriate copyright notice; keep intact all the notices that refer to this License\n                 and to the absence of any warranty; and give any other recipients of the Program a\n                 copy of this License along with the Program.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Modification and redistribution under closed license.\n            <br />\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative\n                 works, provided that you meet the following conditions:\n\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            The copyright notice and disclaimer on the Program must be reproduced and included in the\n               source code, documentation, and/or other materials provided in a manner in which such\n               notices are normally distributed.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            The derivative work must be clearly identified as such, in order that it may not be confused\n               with the original work.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            The license under which the derivative work is distributed must expressly prohibit the\n               distribution of further derivative works.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Modification and redistribution under open license.\n            <br />\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative\n                 works, provided that you meet the following conditions:\n\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            The copyright notice and disclaimer on the Program must be reproduced and included in the\n               source code, documentation, and/or other materials provided in a manner in which such\n               notices are normally distributed.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            You must clearly indicate the nature and date of any changes made to the Program. The full\n               details need not necessarily be included in the individual modified files, provided that\n               each modified file is clearly marked as such and instructions are included on where the\n               full details of the modifications may be found.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            You must cause any work that you distribute or publish, that in whole or in part contains or\n               is derived from the Program or any part thereof, to be licensed as a whole at no charge to\n               all third parties under the terms of this License.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          Implied acceptance.\n            <br />\n\n   You may not copy or distribute the Program or any derivative works except as expressly\n                 provided under this license. Consequently, any such action will be taken as implied\n                 acceptance of the terms of this license.\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          NO WARRANTY.\n        </li>\n      \n</ul>\n      <p>THIS SOFTWARE IS PROVIDED &quot;AS IS&quot; AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n         LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n         DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n         REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n         EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING,\n         BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n         BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n         LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\n         DAMAGES.</p>\n\n    ","name":"BSD Protection License","seeAlso":["https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"standardLicenseTemplate":"<<beginOptional>>BSD Protection License\n\nFebruary 2002\n\n<<endOptional>><<beginOptional>> Preamble\n\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\n<<endOptional>>\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n\n<<beginOptional>>----------------------------------------------------------------<<endOptional>>\n\n   <<var;name=\"bullet\";original=\"0.\";match=\".{0,20}\">> Definitions.\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> \"Program\", below, refers to any program or work distributed under the terms of this license.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> \"Modification\", below, refers to the act of creating derivative works.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> \"You\", below, refers to each licensee.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Scope.\n\n   This license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Verbatim copies.\n\n   You may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Modification and redistribution under closed license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> The derivative work must be clearly identified as such, in order that it may not be confused with the original work.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Modification and redistribution under open license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> Implied acceptance.\n\n   You may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> NO WARRANTY.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"google:BSDProtection","tag":"LN"},[{"contents":"spdx:BSD-Protection","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","866590dcab3018665de050bc8a7c5eb9"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:BSDProtection","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:BSD-Protection"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:BSD-Protection","tag":"LN"},[{"contents":"spdx:BSD-Protection","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"BSD Protection License","tag":"LN"},{"contents":"BSD Protection","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","6935e7bb33286fd29f5e2258bf50a8e6"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":["BSD Protection"],"_legacy_names":["BSD Protection License"],"_notes":null},"_id":"BSD-Protection","_license":{"_expression":"spdx:BSD-Protection","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":["https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":[{"contents":"BlueOak:BSD-Protection","tag":"LN"},[{"contents":"BSD Protection License","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"BSD Protection License","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["BlueOakCouncil","a5c875935bfc35f674ba9ead90dd368d"],"impliedStmts":[{"contents":[{"contents":{"tag":"StronglyProtective"},"tag":"LicenseType"},[{"contents":{"tag":"Copyleft"},"tag":"LicenseType"}]],"tag":"SubStatements"},{"contents":[null,"https://spdx.org/licenses/BSD-Protection"],"tag":"LicenseUrl"}],"raw":{"contents":["strong","BSD Protection License",{"_id":"BSD-Protection","_name":"BSD Protection License","_url":"https://spdx.org/licenses/BSD-Protection"}],"tag":"BOCCopyleft"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"scancode:bsd-protection","tag":"LN"},[{"contents":"BSD Protection License","tag":"LN"},{"contents":"BSD Protection License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","530d07ca49116ddd5c393692fd9ca177"],"impliedStmts":[{"contents":{"tag":"Copyleft"},"tag":"LicenseType"},{"contents":{"contents":"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"tag":"LicenseUrl"},{"contents":"BSD Protection License\nFebruary 2002\n\nPreamble\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective\nover the years at allowing for a wide spread of work throughout both\ncommercial and non-commercial products.  For programmers whose primary\nintention is to improve the general quality of available software, it is\narguable that there is no better license than the BSD license, as it\npermits improvements to be used wherever they will help, without\nidealogical or metallic constraint.\n\nThis is of particular value to those who produce reference\nimplementations of proposed standards: The case of TCP/IP clearly\nillustrates that freely and universally available implementations leads\nthe rapid acceptance of standards -- often even being used instead of a\nde jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General\nPublic License, however, the continued success of this role is called\ninto question.  Given that the inclusion of a few lines of \"GPL-tainted\"\nwork into a larger body of work will result in restricted distribution\n-- and given that further work will likely build upon the \"tainted\"\nportions, making them difficult to remove at a future date -- there are\ninevitable circumstances where authors would, in order to protect their\ngoal of providing for the widespread usage of their work, wish to guard\nagainst such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing\nand selling (possibly closed-source) code would wish to protect\nthemselves against the rise of a GPL-licensed competitor.  While under\nexisting licenses this would mean not releasing their code under any\nform of open license, if a license existed under which they could\nincorporate any improvements back into their own (commercial) products\nthen they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A\nlicense designed to retain the freedom granted by the BSD license to use\nlicensed works in a wide variety of settings, both non-commercial and\ncommercial, while protecting the work from having future contributors\nrestrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and\nmodification follow.\n\nBSD PROTECTION LICENSE\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n----------------------------------------------------------------\n\n0. Definitions.\n   a) \"Program\", below, refers to any program or work distributed under\n      the terms of this license.\n   b) A \"work based on the Program\", below, refers to either the Program\n      or any derivative work under copyright law.\n   c) \"Modification\", below, refers to the act of creating derivative\n      works.\n   d) \"You\", below, refers to each licensee.\n\n1. Scope.\n   This license governs the copying, distribution, and modification of\n   the Program.  Other activities are outside the scope of this\n   license; The act of running the Program is not restricted, and the\n   output from the Program is covered only if its contents constitute a\n   work based on the Program.\n\n2. Verbatim copies.\n   You may copy and distribute verbatim copies of the Program as you\n   receive it, in any medium, provided that you conspicuously and\n   appropriately publish on each copy an appropriate copyright notice;\n   keep intact all the notices that refer to this License and to the\n   absence of any warranty; and give any other recipients of the\n   Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) The derivative work must be clearly identified as such, in order\n      that it may not be confused with the original work.\n   c) The license under which the derivative work is distributed must\n      expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) You must clearly indicate the nature and date of any changes made\n      to the Program.  The full details need not necessarily be\n      included in the individual modified files, provided that each\n      modified file is clearly marked as such and instructions are\n      included on where the full details of the modifications may be\n      found.\n   c) You must cause any work that you distribute or publish, that in\n      whole or in part contains or is derived from the Program or any\n      part thereof, to be licensed as a whole at no charge to all third\n      parties under the terms of this License.\n\n5. Implied acceptance.\n   You may not copy or distribute the Program or any derivative works\n   except as expressly provided under this license.  Consequently, any\n   such action will be taken as implied acceptance of the terms of this\n   license.\n\n6. NO WARRANTY.\n   THIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED\n   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n   MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n   DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER\n   PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED\n   ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n   EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\n   INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO,\n   PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n   PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\n   OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN\n   IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\n   SUCH DAMAGES.","tag":"LicenseText"}],"raw":{"_category":"Copyleft","_homepageUrl":"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License","_key":"bsd-protection","_name":"BSD Protection License","_notes":null,"_osiUrl":null,"_otherUrls":[],"_owner":"FreeBSD","_shortName":"BSD Protection License","_spdxId":"BSD-Protection","_text":"BSD Protection License\nFebruary 2002\n\nPreamble\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective\nover the years at allowing for a wide spread of work throughout both\ncommercial and non-commercial products.  For programmers whose primary\nintention is to improve the general quality of available software, it is\narguable that there is no better license than the BSD license, as it\npermits improvements to be used wherever they will help, without\nidealogical or metallic constraint.\n\nThis is of particular value to those who produce reference\nimplementations of proposed standards: The case of TCP/IP clearly\nillustrates that freely and universally available implementations leads\nthe rapid acceptance of standards -- often even being used instead of a\nde jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General\nPublic License, however, the continued success of this role is called\ninto question.  Given that the inclusion of a few lines of \"GPL-tainted\"\nwork into a larger body of work will result in restricted distribution\n-- and given that further work will likely build upon the \"tainted\"\nportions, making them difficult to remove at a future date -- there are\ninevitable circumstances where authors would, in order to protect their\ngoal of providing for the widespread usage of their work, wish to guard\nagainst such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing\nand selling (possibly closed-source) code would wish to protect\nthemselves against the rise of a GPL-licensed competitor.  While under\nexisting licenses this would mean not releasing their code under any\nform of open license, if a license existed under which they could\nincorporate any improvements back into their own (commercial) products\nthen they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A\nlicense designed to retain the freedom granted by the BSD license to use\nlicensed works in a wide variety of settings, both non-commercial and\ncommercial, while protecting the work from having future contributors\nrestrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and\nmodification follow.\n\nBSD PROTECTION LICENSE\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n----------------------------------------------------------------\n\n0. Definitions.\n   a) \"Program\", below, refers to any program or work distributed under\n      the terms of this license.\n   b) A \"work based on the Program\", below, refers to either the Program\n      or any derivative work under copyright law.\n   c) \"Modification\", below, refers to the act of creating derivative\n      works.\n   d) \"You\", below, refers to each licensee.\n\n1. Scope.\n   This license governs the copying, distribution, and modification of\n   the Program.  Other activities are outside the scope of this\n   license; The act of running the Program is not restricted, and the\n   output from the Program is covered only if its contents constitute a\n   work based on the Program.\n\n2. Verbatim copies.\n   You may copy and distribute verbatim copies of the Program as you\n   receive it, in any medium, provided that you conspicuously and\n   appropriately publish on each copy an appropriate copyright notice;\n   keep intact all the notices that refer to this License and to the\n   absence of any warranty; and give any other recipients of the\n   Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) The derivative work must be clearly identified as such, in order\n      that it may not be confused with the original work.\n   c) The license under which the derivative work is distributed must\n      expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) You must clearly indicate the nature and date of any changes made\n      to the Program.  The full details need not necessarily be\n      included in the individual modified files, provided that each\n      modified file is clearly marked as such and instructions are\n      included on where the full details of the modifications may be\n      found.\n   c) You must cause any work that you distribute or publish, that in\n      whole or in part contains or is derived from the Program or any\n      part thereof, to be licensed as a whole at no charge to all third\n      parties under the terms of this License.\n\n5. Implied acceptance.\n   You may not copy or distribute the Program or any derivative works\n   except as expressly provided under this license.  Consequently, any\n   such action will be taken as implied acceptance of the terms of this\n   license.\n\n6. NO WARRANTY.\n   THIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED\n   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n   MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n   DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER\n   PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED\n   ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n   EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\n   INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO,\n   PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n   PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\n   OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN\n   IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\n   SUCH DAMAGES.","_textUrls":["https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:BSD-Protection","tag":"LN"},[{"contents":"BSD Protection License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","4f626c01f23f221ef681264425479523"],"impliedStmts":[{"contents":{"contents":[null,"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":"BSD Protection License\n\nFebruary 2002 Preamble\n\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION ----------------------------------------------------------------\n\n   0. Definitions.\n\n      a) \"Program\", below, refers to any program or work distributed under the terms of this license.\n\n      b) A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law.\n\n      c) \"Modification\", below, refers to the act of creating derivative works.\n\n      d) \"You\", below, refers to each licensee.\n\n   1. Scope.\n\n   This license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n   2. Verbatim copies.\n\n   You may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n   3. Modification and redistribution under closed license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      b) The derivative work must be clearly identified as such, in order that it may not be confused with the original work.\n\n      c) The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n   4. Modification and redistribution under open license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      b) You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found.\n\n      c) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n   5. Implied acceptance.\n\n   You may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n   6. NO WARRANTY.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"BSD Protection License","_rf_notes":null,"_rf_risk":null,"_rf_shortname":"fossology:BSD-Protection","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"BSD Protection License\n\nFebruary 2002 Preamble\n\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION ----------------------------------------------------------------\n\n   0. Definitions.\n\n      a) \"Program\", below, refers to any program or work distributed under the terms of this license.\n\n      b) A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law.\n\n      c) \"Modification\", below, refers to the act of creating derivative works.\n\n      d) \"You\", below, refers to each licensee.\n\n   1. Scope.\n\n   This license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n   2. Verbatim copies.\n\n   You may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n   3. Modification and redistribution under closed license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      b) The derivative work must be clearly identified as such, in order that it may not be confused with the original work.\n\n      c) The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n   4. Modification and redistribution under open license.\n\n   You may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions:\n\n      a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed.\n\n      b) You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found.\n\n      c) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n   5. Implied acceptance.\n\n   You may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n   6. NO WARRANTY.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","_rf_text_updatable":false,"_rf_url":"https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:BSD-Protection","tag":"LN"},"id":["OrtLicenseCategorization","e224966aef220f20abe19e971f11e7d4"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:BSD-Protection"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:BSD-Protection","tag":"LN"},"id":["OrtLicenseCategorization","d4907617b88233fa03c016066c1e9998"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-strong",{"contents":"Open source license that requires you to license modifications, as well as any code that ends up in the same binary (including static linking and module modifications), as well as other code that is part of the same work, with the same strong copyleft license. Examples: GPL-2.0, GPL-3.0, AGPL-3.0, EUPL-1.0, EUPL-1.1, EUPL-1.2.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:distribute-source-code",{"contents":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that requires you to license modifications, as well as any code that ends up in the same binary (including static linking and module modifications), as well as other code that is part of the same work, with the same strong copyleft license. Examples: GPL-2.0, GPL-3.0, AGPL-3.0, EUPL-1.0, EUPL-1.1, EUPL-1.2.","name":"copyleft-strong"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"},{"description":"This property indicates that the license requires that the source code of the OSS is either distributed, or offered to distribute, in connection with the software delivery.","name":"property:distribute-source-code"}],"_olcLicensename":"SPDX:BSD-Protection"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:BSD-Protection","tag":"LN"},[{"contents":"BSD-Protection","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","9bba2d5107f05203464c8580c73c357d"],"impliedStmts":[],"raw":{"_clcAlias":["BSD-Protection"],"_clcName":"cavil:BSD-Protection"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:BSD Protection License","tag":"LN"},[{"contents":"spdx:BSD-Protection","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"BSD Protection","tag":"LN"},{"contents":"BSD Protection License","tag":"LN"},{"contents":"scancode:bsd-protection","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","d73d807c2683abadfa8d4485b7d488ab"],"impliedStmts":[],"raw":{"_alternativeNames":["BSD Protection License"],"_canonicalName":"metaeffekt:BSD Protection License","_category":"BSD Protection","_openCoDEStatus":null,"_otherIds":["scancode:bsd-protection"],"_shortName":null,"_spdxIdentifier":"spdx:BSD-Protection"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fosslight:BSD Protection License","tag":"LN"},[{"contents":"BSD-Protection","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["FOSSLight","a484a5de8a2dfb244f69d6fc47dfd02a"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}],"raw":{"_FOSSLightFact_License":{"_fossLight_ATTRIBUTION":"","_fossLight_CREATED_DATE":[],"_fossLight_CREATOR":[],"_fossLight_DESCRIPTION":"?? ? ??? ? License ??? ?????. ?, Open Source License? ????? BSD-Protection?? ???? ???.\nCopyright and license notice are required when distributing the software. But, to distribute the software under open source license, it has to be BSD-Protection","_fossLight_LICENSE_TEXT":"BSD Protection License \nFebruary 2002\n\nPreamble \n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective over the years at allowing for a wide spread of work throughout both commercial and non-commercial products. For programmers whose primary intention is to improve the general quality of available software, it is arguable that there is no better license than the BSD license, as it permits improvements to be used wherever they will help, without idealogical or metallic constraint.\n\nThis is of particular value to those who produce reference implementations of proposed standards: The case of TCP/IP clearly illustrates that freely and universally available implementations leads the rapid acceptance of standards -- often even being used instead of a de jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General Public License, however, the continued success of this role is called into question. Given that the inclusion of a few lines of \"GPL-tainted\" work into a larger body of work will result in restricted distribution -- and given that further work will likely build upon the \"tainted\" portions, making them difficult to remove at a future date -- there are inevitable circumstances where authors would, in order to protect their goal of providing for the widespread usage of their work, wish to guard against such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing and selling (possibly closed-source) code would wish to protect themselves against the rise of a GPL-licensed competitor. While under existing licenses this would mean not releasing their code under any form of open license, if a license existed under which they could incorporate any improvements back into their own (commercial) products then they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A license designed to retain the freedom granted by the BSD license to use licensed works in a wide variety of settings, both non-commercial and commercial, while protecting the work from having future contributors restrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and modification follow.\n\nBSD PROTECTION LICENSE TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION \n----------------------------------------------------------------\n\n0. Definitions. \n\n     a) \"Program\", below, refers to any program or work distributed under the terms of this license. \n     b) A \"work based on the Program\", below, refers to either the Program or any derivative work under copyright law. \n     c) \"Modification\", below, refers to the act of creating derivative works. \n     d) \"You\", below, refers to each licensee.\n\n1. Scope. \nThis license governs the copying, distribution, and modification of the Program. Other activities are outside the scope of this license; The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program.\n\n2. Verbatim copies. \nYou may copy and distribute verbatim copies of the Program as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license. \nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions: \n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed. \n     b) The derivative work must be clearly identified as such, in order that it may not be confused with the original work. \n     c) The license under which the derivative work is distributed must expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license. \nYou may modify your copy or copies of the Program, and distribute the resulting derivative works, provided that you meet the following conditions: \n\n     a) The copyright notice and disclaimer on the Program must be reproduced and included in the source code, documentation, and/or other materials provided in a manner in which such notices are normally distributed. \n     b) You must clearly indicate the nature and date of any changes made to the Program. The full details need not necessarily be included in the individual modified files, provided that each modified file is clearly marked as such and instructions are included on where the full details of the modifications may be found. \n     c) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n5. Implied acceptance. \nYou may not copy or distribute the Program or any derivative works except as expressly provided under this license. Consequently, any such action will be taken as implied acceptance of the terms of this license.\n\n6. NO WARRANTY. \nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","_fossLight_MODIFIED_DATE":[],"_fossLight_MODIFIER":[],"_fossLight_OBLIGATION_DISCLOSING_SRC":false,"_fossLight_OBLIGATION_NEEDS_CHECK":false,"_fossLight_OBLIGATION_NOTIFICATION":true,"_fossLight_REQ_LICENSE_TEXT":false,"_fossLight_RESTRICTION":"7","_fossLight_SHORT_IDENTIFIER":"BSD-Protection","_fossLight_USE":true,"_fossLight_WEBPAGE":"https://spdx.org/licenses/BSD-Protection.html","_fossLight_id":26,"_fossLight_name":"fosslight:BSD Protection License","_fossLight_type":"FOSSLight_License_Type_Permissive"},"_FOSSLightFact_Nicks":[]},"type":"FOSSLight"}]