[{"applicableLNs":{"contents":[{"contents":"spdx:CECILL-C","tag":"LN"},[{"contents":"CeCILL-C Free Software License Agreement","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","91542242c7cb33b9606725f3a2fbb3cc"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","French version can be found here: http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"\nCeCILL-C FREE SOFTWARE LICENSE AGREEMENT\n\n\n    Notice\n\nThis Agreement is a Free Software license agreement that is the result\nof discussions between its authors in order to ensure compliance with\nthe two main principles guiding its drafting:\n\n    * firstly, compliance with the principles governing the distribution\n      of Free Software: access to source code, broad rights granted to\n      users,\n    * secondly, the election of a governing law, French law, with which\n      it is conformant, both as regards the law of torts and\n      intellectual property law, and the protection that it offers to\n      both authors and holders of the economic rights over software.\n\nThe authors of the CeCILL-C (for Ce[a] C[nrs] I[nria] L[ogiciel] L[ibre])\nlicense are:\n\nCommissariat à l'Energie Atomique - CEA, a public scientific, technical\nand industrial research establishment, having its principal place of\nbusiness at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n\nCentre National de la Recherche Scientifique - CNRS, a public scientific\nand technological establishment, having its principal place of business\nat 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n\nInstitut National de Recherche en Informatique et en Automatique -\nINRIA, a public scientific and technological establishment, having its\nprincipal place of business at Domaine de Voluceau, Rocquencourt, BP\n105, 78153 Le Chesnay cedex, France.\n\n\n    Preamble\n\nThe purpose of this Free Software license agreement is to grant users\nthe right to modify and re-use the software governed by this license.\n\nThe exercising of this right is conditional upon the obligation to make\navailable to the community the modifications made to the source code of\nthe software so as to contribute to its evolution.\n\nIn consideration of access to the source code and the rights to copy,\nmodify and redistribute granted by the license, users are provided only\nwith a limited warranty and the software's author, the holder of the\neconomic rights, and the successive licensors only have limited liability.\n\nIn this respect, the risks associated with loading, using, modifying\nand/or developing or reproducing the software by the user are brought to\nthe user's attention, given its Free Software status, which may make it\ncomplicated to use, with the result that its use is reserved for\ndevelopers and experienced professionals having in-depth computer\nknowledge. Users are therefore encouraged to load and test the\nsuitability of the software as regards their requirements in conditions\nenabling the security of their systems and/or data to be ensured and,\nmore generally, to use and operate it in the same conditions of\nsecurity. This Agreement may be freely reproduced and published,\nprovided it is not altered, and that no provisions are either added or\nremoved herefrom.\n\nThis Agreement may apply to any or all software for which the holder of\nthe economic rights decides to submit the use thereof to its provisions.\n\n\n    Article 1 - DEFINITIONS\n\nFor the purpose of this Agreement, when the following expressions\ncommence with a capital letter, they shall have the following meaning:\n\nAgreement: means this license agreement, and its possible subsequent\nversions and annexes.\n\nSoftware: means the software in its Object Code and/or Source Code form\nand, where applicable, its documentation, \"as is\" when the Licensee\naccepts the Agreement.\n\nInitial Software: means the Software in its Source Code and possibly its\nObject Code form and, where applicable, its documentation, \"as is\" when\nit is first distributed under the terms and conditions of the Agreement.\n\nModified Software: means the Software modified by at least one\nIntegrated Contribution.\n\nSource Code: means all the Software's instructions and program lines to\nwhich access is required so as to modify the Software.\n\nObject Code: means the binary files originating from the compilation of\nthe Source Code.\n\nHolder: means the holder(s) of the economic rights over the Initial\nSoftware.\n\nLicensee: means the Software user(s) having accepted the Agreement.\n\nContributor: means a Licensee having made at least one Integrated\nContribution.\n\nLicensor: means the Holder, or any other individual or legal entity, who\ndistributes the Software under the Agreement.\n\nIntegrated Contribution: means any or all modifications, corrections,\ntranslations, adaptations and/or new functions integrated into the\nSource Code by any or all Contributors.\n\nRelated Module: means a set of sources files including their\ndocumentation that, without modification to the Source Code, enables\nsupplementary functions or services in addition to those offered by the\nSoftware.\n\nDerivative Software: means any combination of the Software, modified or\nnot, and of a Related Module.\n\nParties: mean both the Licensee and the Licensor.\n\nThese expressions may be used both in singular and plural form.\n\n\n    Article 2 - PURPOSE\n\nThe purpose of the Agreement is the grant by the Licensor to the\nLicensee of a non-exclusive, transferable and worldwide license for the\nSoftware as set forth in Article 5 hereinafter for the whole term of the\nprotection granted by the rights over said Software.\n\n\n    Article 3 - ACCEPTANCE\n\n3.1 The Licensee shall be deemed as having accepted the terms and\nconditions of this Agreement upon the occurrence of the first of the\nfollowing events:\n\n    * (i) loading the Software by any or all means, notably, by\n      downloading from a remote server, or by loading from a physical\n      medium;\n    * (ii) the first time the Licensee exercises any of the rights\n      granted hereunder.\n\n3.2 One copy of the Agreement, containing a notice relating to the\ncharacteristics of the Software, to the limited warranty, and to the\nfact that its use is restricted to experienced users has been provided\nto the Licensee prior to its acceptance as set forth in Article 3.1\nhereinabove, and the Licensee hereby acknowledges that it has read and\nunderstood it.\n\n\n    Article 4 - EFFECTIVE DATE AND TERM\n\n\n      4.1 EFFECTIVE DATE\n\nThe Agreement shall become effective on the date when it is accepted by\nthe Licensee as set forth in Article 3.1.\n\n\n      4.2 TERM\n\nThe Agreement shall remain in force for the entire legal term of\nprotection of the economic rights over the Software.\n\n\n    Article 5 - SCOPE OF RIGHTS GRANTED\n\nThe Licensor hereby grants to the Licensee, who accepts, the following\nrights over the Software for any or all use, and for the term of the\nAgreement, on the basis of the terms and conditions set forth hereinafter.\n\nBesides, if the Licensor owns or comes to own one or more patents\nprotecting all or part of the functions of the Software or of its\ncomponents, the Licensor undertakes not to enforce the rights granted by\nthese patents against successive Licensees using, exploiting or\nmodifying the Software. If these patents are transferred, the Licensor\nundertakes to have the transferees subscribe to the obligations set\nforth in this paragraph.\n\n\n      5.1 RIGHT OF USE\n\nThe Licensee is authorized to use the Software, without any limitation\nas to its fields of application, with it being hereinafter specified\nthat this comprises:\n\n   1. permanent or temporary reproduction of all or part of the Software\n      by any or all means and in any or all form.\n\n   2. loading, displaying, running, or storing the Software on any or\n      all medium.\n\n   3. entitlement to observe, study or test its operation so as to\n      determine the ideas and principles behind any or all constituent\n      elements of said Software. This shall apply when the Licensee\n      carries out any or all loading, displaying, running, transmission\n      or storage operation as regards the Software, that it is entitled\n      to carry out hereunder.\n\n\n      5.2 RIGHT OF MODIFICATION\n\nThe right of modification includes the right to translate, adapt,\narrange, or make any or all modifications to the Software, and the right\nto reproduce the resulting software. It includes, in particular, the\nright to create a Derivative Software.\n\nThe Licensee is authorized to make any or all modification to the\nSoftware provided that it includes an explicit notice that it is the\nauthor of said modification and indicates the date of the creation thereof.\n\n\n      5.3 RIGHT OF DISTRIBUTION\n\nIn particular, the right of distribution includes the right to publish,\ntransmit and communicate the Software to the general public on any or\nall medium, and by any or all means, and the right to market, either in\nconsideration of a fee, or free of charge, one or more copies of the\nSoftware by any means.\n\nThe Licensee is further authorized to distribute copies of the modified\nor unmodified Software to third parties according to the terms and\nconditions set forth hereinafter.\n\n\n        5.3.1 DISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\nThe Licensee is authorized to distribute true copies of the Software in\nSource Code or Object Code form, provided that said distribution\ncomplies with all the provisions of the Agreement and is accompanied by:\n\n   1. a copy of the Agreement,\n\n   2. a notice relating to the limitation of both the Licensor's\n      warranty and liability as set forth in Articles 8 and 9,\n\nand that, in the event that only the Object Code of the Software is\nredistributed, the Licensee allows effective access to the full Source\nCode of the Software at a minimum during the entire period of its\ndistribution of the Software, it being understood that the additional\ncost of acquiring the Source Code shall not exceed the cost of\ntransferring the data.\n\n\n        5.3.2 DISTRIBUTION OF MODIFIED SOFTWARE\n\nWhen the Licensee makes an Integrated Contribution to the Software, the\nterms and conditions for the distribution of the resulting Modified\nSoftware become subject to all the provisions of this Agreement.\n\nThe Licensee is authorized to distribute the Modified Software, in\nsource code or object code form, provided that said distribution\ncomplies with all the provisions of the Agreement and is accompanied by:\n\n   1. a copy of the Agreement,\n\n   2. a notice relating to the limitation of both the Licensor's\n      warranty and liability as set forth in Articles 8 and 9,\n\nand that, in the event that only the object code of the Modified\nSoftware is redistributed, the Licensee allows effective access to the\nfull source code of the Modified Software at a minimum during the entire\nperiod of its distribution of the Modified Software, it being understood\nthat the additional cost of acquiring the source code shall not exceed\nthe cost of transferring the data.\n\n\n        5.3.3 DISTRIBUTION OF DERIVATIVE SOFTWARE\n\nWhen the Licensee creates Derivative Software, this Derivative Software\nmay be distributed under a license agreement other than this Agreement,\nsubject to compliance with the requirement to include a notice\nconcerning the rights over the Software as defined in Article 6.4.\nIn the event the creation of the Derivative Software required modification\nof the Source Code, the Licensee undertakes that:\n\n   1. the resulting Modified Software will be governed by this Agreement,\n   2. the Integrated Contributions in the resulting Modified Software\n      will be clearly identified and documented,\n   3. the Licensee will allow effective access to the source code of the\n      Modified Software, at a minimum during the entire period of\n      distribution of the Derivative Software, such that such\n      modifications may be carried over in a subsequent version of the\n      Software; it being understood that the additional cost of\n      purchasing the source code of the Modified Software shall not\n      exceed the cost of transferring the data.\n\n\n        5.3.4 COMPATIBILITY WITH THE CeCILL LICENSE\n\nWhen a Modified Software contains an Integrated Contribution subject to\nthe CeCILL license agreement, or when a Derivative Software contains a\nRelated Module subject to the CeCILL license agreement, the provisions\nset forth in the third item of Article 6.4 are optional.\n\n\n    Article 6 - INTELLECTUAL PROPERTY\n\n\n      6.1 OVER THE INITIAL SOFTWARE\n\nThe Holder owns the economic rights over the Initial Software. Any or\nall use of the Initial Software is subject to compliance with the terms\nand conditions under which the Holder has elected to distribute its work\nand no one shall be entitled to modify the terms and conditions for the\ndistribution of said Initial Software.\n\nThe Holder undertakes that the Initial Software will remain ruled at\nleast by this Agreement, for the duration set forth in Article 4.2.\n\n\n      6.2 OVER THE INTEGRATED CONTRIBUTIONS\n\nThe Licensee who develops an Integrated Contribution is the owner of the\nintellectual property rights over this Contribution as defined by\napplicable law.\n\n\n      6.3 OVER THE RELATED MODULES\n\nThe Licensee who develops a Related Module is the owner of the\nintellectual property rights over this Related Module as defined by\napplicable law and is free to choose the type of agreement that shall\ngovern its distribution under the conditions defined in Article 5.3.3.\n\n\n      6.4 NOTICE OF RIGHTS\n\nThe Licensee expressly undertakes:\n\n   1. not to remove, or modify, in any manner, the intellectual property\n      notices attached to the Software;\n\n   2. to reproduce said notices, in an identical manner, in the copies\n      of the Software modified or not;\n\n   3. to ensure that use of the Software, its intellectual property\n      notices and the fact that it is governed by the Agreement is\n      indicated in a text that is easily accessible, specifically from\n      the interface of any Derivative Software.\n\nThe Licensee undertakes not to directly or indirectly infringe the\nintellectual property rights of the Holder and/or Contributors on the\nSoftware and to take, where applicable, vis-à-vis its staff, any and all\nmeasures required to ensure respect of said intellectual property rights\nof the Holder and/or Contributors.\n\n\n    Article 7 - RELATED SERVICES\n\n7.1 Under no circumstances shall the Agreement oblige the Licensor to\nprovide technical assistance or maintenance services for the Software.\n\nHowever, the Licensor is entitled to offer this type of services. The\nterms and conditions of such technical assistance, and/or such\nmaintenance, shall be set forth in a separate instrument. Only the\nLicensor offering said maintenance and/or technical assistance services\nshall incur liability therefor.\n\n7.2 Similarly, any Licensor is entitled to offer to its licensees, under\nits sole responsibility, a warranty, that shall only be binding upon\nitself, for the redistribution of the Software and/or the Modified\nSoftware, under terms and conditions that it is free to decide. Said\nwarranty, and the financial terms and conditions of its application,\nshall be subject of a separate instrument executed between the Licensor\nand the Licensee.\n\n\n    Article 8 - LIABILITY\n\n8.1 Subject to the provisions of Article 8.2, the Licensee shall be\nentitled to claim compensation for any direct loss it may have suffered\nfrom the Software as a result of a fault on the part of the relevant\nLicensor, subject to providing evidence thereof.\n\n8.2 The Licensor's liability is limited to the commitments made under\nthis Agreement and shall not be incurred as a result of in particular:\n(i) loss due the Licensee's total or partial failure to fulfill its\nobligations, (ii) direct or consequential loss that is suffered by the\nLicensee due to the use or performance of the Software, and (iii) more\ngenerally, any consequential loss. In particular the Parties expressly\nagree that any or all pecuniary or business loss (i.e. loss of data,\nloss of profits, operating loss, loss of customers or orders,\nopportunity cost, any disturbance to business activities) or any or all\nlegal proceedings instituted against the Licensee by a third party,\nshall constitute consequential loss and shall not provide entitlement to\nany or all compensation from the Licensor.\n\n\n    Article 9 - WARRANTY\n\n9.1 The Licensee acknowledges that the scientific and technical\nstate-of-the-art when the Software was distributed did not enable all\npossible uses to be tested and verified, nor for the presence of\npossible defects to be detected. In this respect, the Licensee's\nattention has been drawn to the risks associated with loading, using,\nmodifying and/or developing and reproducing the Software which are\nreserved for experienced users.\n\nThe Licensee shall be responsible for verifying, by any or all means,\nthe suitability of the product for its requirements, its good working\norder, and for ensuring that it shall not cause damage to either persons\nor properties.\n\n9.2 The Licensor hereby represents, in good faith, that it is entitled\nto grant all the rights over the Software (including in particular the\nrights set forth in Article 5).\n\n9.3 The Licensee acknowledges that the Software is supplied \"as is\" by\nthe Licensor without any other express or tacit warranty, other than\nthat provided for in Article 9.2 and, in particular, without any warranty\nas to its commercial value, its secured, safe, innovative or relevant\nnature.\n\nSpecifically, the Licensor does not warrant that the Software is free\nfrom any error, that it will operate without interruption, that it will\nbe compatible with the Licensee's own equipment and software\nconfiguration, nor that it will meet the Licensee's requirements.\n\n9.4 The Licensor does not either expressly or tacitly warrant that the\nSoftware does not infringe any third party intellectual property right\nrelating to a patent, software or any other property right. Therefore,\nthe Licensor disclaims any and all liability towards the Licensee\narising out of any or all proceedings for infringement that may be\ninstituted in respect of the use, modification and redistribution of the\nSoftware. Nevertheless, should such proceedings be instituted against\nthe Licensee, the Licensor shall provide it with technical and legal\nassistance for its defense. Such technical and legal assistance shall be\ndecided on a case-by-case basis between the relevant Licensor and the\nLicensee pursuant to a memorandum of understanding. The Licensor\ndisclaims any and all liability as regards the Licensee's use of the\nname of the Software. No warranty is given as regards the existence of\nprior rights over the name of the Software or as regards the existence\nof a trademark.\n\n\n    Article 10 - TERMINATION\n\n10.1 In the event of a breach by the Licensee of its obligations\nhereunder, the Licensor may automatically terminate this Agreement\nthirty (30) days after notice has been sent to the Licensee and has\nremained ineffective.\n\n10.2 A Licensee whose Agreement is terminated shall no longer be\nauthorized to use, modify or distribute the Software. However, any\nlicenses that it may have granted prior to termination of the Agreement\nshall remain valid subject to their having been granted in compliance\nwith the terms and conditions hereof.\n\n\n    Article 11 - MISCELLANEOUS\n\n\n      11.1 EXCUSABLE EVENTS\n\nNeither Party shall be liable for any or all delay, or failure to\nperform the Agreement, that may be attributable to an event of force\nmajeure, an act of God or an outside cause, such as defective\nfunctioning or interruptions of the electricity or telecommunications\nnetworks, network paralysis following a virus attack, intervention by\ngovernment authorities, natural disasters, water damage, earthquakes,\nfire, explosions, strikes and labor unrest, war, etc.\n\n11.2 Any failure by either Party, on one or more occasions, to invoke\none or more of the provisions hereof, shall under no circumstances be\ninterpreted as being a waiver by the interested Party of its right to\ninvoke said provision(s) subsequently.\n\n11.3 The Agreement cancels and replaces any or all previous agreements,\nwhether written or oral, between the Parties and having the same\npurpose, and constitutes the entirety of the agreement between said\nParties concerning said purpose. No supplement or modification to the\nterms and conditions hereof shall be effective as between the Parties\nunless it is made in writing and signed by their duly authorized\nrepresentatives.\n\n11.4 In the event that one or more of the provisions hereof were to\nconflict with a current or future applicable act or legislative text,\nsaid act or legislative text shall prevail, and the Parties shall make\nthe necessary amendments so as to comply with said act or legislative\ntext. All other provisions shall remain effective. Similarly, invalidity\nof a provision of the Agreement, for any reason whatsoever, shall not\ncause the Agreement as a whole to be invalid.\n\n\n      11.5 LANGUAGE\n\nThe Agreement is drafted in both French and English and both versions\nare deemed authentic.\n\n\n    Article 12 - NEW VERSIONS OF THE AGREEMENT\n\n12.1 Any person is authorized to duplicate and distribute copies of this\nAgreement.\n\n12.2 So as to ensure coherence, the wording of this Agreement is\nprotected and may only be modified by the authors of the License, who\nreserve the right to periodically publish updates or new versions of the\nAgreement, each with a separate number. These subsequent versions may\naddress new issues encountered by Free Software.\n\n12.3 Any Software distributed under a given version of the Agreement may\nonly be subsequently distributed under the same version of the Agreement\nor a subsequent version.\n\n\n    Article 13 - GOVERNING LAW AND JURISDICTION\n\n13.1 The Agreement is governed by French law. The Parties agree to\nendeavor to seek an amicable solution to any disagreements or disputes\nthat may arise during the performance of the Agreement.\n\n13.2 Failing an amicable solution within two (2) months as from their\noccurrence, and unless emergency proceedings are necessary, the\ndisagreements or disputes shall be referred to the Paris Courts having\njurisdiction, by the more diligent Party.\n\n\nVersion 1.0 dated 2006-09-05.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>\nCeCILL-C FREE SOFTWARE LICENSE AGREEMENT\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>\nNotice\n      </p>\n\n         <p>\nThis Agreement is a Free Software license agreement that is the result of discussions between its authors in order to ensure compliance with the two main principles guiding its drafting:\n      </p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> *</var>\n\nfirstly, compliance with the principles governing the distribution of Free Software: access to source code, broad rights granted to users,\n\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> *</var>\n\nsecondly, the election of a governing law, French law, with which it is conformant, both as regards the law of torts and intellectual property law, and the protection that it offers to both authors and holders of the economic rights over software.\n\n        </li>\n         \n</ul>\n         <p>\nThe authors of the <var class=\"replaceable-license-text\"> CeCILL¹</var> license are:\n      </p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <p>\nCommissariat à l&apos;Energie Atomique - CEA, a public scientific, technical and industrial research establishment, having its principal place of business at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n          </p>\n\n            </li>\n            \n<li>\n               <p>\nCentre National de la Recherche Scientifique - CNRS, a public scientific and technological establishment, having its principal place of business at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n          </p>\n\n            </li>\n            \n<li>\n               <p>\nInstitut National de Recherche en Informatique et en Automatique - INRIA, a public scientific and technological establishment, having its principal place of business at Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le Chesnay cedex, France.\n          </p>\n\n            </li>\n         \n</ul>\n      </div>\n      \n<ul style=\"list-style:none\">\n         \n<li>\n            <var class=\"replaceable-license-text\"> Preamble</var>\n\nThe purpose of this Free Software license agreement is to grant users the right to modify and re-use the software governed by this license.\n\n          <p>\nThe exercising of this right is conditional upon the obligation to make available to the community the modifications made to the source code of the software so as to contribute to its evolution.\n          </p>\n\n            <p>\nIn consideration of access to the source code and the rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software&apos;s author, the holder of the economic rights, and the successive licensors only have limited liability.\n          </p>\n\n            <p>\nIn this respect, the risks associated with loading, using, modifying and/or developing or reproducing the software by the user are brought to the user&apos;s attention, given its Free Software status, which may make it complicated to use, with the result that its use is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the suitability of the software as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions of security. This Agreement may be freely reproduced and published, provided it is not altered, and that no provisions are either added or removed herefrom.\n          </p>\n\n            <p>\nThis Agreement may apply to any or all software for which the holder of the economic rights decides to submit the use thereof to its provisions.\n          </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 1 -</var>\n\n        DEFINITIONS\n\n      <p>\nFor the purpose of this Agreement, when the following expressions commence with a capital letter, they shall have the following meaning:\n      </p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <p>\nAgreement: means this license agreement, and its possible subsequent versions and annexes.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nSoftware: means the software in its Object Code and/or Source Code form and, where applicable, its documentation, &quot;as is&quot; when the Licensee accepts the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nInitial Software: means the Software in its Source Code and possibly its Object Code form and, where applicable, its documentation, &quot;as is&quot; when it is first distributed under the terms and conditions of the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nModified Software: means the Software modified by at least one Integrated Contribution.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nSource Code: means all the Software&apos;s instructions and program lines to which access is required so as to modify the Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nObject Code: means the binary files originating from the compilation of the Source Code.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nHolder: means the holder(s) of the economic rights over the Initial Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nLicensee: means the Software user(s) having accepted the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nContributor: means a Licensee having made at least one Integrated Contribution.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nLicensor: means the Holder, or any other individual or legal entity, who distributes the Software under the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nIntegrated Contribution: means any or all modifications, corrections, translations, adaptations and/or new functions integrated into the Source Code by any or all Contributors.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nRelated Module: means a set of sources files including their documentation that, without modification to the Source Code, enables supplementary functions or services in addition to those offered by the Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nDerivative Software: means any combination of the Software, modified or not, and of a Related Module.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nParties: mean both the Licensee and the Licensor.\n          </p>\n\n               </li>\n            \n</ul>\n            <p>\nThese expressions may be used both in singular and plural form.\n      </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 2 -</var>\n\nPURPOSE\n\n      <p>\nThe purpose of the Agreement is the grant by the Licensor to the Licensee of a non-exclusive, transferable and worldwide license for the Software as set forth in Article 5 hereinafter for the whole term of the protection granted by the rights over said Software.\n      </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 3 -</var>\n\nACCEPTANCE\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.1</var>\n\nThe Licensee shall be deemed as having accepted the terms and conditions of this Agreement upon the occurrence of the first of the following events:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (i)</var>\n\nloading the Software by any or all means, notably, by downloading from a remote server, or by loading from a physical medium;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (ii)</var>\n\nthe first time the Licensee exercises any of the rights granted hereunder.\n\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.2</var>\n\nOne copy of the Agreement, containing a notice relating to the characteristics of the Software, to the limited warranty, and to the fact that its use is restricted to experienced users has been provided to the Licensee prior to its acceptance as set forth in Article 3.1 hereinabove, and the Licensee hereby acknowledges that it has read and understood it.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 4 -</var>\n\nEFFECTIVE DATE AND TERM\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 4.1</var>\n\nEFFECTIVE DATE\n\n          <p>\nThe Agreement shall become effective on the date when it is accepted by the Licensee as set forth in Article 3.1.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 4.2</var>\n\nTERM\n\n          <p>\nThe Agreement shall remain in force for the entire legal term of protection of the economic rights over the Software.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 5 -</var>\n\nSCOPE OF RIGHTS GRANTED\n\n      <p>\nThe Licensor hereby grants to the Licensee, who accepts, the following rights over the Software for any or all use, and for the term of the Agreement, on the basis of the terms and conditions set forth hereinafter.\n      </p>\n\n            <p>\nBesides, if the Licensor owns or comes to own one or more patents protecting all or part of the functions of the Software or of its components, the Licensor undertakes not to enforce the rights granted by these patents against successive Licensees using, exploiting or modifying the Software. If these patents are transferred, the Licensor undertakes to have the transferees subscribe to the obligations set forth in this paragraph.\n      </p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.1</var>\n\nRIGHT OF USE\n\n          <p>\nThe Licensee is authorized to use the Software, without any limitation as to its fields of application, with it being hereinafter specified that this comprises:\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 1.</var>\n\npermanent or temporary reproduction of all or part of the Software by any or all means and in any or all form.\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 2.</var>\n\nloading, displaying, running, or storing the Software on any or all medium.\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 3.</var>\n\nentitlement to observe, study or test its operation so as to determine the ideas and principles behind any or all constituent elements of said Software. This shall apply when the Licensee carries out any or all loading, displaying, running, transmission or storage operation as regards the Software, that it is entitled to carry out hereunder.\n\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.2</var>\n\nRIGHT OF MODIFICATION\n\n          <p>\nThe right of modification includes the right to translate, adapt, arrange, or make any or all modifications to the Software, and the right to reproduce the resulting software. It includes, in particular, the right to create a Derivative Software.\n          </p>\n\n                  <p>\nThe Licensee is authorized to make any or all modification to the Software provided that it includes an explicit notice that it is the author of said modification and indicates the date of the creation thereof.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.3</var>\n\nRIGHT OF DISTRIBUTION\n\n          <p>\nIn particular, the right of distribution includes the right to publish, transmit and communicate the Software to the general public on any or all medium, and by any or all means, and the right to market, either in consideration of a fee, or free of charge, one or more copies of the Software by any means.\n          </p>\n\n                  <p>\nThe Licensee is further authorized to distribute copies of the modified or unmodified Software to third parties according to the terms and conditions set forth hereinafter.\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.1.</var>\n\nDISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\n              <p>\nThe Licensee is authorized to distribute true copies of the Software in Source Code or Object Code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n              </p>\n\n<ul style=\"list-style:none\">\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 1.</var>\n\na copy of the Agreement,\n\n              </li>\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 2.</var>\n\na notice relating to the limitation of both the Licensor&apos;s warranty and liability as set forth in Articles 8 and 9,\n\n              </li>\n                        \n</ul>\n                        <p>\nand that, in the event that only the Object Code of the Software is redistributed, the Licensee allows effective access to the full Source Code of the Software at a minimum during the entire period of its distribution of the Software, it being understood that the additional cost of acquiring the Source Code shall not exceed the cost of transferring the data.\n            </p>\n\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.2.</var>\n\nDISTRIBUTION OF MODIFIED SOFTWARE\n\n            <p>\nWhen the Licensee makes an Integrated Contribution to the Software, the terms and conditions for the distribution of the resulting Modified Software become subject to all the provisions of this Agreement.\n            </p>\n\n                        <p>\nThe Licensee is authorized to distribute the Modified Software, in source code or object code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n            </p>\n\n<ul style=\"list-style:none\">\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 1.</var>\n\na copy of the Agreement,\n\n            </li>\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 2.</var>\n\na notice relating to the limitation of both the Licensor&apos;s warranty and liability as set forth in Articles 8 and 9,\n\n            </li>\n                        \n</ul>\n                        <p>\nand that, in the event that only the object code of the Modified Software is redistributed, the Licensee allows effective access to the full source code of the Modified Software at a minimum during the entire period of its distribution of the Modified Software, it being understood that the additional cost of acquiring the source code shall not exceed the cost of transferring the data.\n          </p>\n\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.3.</var>\n\nDISTRIBUTION OF DERIVATIVE SOFTWARE\n\n          <p>\nWhen the Licensee creates Derivative Software, this Derivative Software may be distributed under a license agreement other than this Agreement, subject to compliance with the requirement to include a notice concerning the rights over the Software as defined in Article 6.4.  In the event the creation of the Derivative Software required modification of the Source Code, the Licensee undertakes that:\n          </p>\n\n<ul style=\"list-style:none\">\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 1.</var>\n\nthe resulting Modified Software will be governed by this Agreement,\n\n\t    </li>\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 2.</var>\n\nthe Integrated Contributions in the resulting Modified Software will be clearly identified and documented,\n\n\t    </li>\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 3.</var>\n\nthe Licensee will allow effective access to the source code of the Modified Software, at a minimum during the entire period of distribution of the Derivative Software, such that such modifications may be carried over in a subsequent version of the Software; it being understood that the additional cost of purchasing the source code of the Modified Software shall not exceed the cost of transferring the data.\n\n\t    </li>\n\t                       \n</ul>\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.4.</var>\n\nCOMPATIBILITY WITH THE CeCILL LICENSE\n\n            <p>\nWhen a Modified Software contains an Integrated Contribution subject to the CeCILL license agreement, or when a Derivative Software contains a Related Module subject to the CeCILL license agreement, the provisions set forth in the third item of Article 6.4 are optional.\n            </p>\n\n                     </li>\n                  \n</ul>\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 6 -</var>\n\nINTELLECTUAL PROPERTY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.1</var>\n\nOVER THE INITIAL SOFTWARE\n\n          <p>\nThe Holder owns the economic rights over the Initial Software. Any or all use of the Initial Software is subject to compliance with the terms and conditions under which the Holder has elected to distribute its work and no one shall be entitled to modify the terms and conditions for the distribution of said Initial Software.\n          </p>\n\n                  <p>\nThe Holder undertakes that the Initial Software will remain ruled at least by this Agreement, for the duration set forth in Article 4.2.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.2</var>\n\nOVER THE INTEGRATED CONTRIBUTIONS\n\n          <p>\nThe Licensee who develops an Integrated Contribution is the owner of the intellectual property rights over this Contribution as defined by applicable law.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.3</var>\n\nOVER THE RELATED MODULES\n\n          <p>\nThe Licensee who develops a Related Module is the owner of the intellectual property rights over this Related Module as defined by applicable law and is free to choose the type of agreement that shall govern its distribution under the conditions defined in Article 5.3.3.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.4</var>\n\nNOTICE OF RIGHTS\n\n          <p>\nThe Licensee expressly undertakes:\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 1.</var>\n\nnot to remove, or modify, in any manner, the intellectual property notices attached to the Software;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 2.</var>\n\nto reproduce said notices, in an identical manner, in the copies of the Software modified or not;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 3.</var>\n\nto ensure that use of the Software, its intellectual property notices and the fact that it is governed by the Agreement is indicated in a text that is easily accessible, specifically from the interface of any Derivative Software.\n\n            </li>\n                  \n</ul>\n                  <p>\nThe Licensee undertakes not to directly or indirectly infringe the intellectual property rights of the Holder and/or Contributors on the Software and to take, where applicable, vis-à-vis its staff, any and all measures required to ensure respect of said intellectual property rights of the Holder and/or Contributors.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 7 -</var>\n\nRELATED SERVICES\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 7.1</var>\n\nUnder no circumstances shall the Agreement oblige the Licensor to provide technical assistance or maintenance services for the Software.\n\n          <p>\nHowever, the Licensor is entitled to offer this type of services. The terms and conditions of such technical assistance, and/or such maintenance, shall be set forth in a separate instrument. Only the Licensor offering said maintenance and/or technical assistance services shall incur liability therefor.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 7.2</var>\n\nSimilarly, any Licensor is entitled to offer to its licensees, under its sole responsibility, a warranty, that shall only be binding upon itself, for the redistribution of the Software and/or the Modified Software, under terms and conditions that it is free to decide. Said warranty, and the financial terms and conditions of its application, shall be subject of a separate instrument executed between the Licensor and the Licensee.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 8 -</var>\n\nLIABILITY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.1</var>\n\nSubject to the provisions of Article 8.2, the Licensee shall be entitled to claim compensation for any direct loss it may have suffered from the Software as a result of a fault on the part of the relevant Licensor, subject to providing evidence thereof.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.2</var>\n\nThe Licensor&apos;s liability is limited to the commitments made under this Agreement and shall not be incurred as a result of in particular: (i) loss due the Licensee&apos;s total or partial failure to fulfill its obligations, (ii) direct or consequential loss that is suffered by the Licensee due to the use or performance of the Software, and (iii) more generally, any consequential loss. In particular the Parties expressly agree that any or all pecuniary or business loss (i.e. loss of data, loss of profits, operating loss, loss of customers or orders, opportunity cost, any disturbance to business activities) or any or all legal proceedings instituted against the Licensee by a third party, shall constitute consequential loss and shall not provide entitlement to any or all compensation from the Licensor.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 9 -</var>\n\nWARRANTY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.1</var>\n\nThe Licensee acknowledges that the scientific and technical state-of-the-art when the Software was distributed did not enable all possible uses to be tested and verified, nor for the presence of possible defects to be detected. In this respect, the Licensee&apos;s attention has been drawn to the risks associated with loading, using, modifying and/or developing and reproducing the Software which are reserved for experienced users.\n\n          <p>\nThe Licensee shall be responsible for verifying, by any or all means, the suitability of the product for its requirements, its good working order, and for ensuring that it shall not cause damage to either persons or properties.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.2</var>\n\nThe Licensor hereby represents, in good faith, that it is entitled to grant all the rights over the Software (including in particular the rights set forth in Article 5).\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.3</var>\n\nThe Licensee acknowledges that the Software is supplied &quot;as is&quot; by the Licensor without any other express or tacit warranty, other than that provided for in Article 9.2 and, in particular, without any warranty as to its commercial value, its secured, safe, innovative or relevant nature.\n\n          <p>\nSpecifically, the Licensor does not warrant that the Software is free from any error, that it will operate without interruption, that it will be compatible with the Licensee&apos;s own equipment and software configuration, nor that it will meet the Licensee&apos;s requirements.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.4</var>\n\nThe Licensor does not either expressly or tacitly warrant that the Software does not infringe any third party intellectual property right relating to a patent, software or any other property right. Therefore, the Licensor disclaims any and all liability towards the Licensee arising out of any or all proceedings for infringement that may be instituted in respect of the use, modification and redistribution of the Software. Nevertheless, should such proceedings be instituted against the Licensee, the Licensor shall provide it with technical and legal assistance for its defense. Such technical and legal assistance shall be decided on a case-by-case basis between the relevant Licensor and the Licensee pursuant to a memorandum of understanding. The Licensor disclaims any and all liability as regards the Licensee&apos;s use of the name of the Software. No warranty is given as regards the existence of prior rights over the name of the Software or as regards the existence of a trademark.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 10 -</var>\n\nTERMINATION\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 10.1</var>\n\nIn the event of a breach by the Licensee of its obligations hereunder, the Licensor may automatically terminate this Agreement thirty (30) days after notice has been sent to the Licensee and has remained ineffective.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 10.2</var>\n\nA Licensee whose Agreement is terminated shall no longer be authorized to use, modify or distribute the Software. However, any licenses that it may have granted prior to termination of the Agreement shall remain valid subject to their having been granted in compliance with the terms and conditions hereof.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 11 -</var>\n\nMISCELLANEOUS\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.1</var>\n\nEXCUSABLE EVENTS\n\n          <p>\nNeither Party shall be liable for any or all delay, or failure to perform the Agreement, that may be attributable to an event of force majeure, an act of God or an outside cause, such as defective functioning or interruptions of the electricity or telecommunications networks, network paralysis following a virus attack, intervention by government authorities, natural disasters, water damage, earthquakes, fire, explosions, strikes and labor unrest, war, etc.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.2</var>\n\nAny failure by either Party, on one or more occasions, to invoke one or more of the provisions hereof, shall under no circumstances be interpreted as being a waiver by the interested Party of its right to invoke said provision(s) subsequently.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.3</var>\n\nThe Agreement cancels and replaces any or all previous agreements, whether written or oral, between the Parties and having the same purpose, and constitutes the entirety of the agreement between said Parties concerning said purpose. No supplement or modification to the terms and conditions hereof shall be effective as between the Parties unless it is made in writing and signed by their duly authorized representatives.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.4</var>\n\nIn the event that one or more of the provisions hereof were to conflict with a current or future applicable act or legislative text, said act or legislative text shall prevail, and the Parties shall make the necessary amendments so as to comply with said act or legislative text. All other provisions shall remain effective. Similarly, invalidity of a provision of the Agreement, for any reason whatsoever, shall not cause the Agreement as a whole to be invalid.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.5</var>\n\nLANGUAGE\n\n          <p>\nThe Agreement is drafted in both French and English and both versions are deemed authentic.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 12 -</var>\n\nNEW VERSIONS OF THE AGREEMENT\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.1</var>\n\nAny person is authorized to duplicate and distribute copies of this Agreement.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.2</var>\n\nSo as to ensure coherence, the wording of this Agreement is protected and may only be modified by the authors of the License, who reserve the right to periodically publish updates or new versions of the Agreement, each with a separate number. These subsequent versions may address new issues encountered by Free Software.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.3</var>\n\nAny Software distributed under a given version of the Agreement may only be subsequently distributed under the same version of the Agreement or a subsequent version.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 13 -</var>\n\nGOVERNING LAW AND JURISDICTION\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 13.1</var>\n\nThe Agreement is governed by French law. The Parties agree to endeavor to seek an amicable solution to any disagreements or disputes that may arise during the performance of the Agreement.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 13.2</var>\n\nFailing an amicable solution within two (2) months as from their occurrence, and unless emergency proceedings are necessary, the disagreements or disputes shall be referred to the Paris Courts having jurisdiction, by the more diligent Party.\n\n        </li>\n            \n</ul>\n         </li>\n      \n</ul>\n      <p>\nVersion 1.0 dated 2006-09-05.\n  </p>\n\n  <var class=\"optional-license-text\"> 1 CeCILL stands for Ce(a) C(nrs) I(nria) L(ogiciel) L(ibre)</var>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"tag":"LicenseUrl"},{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:00:59Z","url":"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":false,"licenseComments":"French version can be found here: http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html","licenseId":"spdx:CECILL-C","licenseText":"\nCeCILL-C FREE SOFTWARE LICENSE AGREEMENT\n\n\n    Notice\n\nThis Agreement is a Free Software license agreement that is the result\nof discussions between its authors in order to ensure compliance with\nthe two main principles guiding its drafting:\n\n    * firstly, compliance with the principles governing the distribution\n      of Free Software: access to source code, broad rights granted to\n      users,\n    * secondly, the election of a governing law, French law, with which\n      it is conformant, both as regards the law of torts and\n      intellectual property law, and the protection that it offers to\n      both authors and holders of the economic rights over software.\n\nThe authors of the CeCILL-C (for Ce[a] C[nrs] I[nria] L[ogiciel] L[ibre])\nlicense are:\n\nCommissariat à l'Energie Atomique - CEA, a public scientific, technical\nand industrial research establishment, having its principal place of\nbusiness at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n\nCentre National de la Recherche Scientifique - CNRS, a public scientific\nand technological establishment, having its principal place of business\nat 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n\nInstitut National de Recherche en Informatique et en Automatique -\nINRIA, a public scientific and technological establishment, having its\nprincipal place of business at Domaine de Voluceau, Rocquencourt, BP\n105, 78153 Le Chesnay cedex, France.\n\n\n    Preamble\n\nThe purpose of this Free Software license agreement is to grant users\nthe right to modify and re-use the software governed by this license.\n\nThe exercising of this right is conditional upon the obligation to make\navailable to the community the modifications made to the source code of\nthe software so as to contribute to its evolution.\n\nIn consideration of access to the source code and the rights to copy,\nmodify and redistribute granted by the license, users are provided only\nwith a limited warranty and the software's author, the holder of the\neconomic rights, and the successive licensors only have limited liability.\n\nIn this respect, the risks associated with loading, using, modifying\nand/or developing or reproducing the software by the user are brought to\nthe user's attention, given its Free Software status, which may make it\ncomplicated to use, with the result that its use is reserved for\ndevelopers and experienced professionals having in-depth computer\nknowledge. Users are therefore encouraged to load and test the\nsuitability of the software as regards their requirements in conditions\nenabling the security of their systems and/or data to be ensured and,\nmore generally, to use and operate it in the same conditions of\nsecurity. This Agreement may be freely reproduced and published,\nprovided it is not altered, and that no provisions are either added or\nremoved herefrom.\n\nThis Agreement may apply to any or all software for which the holder of\nthe economic rights decides to submit the use thereof to its provisions.\n\n\n    Article 1 - DEFINITIONS\n\nFor the purpose of this Agreement, when the following expressions\ncommence with a capital letter, they shall have the following meaning:\n\nAgreement: means this license agreement, and its possible subsequent\nversions and annexes.\n\nSoftware: means the software in its Object Code and/or Source Code form\nand, where applicable, its documentation, \"as is\" when the Licensee\naccepts the Agreement.\n\nInitial Software: means the Software in its Source Code and possibly its\nObject Code form and, where applicable, its documentation, \"as is\" when\nit is first distributed under the terms and conditions of the Agreement.\n\nModified Software: means the Software modified by at least one\nIntegrated Contribution.\n\nSource Code: means all the Software's instructions and program lines to\nwhich access is required so as to modify the Software.\n\nObject Code: means the binary files originating from the compilation of\nthe Source Code.\n\nHolder: means the holder(s) of the economic rights over the Initial\nSoftware.\n\nLicensee: means the Software user(s) having accepted the Agreement.\n\nContributor: means a Licensee having made at least one Integrated\nContribution.\n\nLicensor: means the Holder, or any other individual or legal entity, who\ndistributes the Software under the Agreement.\n\nIntegrated Contribution: means any or all modifications, corrections,\ntranslations, adaptations and/or new functions integrated into the\nSource Code by any or all Contributors.\n\nRelated Module: means a set of sources files including their\ndocumentation that, without modification to the Source Code, enables\nsupplementary functions or services in addition to those offered by the\nSoftware.\n\nDerivative Software: means any combination of the Software, modified or\nnot, and of a Related Module.\n\nParties: mean both the Licensee and the Licensor.\n\nThese expressions may be used both in singular and plural form.\n\n\n    Article 2 - PURPOSE\n\nThe purpose of the Agreement is the grant by the Licensor to the\nLicensee of a non-exclusive, transferable and worldwide license for the\nSoftware as set forth in Article 5 hereinafter for the whole term of the\nprotection granted by the rights over said Software.\n\n\n    Article 3 - ACCEPTANCE\n\n3.1 The Licensee shall be deemed as having accepted the terms and\nconditions of this Agreement upon the occurrence of the first of the\nfollowing events:\n\n    * (i) loading the Software by any or all means, notably, by\n      downloading from a remote server, or by loading from a physical\n      medium;\n    * (ii) the first time the Licensee exercises any of the rights\n      granted hereunder.\n\n3.2 One copy of the Agreement, containing a notice relating to the\ncharacteristics of the Software, to the limited warranty, and to the\nfact that its use is restricted to experienced users has been provided\nto the Licensee prior to its acceptance as set forth in Article 3.1\nhereinabove, and the Licensee hereby acknowledges that it has read and\nunderstood it.\n\n\n    Article 4 - EFFECTIVE DATE AND TERM\n\n\n      4.1 EFFECTIVE DATE\n\nThe Agreement shall become effective on the date when it is accepted by\nthe Licensee as set forth in Article 3.1.\n\n\n      4.2 TERM\n\nThe Agreement shall remain in force for the entire legal term of\nprotection of the economic rights over the Software.\n\n\n    Article 5 - SCOPE OF RIGHTS GRANTED\n\nThe Licensor hereby grants to the Licensee, who accepts, the following\nrights over the Software for any or all use, and for the term of the\nAgreement, on the basis of the terms and conditions set forth hereinafter.\n\nBesides, if the Licensor owns or comes to own one or more patents\nprotecting all or part of the functions of the Software or of its\ncomponents, the Licensor undertakes not to enforce the rights granted by\nthese patents against successive Licensees using, exploiting or\nmodifying the Software. If these patents are transferred, the Licensor\nundertakes to have the transferees subscribe to the obligations set\nforth in this paragraph.\n\n\n      5.1 RIGHT OF USE\n\nThe Licensee is authorized to use the Software, without any limitation\nas to its fields of application, with it being hereinafter specified\nthat this comprises:\n\n   1. permanent or temporary reproduction of all or part of the Software\n      by any or all means and in any or all form.\n\n   2. loading, displaying, running, or storing the Software on any or\n      all medium.\n\n   3. entitlement to observe, study or test its operation so as to\n      determine the ideas and principles behind any or all constituent\n      elements of said Software. This shall apply when the Licensee\n      carries out any or all loading, displaying, running, transmission\n      or storage operation as regards the Software, that it is entitled\n      to carry out hereunder.\n\n\n      5.2 RIGHT OF MODIFICATION\n\nThe right of modification includes the right to translate, adapt,\narrange, or make any or all modifications to the Software, and the right\nto reproduce the resulting software. It includes, in particular, the\nright to create a Derivative Software.\n\nThe Licensee is authorized to make any or all modification to the\nSoftware provided that it includes an explicit notice that it is the\nauthor of said modification and indicates the date of the creation thereof.\n\n\n      5.3 RIGHT OF DISTRIBUTION\n\nIn particular, the right of distribution includes the right to publish,\ntransmit and communicate the Software to the general public on any or\nall medium, and by any or all means, and the right to market, either in\nconsideration of a fee, or free of charge, one or more copies of the\nSoftware by any means.\n\nThe Licensee is further authorized to distribute copies of the modified\nor unmodified Software to third parties according to the terms and\nconditions set forth hereinafter.\n\n\n        5.3.1 DISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\nThe Licensee is authorized to distribute true copies of the Software in\nSource Code or Object Code form, provided that said distribution\ncomplies with all the provisions of the Agreement and is accompanied by:\n\n   1. a copy of the Agreement,\n\n   2. a notice relating to the limitation of both the Licensor's\n      warranty and liability as set forth in Articles 8 and 9,\n\nand that, in the event that only the Object Code of the Software is\nredistributed, the Licensee allows effective access to the full Source\nCode of the Software at a minimum during the entire period of its\ndistribution of the Software, it being understood that the additional\ncost of acquiring the Source Code shall not exceed the cost of\ntransferring the data.\n\n\n        5.3.2 DISTRIBUTION OF MODIFIED SOFTWARE\n\nWhen the Licensee makes an Integrated Contribution to the Software, the\nterms and conditions for the distribution of the resulting Modified\nSoftware become subject to all the provisions of this Agreement.\n\nThe Licensee is authorized to distribute the Modified Software, in\nsource code or object code form, provided that said distribution\ncomplies with all the provisions of the Agreement and is accompanied by:\n\n   1. a copy of the Agreement,\n\n   2. a notice relating to the limitation of both the Licensor's\n      warranty and liability as set forth in Articles 8 and 9,\n\nand that, in the event that only the object code of the Modified\nSoftware is redistributed, the Licensee allows effective access to the\nfull source code of the Modified Software at a minimum during the entire\nperiod of its distribution of the Modified Software, it being understood\nthat the additional cost of acquiring the source code shall not exceed\nthe cost of transferring the data.\n\n\n        5.3.3 DISTRIBUTION OF DERIVATIVE SOFTWARE\n\nWhen the Licensee creates Derivative Software, this Derivative Software\nmay be distributed under a license agreement other than this Agreement,\nsubject to compliance with the requirement to include a notice\nconcerning the rights over the Software as defined in Article 6.4.\nIn the event the creation of the Derivative Software required modification\nof the Source Code, the Licensee undertakes that:\n\n   1. the resulting Modified Software will be governed by this Agreement,\n   2. the Integrated Contributions in the resulting Modified Software\n      will be clearly identified and documented,\n   3. the Licensee will allow effective access to the source code of the\n      Modified Software, at a minimum during the entire period of\n      distribution of the Derivative Software, such that such\n      modifications may be carried over in a subsequent version of the\n      Software; it being understood that the additional cost of\n      purchasing the source code of the Modified Software shall not\n      exceed the cost of transferring the data.\n\n\n        5.3.4 COMPATIBILITY WITH THE CeCILL LICENSE\n\nWhen a Modified Software contains an Integrated Contribution subject to\nthe CeCILL license agreement, or when a Derivative Software contains a\nRelated Module subject to the CeCILL license agreement, the provisions\nset forth in the third item of Article 6.4 are optional.\n\n\n    Article 6 - INTELLECTUAL PROPERTY\n\n\n      6.1 OVER THE INITIAL SOFTWARE\n\nThe Holder owns the economic rights over the Initial Software. Any or\nall use of the Initial Software is subject to compliance with the terms\nand conditions under which the Holder has elected to distribute its work\nand no one shall be entitled to modify the terms and conditions for the\ndistribution of said Initial Software.\n\nThe Holder undertakes that the Initial Software will remain ruled at\nleast by this Agreement, for the duration set forth in Article 4.2.\n\n\n      6.2 OVER THE INTEGRATED CONTRIBUTIONS\n\nThe Licensee who develops an Integrated Contribution is the owner of the\nintellectual property rights over this Contribution as defined by\napplicable law.\n\n\n      6.3 OVER THE RELATED MODULES\n\nThe Licensee who develops a Related Module is the owner of the\nintellectual property rights over this Related Module as defined by\napplicable law and is free to choose the type of agreement that shall\ngovern its distribution under the conditions defined in Article 5.3.3.\n\n\n      6.4 NOTICE OF RIGHTS\n\nThe Licensee expressly undertakes:\n\n   1. not to remove, or modify, in any manner, the intellectual property\n      notices attached to the Software;\n\n   2. to reproduce said notices, in an identical manner, in the copies\n      of the Software modified or not;\n\n   3. to ensure that use of the Software, its intellectual property\n      notices and the fact that it is governed by the Agreement is\n      indicated in a text that is easily accessible, specifically from\n      the interface of any Derivative Software.\n\nThe Licensee undertakes not to directly or indirectly infringe the\nintellectual property rights of the Holder and/or Contributors on the\nSoftware and to take, where applicable, vis-à-vis its staff, any and all\nmeasures required to ensure respect of said intellectual property rights\nof the Holder and/or Contributors.\n\n\n    Article 7 - RELATED SERVICES\n\n7.1 Under no circumstances shall the Agreement oblige the Licensor to\nprovide technical assistance or maintenance services for the Software.\n\nHowever, the Licensor is entitled to offer this type of services. The\nterms and conditions of such technical assistance, and/or such\nmaintenance, shall be set forth in a separate instrument. Only the\nLicensor offering said maintenance and/or technical assistance services\nshall incur liability therefor.\n\n7.2 Similarly, any Licensor is entitled to offer to its licensees, under\nits sole responsibility, a warranty, that shall only be binding upon\nitself, for the redistribution of the Software and/or the Modified\nSoftware, under terms and conditions that it is free to decide. Said\nwarranty, and the financial terms and conditions of its application,\nshall be subject of a separate instrument executed between the Licensor\nand the Licensee.\n\n\n    Article 8 - LIABILITY\n\n8.1 Subject to the provisions of Article 8.2, the Licensee shall be\nentitled to claim compensation for any direct loss it may have suffered\nfrom the Software as a result of a fault on the part of the relevant\nLicensor, subject to providing evidence thereof.\n\n8.2 The Licensor's liability is limited to the commitments made under\nthis Agreement and shall not be incurred as a result of in particular:\n(i) loss due the Licensee's total or partial failure to fulfill its\nobligations, (ii) direct or consequential loss that is suffered by the\nLicensee due to the use or performance of the Software, and (iii) more\ngenerally, any consequential loss. In particular the Parties expressly\nagree that any or all pecuniary or business loss (i.e. loss of data,\nloss of profits, operating loss, loss of customers or orders,\nopportunity cost, any disturbance to business activities) or any or all\nlegal proceedings instituted against the Licensee by a third party,\nshall constitute consequential loss and shall not provide entitlement to\nany or all compensation from the Licensor.\n\n\n    Article 9 - WARRANTY\n\n9.1 The Licensee acknowledges that the scientific and technical\nstate-of-the-art when the Software was distributed did not enable all\npossible uses to be tested and verified, nor for the presence of\npossible defects to be detected. In this respect, the Licensee's\nattention has been drawn to the risks associated with loading, using,\nmodifying and/or developing and reproducing the Software which are\nreserved for experienced users.\n\nThe Licensee shall be responsible for verifying, by any or all means,\nthe suitability of the product for its requirements, its good working\norder, and for ensuring that it shall not cause damage to either persons\nor properties.\n\n9.2 The Licensor hereby represents, in good faith, that it is entitled\nto grant all the rights over the Software (including in particular the\nrights set forth in Article 5).\n\n9.3 The Licensee acknowledges that the Software is supplied \"as is\" by\nthe Licensor without any other express or tacit warranty, other than\nthat provided for in Article 9.2 and, in particular, without any warranty\nas to its commercial value, its secured, safe, innovative or relevant\nnature.\n\nSpecifically, the Licensor does not warrant that the Software is free\nfrom any error, that it will operate without interruption, that it will\nbe compatible with the Licensee's own equipment and software\nconfiguration, nor that it will meet the Licensee's requirements.\n\n9.4 The Licensor does not either expressly or tacitly warrant that the\nSoftware does not infringe any third party intellectual property right\nrelating to a patent, software or any other property right. Therefore,\nthe Licensor disclaims any and all liability towards the Licensee\narising out of any or all proceedings for infringement that may be\ninstituted in respect of the use, modification and redistribution of the\nSoftware. Nevertheless, should such proceedings be instituted against\nthe Licensee, the Licensor shall provide it with technical and legal\nassistance for its defense. Such technical and legal assistance shall be\ndecided on a case-by-case basis between the relevant Licensor and the\nLicensee pursuant to a memorandum of understanding. The Licensor\ndisclaims any and all liability as regards the Licensee's use of the\nname of the Software. No warranty is given as regards the existence of\nprior rights over the name of the Software or as regards the existence\nof a trademark.\n\n\n    Article 10 - TERMINATION\n\n10.1 In the event of a breach by the Licensee of its obligations\nhereunder, the Licensor may automatically terminate this Agreement\nthirty (30) days after notice has been sent to the Licensee and has\nremained ineffective.\n\n10.2 A Licensee whose Agreement is terminated shall no longer be\nauthorized to use, modify or distribute the Software. However, any\nlicenses that it may have granted prior to termination of the Agreement\nshall remain valid subject to their having been granted in compliance\nwith the terms and conditions hereof.\n\n\n    Article 11 - MISCELLANEOUS\n\n\n      11.1 EXCUSABLE EVENTS\n\nNeither Party shall be liable for any or all delay, or failure to\nperform the Agreement, that may be attributable to an event of force\nmajeure, an act of God or an outside cause, such as defective\nfunctioning or interruptions of the electricity or telecommunications\nnetworks, network paralysis following a virus attack, intervention by\ngovernment authorities, natural disasters, water damage, earthquakes,\nfire, explosions, strikes and labor unrest, war, etc.\n\n11.2 Any failure by either Party, on one or more occasions, to invoke\none or more of the provisions hereof, shall under no circumstances be\ninterpreted as being a waiver by the interested Party of its right to\ninvoke said provision(s) subsequently.\n\n11.3 The Agreement cancels and replaces any or all previous agreements,\nwhether written or oral, between the Parties and having the same\npurpose, and constitutes the entirety of the agreement between said\nParties concerning said purpose. No supplement or modification to the\nterms and conditions hereof shall be effective as between the Parties\nunless it is made in writing and signed by their duly authorized\nrepresentatives.\n\n11.4 In the event that one or more of the provisions hereof were to\nconflict with a current or future applicable act or legislative text,\nsaid act or legislative text shall prevail, and the Parties shall make\nthe necessary amendments so as to comply with said act or legislative\ntext. All other provisions shall remain effective. Similarly, invalidity\nof a provision of the Agreement, for any reason whatsoever, shall not\ncause the Agreement as a whole to be invalid.\n\n\n      11.5 LANGUAGE\n\nThe Agreement is drafted in both French and English and both versions\nare deemed authentic.\n\n\n    Article 12 - NEW VERSIONS OF THE AGREEMENT\n\n12.1 Any person is authorized to duplicate and distribute copies of this\nAgreement.\n\n12.2 So as to ensure coherence, the wording of this Agreement is\nprotected and may only be modified by the authors of the License, who\nreserve the right to periodically publish updates or new versions of the\nAgreement, each with a separate number. These subsequent versions may\naddress new issues encountered by Free Software.\n\n12.3 Any Software distributed under a given version of the Agreement may\nonly be subsequently distributed under the same version of the Agreement\nor a subsequent version.\n\n\n    Article 13 - GOVERNING LAW AND JURISDICTION\n\n13.1 The Agreement is governed by French law. The Parties agree to\nendeavor to seek an amicable solution to any disagreements or disputes\nthat may arise during the performance of the Agreement.\n\n13.2 Failing an amicable solution within two (2) months as from their\noccurrence, and unless emergency proceedings are necessary, the\ndisagreements or disputes shall be referred to the Paris Courts having\njurisdiction, by the more diligent Party.\n\n\nVersion 1.0 dated 2006-09-05.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>\nCeCILL-C FREE SOFTWARE LICENSE AGREEMENT\n      </p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>\nNotice\n      </p>\n\n         <p>\nThis Agreement is a Free Software license agreement that is the result of discussions between its authors in order to ensure compliance with the two main principles guiding its drafting:\n      </p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> *</var>\n\nfirstly, compliance with the principles governing the distribution of Free Software: access to source code, broad rights granted to users,\n\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> *</var>\n\nsecondly, the election of a governing law, French law, with which it is conformant, both as regards the law of torts and intellectual property law, and the protection that it offers to both authors and holders of the economic rights over software.\n\n        </li>\n         \n</ul>\n         <p>\nThe authors of the <var class=\"replaceable-license-text\"> CeCILL¹</var> license are:\n      </p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <p>\nCommissariat à l&apos;Energie Atomique - CEA, a public scientific, technical and industrial research establishment, having its principal place of business at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n          </p>\n\n            </li>\n            \n<li>\n               <p>\nCentre National de la Recherche Scientifique - CNRS, a public scientific and technological establishment, having its principal place of business at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n          </p>\n\n            </li>\n            \n<li>\n               <p>\nInstitut National de Recherche en Informatique et en Automatique - INRIA, a public scientific and technological establishment, having its principal place of business at Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le Chesnay cedex, France.\n          </p>\n\n            </li>\n         \n</ul>\n      </div>\n      \n<ul style=\"list-style:none\">\n         \n<li>\n            <var class=\"replaceable-license-text\"> Preamble</var>\n\nThe purpose of this Free Software license agreement is to grant users the right to modify and re-use the software governed by this license.\n\n          <p>\nThe exercising of this right is conditional upon the obligation to make available to the community the modifications made to the source code of the software so as to contribute to its evolution.\n          </p>\n\n            <p>\nIn consideration of access to the source code and the rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software&apos;s author, the holder of the economic rights, and the successive licensors only have limited liability.\n          </p>\n\n            <p>\nIn this respect, the risks associated with loading, using, modifying and/or developing or reproducing the software by the user are brought to the user&apos;s attention, given its Free Software status, which may make it complicated to use, with the result that its use is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the suitability of the software as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions of security. This Agreement may be freely reproduced and published, provided it is not altered, and that no provisions are either added or removed herefrom.\n          </p>\n\n            <p>\nThis Agreement may apply to any or all software for which the holder of the economic rights decides to submit the use thereof to its provisions.\n          </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 1 -</var>\n\n        DEFINITIONS\n\n      <p>\nFor the purpose of this Agreement, when the following expressions commence with a capital letter, they shall have the following meaning:\n      </p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <p>\nAgreement: means this license agreement, and its possible subsequent versions and annexes.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nSoftware: means the software in its Object Code and/or Source Code form and, where applicable, its documentation, &quot;as is&quot; when the Licensee accepts the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nInitial Software: means the Software in its Source Code and possibly its Object Code form and, where applicable, its documentation, &quot;as is&quot; when it is first distributed under the terms and conditions of the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nModified Software: means the Software modified by at least one Integrated Contribution.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nSource Code: means all the Software&apos;s instructions and program lines to which access is required so as to modify the Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nObject Code: means the binary files originating from the compilation of the Source Code.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nHolder: means the holder(s) of the economic rights over the Initial Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nLicensee: means the Software user(s) having accepted the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nContributor: means a Licensee having made at least one Integrated Contribution.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nLicensor: means the Holder, or any other individual or legal entity, who distributes the Software under the Agreement.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nIntegrated Contribution: means any or all modifications, corrections, translations, adaptations and/or new functions integrated into the Source Code by any or all Contributors.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nRelated Module: means a set of sources files including their documentation that, without modification to the Source Code, enables supplementary functions or services in addition to those offered by the Software.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nDerivative Software: means any combination of the Software, modified or not, and of a Related Module.\n          </p>\n\n               </li>\n               \n<li>\n                  <p>\nParties: mean both the Licensee and the Licensor.\n          </p>\n\n               </li>\n            \n</ul>\n            <p>\nThese expressions may be used both in singular and plural form.\n      </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 2 -</var>\n\nPURPOSE\n\n      <p>\nThe purpose of the Agreement is the grant by the Licensor to the Licensee of a non-exclusive, transferable and worldwide license for the Software as set forth in Article 5 hereinafter for the whole term of the protection granted by the rights over said Software.\n      </p>\n\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 3 -</var>\n\nACCEPTANCE\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.1</var>\n\nThe Licensee shall be deemed as having accepted the terms and conditions of this Agreement upon the occurrence of the first of the following events:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (i)</var>\n\nloading the Software by any or all means, notably, by downloading from a remote server, or by loading from a physical medium;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (ii)</var>\n\nthe first time the Licensee exercises any of the rights granted hereunder.\n\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.2</var>\n\nOne copy of the Agreement, containing a notice relating to the characteristics of the Software, to the limited warranty, and to the fact that its use is restricted to experienced users has been provided to the Licensee prior to its acceptance as set forth in Article 3.1 hereinabove, and the Licensee hereby acknowledges that it has read and understood it.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 4 -</var>\n\nEFFECTIVE DATE AND TERM\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 4.1</var>\n\nEFFECTIVE DATE\n\n          <p>\nThe Agreement shall become effective on the date when it is accepted by the Licensee as set forth in Article 3.1.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 4.2</var>\n\nTERM\n\n          <p>\nThe Agreement shall remain in force for the entire legal term of protection of the economic rights over the Software.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 5 -</var>\n\nSCOPE OF RIGHTS GRANTED\n\n      <p>\nThe Licensor hereby grants to the Licensee, who accepts, the following rights over the Software for any or all use, and for the term of the Agreement, on the basis of the terms and conditions set forth hereinafter.\n      </p>\n\n            <p>\nBesides, if the Licensor owns or comes to own one or more patents protecting all or part of the functions of the Software or of its components, the Licensor undertakes not to enforce the rights granted by these patents against successive Licensees using, exploiting or modifying the Software. If these patents are transferred, the Licensor undertakes to have the transferees subscribe to the obligations set forth in this paragraph.\n      </p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.1</var>\n\nRIGHT OF USE\n\n          <p>\nThe Licensee is authorized to use the Software, without any limitation as to its fields of application, with it being hereinafter specified that this comprises:\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 1.</var>\n\npermanent or temporary reproduction of all or part of the Software by any or all means and in any or all form.\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 2.</var>\n\nloading, displaying, running, or storing the Software on any or all medium.\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 3.</var>\n\nentitlement to observe, study or test its operation so as to determine the ideas and principles behind any or all constituent elements of said Software. This shall apply when the Licensee carries out any or all loading, displaying, running, transmission or storage operation as regards the Software, that it is entitled to carry out hereunder.\n\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.2</var>\n\nRIGHT OF MODIFICATION\n\n          <p>\nThe right of modification includes the right to translate, adapt, arrange, or make any or all modifications to the Software, and the right to reproduce the resulting software. It includes, in particular, the right to create a Derivative Software.\n          </p>\n\n                  <p>\nThe Licensee is authorized to make any or all modification to the Software provided that it includes an explicit notice that it is the author of said modification and indicates the date of the creation thereof.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 5.3</var>\n\nRIGHT OF DISTRIBUTION\n\n          <p>\nIn particular, the right of distribution includes the right to publish, transmit and communicate the Software to the general public on any or all medium, and by any or all means, and the right to market, either in consideration of a fee, or free of charge, one or more copies of the Software by any means.\n          </p>\n\n                  <p>\nThe Licensee is further authorized to distribute copies of the modified or unmodified Software to third parties according to the terms and conditions set forth hereinafter.\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.1.</var>\n\nDISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\n              <p>\nThe Licensee is authorized to distribute true copies of the Software in Source Code or Object Code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n              </p>\n\n<ul style=\"list-style:none\">\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 1.</var>\n\na copy of the Agreement,\n\n              </li>\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 2.</var>\n\na notice relating to the limitation of both the Licensor&apos;s warranty and liability as set forth in Articles 8 and 9,\n\n              </li>\n                        \n</ul>\n                        <p>\nand that, in the event that only the Object Code of the Software is redistributed, the Licensee allows effective access to the full Source Code of the Software at a minimum during the entire period of its distribution of the Software, it being understood that the additional cost of acquiring the Source Code shall not exceed the cost of transferring the data.\n            </p>\n\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.2.</var>\n\nDISTRIBUTION OF MODIFIED SOFTWARE\n\n            <p>\nWhen the Licensee makes an Integrated Contribution to the Software, the terms and conditions for the distribution of the resulting Modified Software become subject to all the provisions of this Agreement.\n            </p>\n\n                        <p>\nThe Licensee is authorized to distribute the Modified Software, in source code or object code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n            </p>\n\n<ul style=\"list-style:none\">\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 1.</var>\n\na copy of the Agreement,\n\n            </li>\n                           \n<li>\n                              <var class=\"replaceable-license-text\"> 2.</var>\n\na notice relating to the limitation of both the Licensor&apos;s warranty and liability as set forth in Articles 8 and 9,\n\n            </li>\n                        \n</ul>\n                        <p>\nand that, in the event that only the object code of the Modified Software is redistributed, the Licensee allows effective access to the full source code of the Modified Software at a minimum during the entire period of its distribution of the Modified Software, it being understood that the additional cost of acquiring the source code shall not exceed the cost of transferring the data.\n          </p>\n\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.3.</var>\n\nDISTRIBUTION OF DERIVATIVE SOFTWARE\n\n          <p>\nWhen the Licensee creates Derivative Software, this Derivative Software may be distributed under a license agreement other than this Agreement, subject to compliance with the requirement to include a notice concerning the rights over the Software as defined in Article 6.4.  In the event the creation of the Derivative Software required modification of the Source Code, the Licensee undertakes that:\n          </p>\n\n<ul style=\"list-style:none\">\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 1.</var>\n\nthe resulting Modified Software will be governed by this Agreement,\n\n\t    </li>\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 2.</var>\n\nthe Integrated Contributions in the resulting Modified Software will be clearly identified and documented,\n\n\t    </li>\n\t                          \n<li>\n\t                             <var class=\"replaceable-license-text\"> 3.</var>\n\nthe Licensee will allow effective access to the source code of the Modified Software, at a minimum during the entire period of distribution of the Derivative Software, such that such modifications may be carried over in a subsequent version of the Software; it being understood that the additional cost of purchasing the source code of the Modified Software shall not exceed the cost of transferring the data.\n\n\t    </li>\n\t                       \n</ul>\n                     </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 5.3.4.</var>\n\nCOMPATIBILITY WITH THE CeCILL LICENSE\n\n            <p>\nWhen a Modified Software contains an Integrated Contribution subject to the CeCILL license agreement, or when a Derivative Software contains a Related Module subject to the CeCILL license agreement, the provisions set forth in the third item of Article 6.4 are optional.\n            </p>\n\n                     </li>\n                  \n</ul>\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 6 -</var>\n\nINTELLECTUAL PROPERTY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.1</var>\n\nOVER THE INITIAL SOFTWARE\n\n          <p>\nThe Holder owns the economic rights over the Initial Software. Any or all use of the Initial Software is subject to compliance with the terms and conditions under which the Holder has elected to distribute its work and no one shall be entitled to modify the terms and conditions for the distribution of said Initial Software.\n          </p>\n\n                  <p>\nThe Holder undertakes that the Initial Software will remain ruled at least by this Agreement, for the duration set forth in Article 4.2.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.2</var>\n\nOVER THE INTEGRATED CONTRIBUTIONS\n\n          <p>\nThe Licensee who develops an Integrated Contribution is the owner of the intellectual property rights over this Contribution as defined by applicable law.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.3</var>\n\nOVER THE RELATED MODULES\n\n          <p>\nThe Licensee who develops a Related Module is the owner of the intellectual property rights over this Related Module as defined by applicable law and is free to choose the type of agreement that shall govern its distribution under the conditions defined in Article 5.3.3.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.4</var>\n\nNOTICE OF RIGHTS\n\n          <p>\nThe Licensee expressly undertakes:\n          </p>\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 1.</var>\n\nnot to remove, or modify, in any manner, the intellectual property notices attached to the Software;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 2.</var>\n\nto reproduce said notices, in an identical manner, in the copies of the Software modified or not;\n\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> 3.</var>\n\nto ensure that use of the Software, its intellectual property notices and the fact that it is governed by the Agreement is indicated in a text that is easily accessible, specifically from the interface of any Derivative Software.\n\n            </li>\n                  \n</ul>\n                  <p>\nThe Licensee undertakes not to directly or indirectly infringe the intellectual property rights of the Holder and/or Contributors on the Software and to take, where applicable, vis-à-vis its staff, any and all measures required to ensure respect of said intellectual property rights of the Holder and/or Contributors.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 7 -</var>\n\nRELATED SERVICES\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 7.1</var>\n\nUnder no circumstances shall the Agreement oblige the Licensor to provide technical assistance or maintenance services for the Software.\n\n          <p>\nHowever, the Licensor is entitled to offer this type of services. The terms and conditions of such technical assistance, and/or such maintenance, shall be set forth in a separate instrument. Only the Licensor offering said maintenance and/or technical assistance services shall incur liability therefor.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 7.2</var>\n\nSimilarly, any Licensor is entitled to offer to its licensees, under its sole responsibility, a warranty, that shall only be binding upon itself, for the redistribution of the Software and/or the Modified Software, under terms and conditions that it is free to decide. Said warranty, and the financial terms and conditions of its application, shall be subject of a separate instrument executed between the Licensor and the Licensee.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 8 -</var>\n\nLIABILITY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.1</var>\n\nSubject to the provisions of Article 8.2, the Licensee shall be entitled to claim compensation for any direct loss it may have suffered from the Software as a result of a fault on the part of the relevant Licensor, subject to providing evidence thereof.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.2</var>\n\nThe Licensor&apos;s liability is limited to the commitments made under this Agreement and shall not be incurred as a result of in particular: (i) loss due the Licensee&apos;s total or partial failure to fulfill its obligations, (ii) direct or consequential loss that is suffered by the Licensee due to the use or performance of the Software, and (iii) more generally, any consequential loss. In particular the Parties expressly agree that any or all pecuniary or business loss (i.e. loss of data, loss of profits, operating loss, loss of customers or orders, opportunity cost, any disturbance to business activities) or any or all legal proceedings instituted against the Licensee by a third party, shall constitute consequential loss and shall not provide entitlement to any or all compensation from the Licensor.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 9 -</var>\n\nWARRANTY\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.1</var>\n\nThe Licensee acknowledges that the scientific and technical state-of-the-art when the Software was distributed did not enable all possible uses to be tested and verified, nor for the presence of possible defects to be detected. In this respect, the Licensee&apos;s attention has been drawn to the risks associated with loading, using, modifying and/or developing and reproducing the Software which are reserved for experienced users.\n\n          <p>\nThe Licensee shall be responsible for verifying, by any or all means, the suitability of the product for its requirements, its good working order, and for ensuring that it shall not cause damage to either persons or properties.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.2</var>\n\nThe Licensor hereby represents, in good faith, that it is entitled to grant all the rights over the Software (including in particular the rights set forth in Article 5).\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.3</var>\n\nThe Licensee acknowledges that the Software is supplied &quot;as is&quot; by the Licensor without any other express or tacit warranty, other than that provided for in Article 9.2 and, in particular, without any warranty as to its commercial value, its secured, safe, innovative or relevant nature.\n\n          <p>\nSpecifically, the Licensor does not warrant that the Software is free from any error, that it will operate without interruption, that it will be compatible with the Licensee&apos;s own equipment and software configuration, nor that it will meet the Licensee&apos;s requirements.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 9.4</var>\n\nThe Licensor does not either expressly or tacitly warrant that the Software does not infringe any third party intellectual property right relating to a patent, software or any other property right. Therefore, the Licensor disclaims any and all liability towards the Licensee arising out of any or all proceedings for infringement that may be instituted in respect of the use, modification and redistribution of the Software. Nevertheless, should such proceedings be instituted against the Licensee, the Licensor shall provide it with technical and legal assistance for its defense. Such technical and legal assistance shall be decided on a case-by-case basis between the relevant Licensor and the Licensee pursuant to a memorandum of understanding. The Licensor disclaims any and all liability as regards the Licensee&apos;s use of the name of the Software. No warranty is given as regards the existence of prior rights over the name of the Software or as regards the existence of a trademark.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 10 -</var>\n\nTERMINATION\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 10.1</var>\n\nIn the event of a breach by the Licensee of its obligations hereunder, the Licensor may automatically terminate this Agreement thirty (30) days after notice has been sent to the Licensee and has remained ineffective.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 10.2</var>\n\nA Licensee whose Agreement is terminated shall no longer be authorized to use, modify or distribute the Software. However, any licenses that it may have granted prior to termination of the Agreement shall remain valid subject to their having been granted in compliance with the terms and conditions hereof.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 11 -</var>\n\nMISCELLANEOUS\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.1</var>\n\nEXCUSABLE EVENTS\n\n          <p>\nNeither Party shall be liable for any or all delay, or failure to perform the Agreement, that may be attributable to an event of force majeure, an act of God or an outside cause, such as defective functioning or interruptions of the electricity or telecommunications networks, network paralysis following a virus attack, intervention by government authorities, natural disasters, water damage, earthquakes, fire, explosions, strikes and labor unrest, war, etc.\n          </p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.2</var>\n\nAny failure by either Party, on one or more occasions, to invoke one or more of the provisions hereof, shall under no circumstances be interpreted as being a waiver by the interested Party of its right to invoke said provision(s) subsequently.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.3</var>\n\nThe Agreement cancels and replaces any or all previous agreements, whether written or oral, between the Parties and having the same purpose, and constitutes the entirety of the agreement between said Parties concerning said purpose. No supplement or modification to the terms and conditions hereof shall be effective as between the Parties unless it is made in writing and signed by their duly authorized representatives.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.4</var>\n\nIn the event that one or more of the provisions hereof were to conflict with a current or future applicable act or legislative text, said act or legislative text shall prevail, and the Parties shall make the necessary amendments so as to comply with said act or legislative text. All other provisions shall remain effective. Similarly, invalidity of a provision of the Agreement, for any reason whatsoever, shall not cause the Agreement as a whole to be invalid.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 11.5</var>\n\nLANGUAGE\n\n          <p>\nThe Agreement is drafted in both French and English and both versions are deemed authentic.\n          </p>\n\n               </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 12 -</var>\n\nNEW VERSIONS OF THE AGREEMENT\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.1</var>\n\nAny person is authorized to duplicate and distribute copies of this Agreement.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.2</var>\n\nSo as to ensure coherence, the wording of this Agreement is protected and may only be modified by the authors of the License, who reserve the right to periodically publish updates or new versions of the Agreement, each with a separate number. These subsequent versions may address new issues encountered by Free Software.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 12.3</var>\n\nAny Software distributed under a given version of the Agreement may only be subsequently distributed under the same version of the Agreement or a subsequent version.\n\n        </li>\n            \n</ul>\n         </li>\n         \n<li>\n            <var class=\"replaceable-license-text\"> Article 13 -</var>\n\nGOVERNING LAW AND JURISDICTION\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 13.1</var>\n\nThe Agreement is governed by French law. The Parties agree to endeavor to seek an amicable solution to any disagreements or disputes that may arise during the performance of the Agreement.\n\n        </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 13.2</var>\n\nFailing an amicable solution within two (2) months as from their occurrence, and unless emergency proceedings are necessary, the disagreements or disputes shall be referred to the Paris Courts having jurisdiction, by the more diligent Party.\n\n        </li>\n            \n</ul>\n         </li>\n      \n</ul>\n      <p>\nVersion 1.0 dated 2006-09-05.\n  </p>\n\n  <var class=\"optional-license-text\"> 1 CeCILL stands for Ce(a) C(nrs) I(nria) L(ogiciel) L(ibre)</var>\n    ","name":"CeCILL-C Free Software License Agreement","seeAlso":["http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"standardLicenseTemplate":"<<beginOptional>>CeCILL-C FREE SOFTWARE LICENSE AGREEMENT\n\n<<endOptional>><<beginOptional>> Notice\n\nThis Agreement is a Free Software license agreement that is the result of discussions between its authors in order to ensure compliance with the two main principles guiding its drafting:\n\n   <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> firstly, compliance with the principles governing the distribution of Free Software: access to source code, broad rights granted to users,\n\n   <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> secondly, the election of a governing law, French law, with which it is conformant, both as regards the law of torts and intellectual property law, and the protection that it offers to both authors and holders of the economic rights over software.\n\nThe authors of the <<var;name=\"licenseNameFootnote\";original=\"CeCILL¹\";match=\"CeCILL-C[¹1]?( \\(?for Ce[\\[\\(]a[\\]\\)] C[\\[\\(]nrs[\\]\\)] I[\\[\\(]nria[\\]\\)] L[\\[\\(]ogiciel[\\]\\)] L[\\[\\(]ibre[\\]\\)]\\)?)?\">> license are:\n\n   Commissariat à l'Energie Atomique - CEA, a public scientific, technical and industrial research establishment, having its principal place of business at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n\n   Centre National de la Recherche Scientifique - CNRS, a public scientific and technological establishment, having its principal place of business at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n\n   Institut National de Recherche en Informatique et en Automatique - INRIA, a public scientific and technological establishment, having its principal place of business at Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le Chesnay cedex, France.\n\n   <<endOptional>>\n\n   <<var;name=\"bullet\";original=\"Preamble\";match=\".{0,20}\">> The purpose of this Free Software license agreement is to grant users the right to modify and re-use the software governed by this license.\n\n   The exercising of this right is conditional upon the obligation to make available to the community the modifications made to the source code of the software so as to contribute to its evolution.\n\n   In consideration of access to the source code and the rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software's author, the holder of the economic rights, and the successive licensors only have limited liability.\n\n   In this respect, the risks associated with loading, using, modifying and/or developing or reproducing the software by the user are brought to the user's attention, given its Free Software status, which may make it complicated to use, with the result that its use is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the suitability of the software as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions of security. This Agreement may be freely reproduced and published, provided it is not altered, and that no provisions are either added or removed herefrom.\n\n   This Agreement may apply to any or all software for which the holder of the economic rights decides to submit the use thereof to its provisions.\n\n   <<var;name=\"bullet\";original=\"Article 1 -\";match=\".{0,20}\">> DEFINITIONS\n\n   For the purpose of this Agreement, when the following expressions commence with a capital letter, they shall have the following meaning:\n\n      Agreement: means this license agreement, and its possible subsequent versions and annexes.\n\n      Software: means the software in its Object Code and/or Source Code form and, where applicable, its documentation, \"as is\" when the Licensee accepts the Agreement.\n\n      Initial Software: means the Software in its Source Code and possibly its Object Code form and, where applicable, its documentation, \"as is\" when it is first distributed under the terms and conditions of the Agreement.\n\n      Modified Software: means the Software modified by at least one Integrated Contribution.\n\n      Source Code: means all the Software's instructions and program lines to which access is required so as to modify the Software.\n\n      Object Code: means the binary files originating from the compilation of the Source Code.\n\n      Holder: means the holder(s) of the economic rights over the Initial Software.\n\n      Licensee: means the Software user(s) having accepted the Agreement.\n\n      Contributor: means a Licensee having made at least one Integrated Contribution.\n\n      Licensor: means the Holder, or any other individual or legal entity, who distributes the Software under the Agreement.\n\n      Integrated Contribution: means any or all modifications, corrections, translations, adaptations and/or new functions integrated into the Source Code by any or all Contributors.\n\n      Related Module: means a set of sources files including their documentation that, without modification to the Source Code, enables supplementary functions or services in addition to those offered by the Software.\n\n      Derivative Software: means any combination of the Software, modified or not, and of a Related Module.\n\n      Parties: mean both the Licensee and the Licensor.\n\n   These expressions may be used both in singular and plural form.\n\n   <<var;name=\"bullet\";original=\"Article 2 -\";match=\".{0,20}\">> PURPOSE\n\n   The purpose of the Agreement is the grant by the Licensor to the Licensee of a non-exclusive, transferable and worldwide license for the Software as set forth in Article 5 hereinafter for the whole term of the protection granted by the rights over said Software.\n\n   <<var;name=\"bullet\";original=\"Article 3 -\";match=\".{0,20}\">> ACCEPTANCE\n\n      <<var;name=\"bullet\";original=\"3.1\";match=\".{0,20}\">> The Licensee shall be deemed as having accepted the terms and conditions of this Agreement upon the occurrence of the first of the following events:\n\n         <<var;name=\"bullet\";original=\"(i)\";match=\".{0,20}\">> loading the Software by any or all means, notably, by downloading from a remote server, or by loading from a physical medium;\n\n         <<var;name=\"bullet\";original=\"(ii)\";match=\".{0,20}\">> the first time the Licensee exercises any of the rights granted hereunder.\n\n      <<var;name=\"bullet\";original=\"3.2\";match=\".{0,20}\">> One copy of the Agreement, containing a notice relating to the characteristics of the Software, to the limited warranty, and to the fact that its use is restricted to experienced users has been provided to the Licensee prior to its acceptance as set forth in Article 3.1 hereinabove, and the Licensee hereby acknowledges that it has read and understood it.\n\n   <<var;name=\"bullet\";original=\"Article 4 -\";match=\".{0,20}\">> EFFECTIVE DATE AND TERM\n\n      <<var;name=\"bullet\";original=\"4.1\";match=\".{0,20}\">> EFFECTIVE DATE\n\n      The Agreement shall become effective on the date when it is accepted by the Licensee as set forth in Article 3.1.\n\n      <<var;name=\"bullet\";original=\"4.2\";match=\".{0,20}\">> TERM\n\n      The Agreement shall remain in force for the entire legal term of protection of the economic rights over the Software.\n\n   <<var;name=\"bullet\";original=\"Article 5 -\";match=\".{0,20}\">> SCOPE OF RIGHTS GRANTED\n\n   The Licensor hereby grants to the Licensee, who accepts, the following rights over the Software for any or all use, and for the term of the Agreement, on the basis of the terms and conditions set forth hereinafter.\n\n   Besides, if the Licensor owns or comes to own one or more patents protecting all or part of the functions of the Software or of its components, the Licensor undertakes not to enforce the rights granted by these patents against successive Licensees using, exploiting or modifying the Software. If these patents are transferred, the Licensor undertakes to have the transferees subscribe to the obligations set forth in this paragraph.\n\n      <<var;name=\"bullet\";original=\"5.1\";match=\".{0,20}\">> RIGHT OF USE\n\n      The Licensee is authorized to use the Software, without any limitation as to its fields of application, with it being hereinafter specified that this comprises:\n\n         <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> permanent or temporary reproduction of all or part of the Software by any or all means and in any or all form.\n\n         <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> loading, displaying, running, or storing the Software on any or all medium.\n\n         <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> entitlement to observe, study or test its operation so as to determine the ideas and principles behind any or all constituent elements of said Software. This shall apply when the Licensee carries out any or all loading, displaying, running, transmission or storage operation as regards the Software, that it is entitled to carry out hereunder.\n\n      <<var;name=\"bullet\";original=\"5.2\";match=\".{0,20}\">> RIGHT OF MODIFICATION\n\n      The right of modification includes the right to translate, adapt, arrange, or make any or all modifications to the Software, and the right to reproduce the resulting software. It includes, in particular, the right to create a Derivative Software.\n\n      The Licensee is authorized to make any or all modification to the Software provided that it includes an explicit notice that it is the author of said modification and indicates the date of the creation thereof.\n\n      <<var;name=\"bullet\";original=\"5.3\";match=\".{0,20}\">> RIGHT OF DISTRIBUTION\n\n      In particular, the right of distribution includes the right to publish, transmit and communicate the Software to the general public on any or all medium, and by any or all means, and the right to market, either in consideration of a fee, or free of charge, one or more copies of the Software by any means.\n\n      The Licensee is further authorized to distribute copies of the modified or unmodified Software to third parties according to the terms and conditions set forth hereinafter.\n\n         <<var;name=\"bullet\";original=\"5.3.1.\";match=\".{0,20}\">> DISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\n         The Licensee is authorized to distribute true copies of the Software in Source Code or Object Code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> a copy of the Agreement,\n\n            <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the Object Code of the Software is redistributed, the Licensee allows effective access to the full Source Code of the Software at a minimum during the entire period of its distribution of the Software, it being understood that the additional cost of acquiring the Source Code shall not exceed the cost of transferring the data.\n\n         <<var;name=\"bullet\";original=\"5.3.2.\";match=\".{0,20}\">> DISTRIBUTION OF MODIFIED SOFTWARE\n\n         When the Licensee makes an Integrated Contribution to the Software, the terms and conditions for the distribution of the resulting Modified Software become subject to all the provisions of this Agreement.\n\n         The Licensee is authorized to distribute the Modified Software, in source code or object code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> a copy of the Agreement,\n\n            <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the object code of the Modified Software is redistributed, the Licensee allows effective access to the full source code of the Modified Software at a minimum during the entire period of its distribution of the Modified Software, it being understood that the additional cost of acquiring the source code shall not exceed the cost of transferring the data.\n\n         <<var;name=\"bullet\";original=\"5.3.3.\";match=\".{0,20}\">> DISTRIBUTION OF DERIVATIVE SOFTWARE\n\n         When the Licensee creates Derivative Software, this Derivative Software may be distributed under a license agreement other than this Agreement, subject to compliance with the requirement to include a notice concerning the rights over the Software as defined in Article 6.4. In the event the creation of the Derivative Software required modification of the Source Code, the Licensee undertakes that:\n\n            <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> the resulting Modified Software will be governed by this Agreement,\n\n            <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> the Integrated Contributions in the resulting Modified Software will be clearly identified and documented,\n\n            <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> the Licensee will allow effective access to the source code of the Modified Software, at a minimum during the entire period of distribution of the Derivative Software, such that such modifications may be carried over in a subsequent version of the Software; it being understood that the additional cost of purchasing the source code of the Modified Software shall not exceed the cost of transferring the data.\n\n         <<var;name=\"bullet\";original=\"5.3.4.\";match=\".{0,20}\">> COMPATIBILITY WITH THE CeCILL LICENSE\n\n         When a Modified Software contains an Integrated Contribution subject to the CeCILL license agreement, or when a Derivative Software contains a Related Module subject to the CeCILL license agreement, the provisions set forth in the third item of Article 6.4 are optional.\n\n   <<var;name=\"bullet\";original=\"Article 6 -\";match=\".{0,20}\">> INTELLECTUAL PROPERTY\n\n      <<var;name=\"bullet\";original=\"6.1\";match=\".{0,20}\">> OVER THE INITIAL SOFTWARE\n\n      The Holder owns the economic rights over the Initial Software. Any or all use of the Initial Software is subject to compliance with the terms and conditions under which the Holder has elected to distribute its work and no one shall be entitled to modify the terms and conditions for the distribution of said Initial Software.\n\n      The Holder undertakes that the Initial Software will remain ruled at least by this Agreement, for the duration set forth in Article 4.2.\n\n      <<var;name=\"bullet\";original=\"6.2\";match=\".{0,20}\">> OVER THE INTEGRATED CONTRIBUTIONS\n\n      The Licensee who develops an Integrated Contribution is the owner of the intellectual property rights over this Contribution as defined by applicable law.\n\n      <<var;name=\"bullet\";original=\"6.3\";match=\".{0,20}\">> OVER THE RELATED MODULES\n\n      The Licensee who develops a Related Module is the owner of the intellectual property rights over this Related Module as defined by applicable law and is free to choose the type of agreement that shall govern its distribution under the conditions defined in Article 5.3.3.\n\n      <<var;name=\"bullet\";original=\"6.4\";match=\".{0,20}\">> NOTICE OF RIGHTS\n\n      The Licensee expressly undertakes:\n\n         <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> not to remove, or modify, in any manner, the intellectual property notices attached to the Software;\n\n         <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> to reproduce said notices, in an identical manner, in the copies of the Software modified or not;\n\n         <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> to ensure that use of the Software, its intellectual property notices and the fact that it is governed by the Agreement is indicated in a text that is easily accessible, specifically from the interface of any Derivative Software.\n\n      The Licensee undertakes not to directly or indirectly infringe the intellectual property rights of the Holder and/or Contributors on the Software and to take, where applicable, vis-à-vis its staff, any and all measures required to ensure respect of said intellectual property rights of the Holder and/or Contributors.\n\n   <<var;name=\"bullet\";original=\"Article 7 -\";match=\".{0,20}\">> RELATED SERVICES\n\n      <<var;name=\"bullet\";original=\"7.1\";match=\".{0,20}\">> Under no circumstances shall the Agreement oblige the Licensor to provide technical assistance or maintenance services for the Software.\n\n      However, the Licensor is entitled to offer this type of services. The terms and conditions of such technical assistance, and/or such maintenance, shall be set forth in a separate instrument. Only the Licensor offering said maintenance and/or technical assistance services shall incur liability therefor.\n\n      <<var;name=\"bullet\";original=\"7.2\";match=\".{0,20}\">> Similarly, any Licensor is entitled to offer to its licensees, under its sole responsibility, a warranty, that shall only be binding upon itself, for the redistribution of the Software and/or the Modified Software, under terms and conditions that it is free to decide. Said warranty, and the financial terms and conditions of its application, shall be subject of a separate instrument executed between the Licensor and the Licensee.\n\n   <<var;name=\"bullet\";original=\"Article 8 -\";match=\".{0,20}\">> LIABILITY\n\n      <<var;name=\"bullet\";original=\"8.1\";match=\".{0,20}\">> Subject to the provisions of Article 8.2, the Licensee shall be entitled to claim compensation for any direct loss it may have suffered from the Software as a result of a fault on the part of the relevant Licensor, subject to providing evidence thereof.\n\n      <<var;name=\"bullet\";original=\"8.2\";match=\".{0,20}\">> The Licensor's liability is limited to the commitments made under this Agreement and shall not be incurred as a result of in particular: (i) loss due the Licensee's total or partial failure to fulfill its obligations, (ii) direct or consequential loss that is suffered by the Licensee due to the use or performance of the Software, and (iii) more generally, any consequential loss. In particular the Parties expressly agree that any or all pecuniary or business loss (i.e. loss of data, loss of profits, operating loss, loss of customers or orders, opportunity cost, any disturbance to business activities) or any or all legal proceedings instituted against the Licensee by a third party, shall constitute consequential loss and shall not provide entitlement to any or all compensation from the Licensor.\n\n   <<var;name=\"bullet\";original=\"Article 9 -\";match=\".{0,20}\">> WARRANTY\n\n      <<var;name=\"bullet\";original=\"9.1\";match=\".{0,20}\">> The Licensee acknowledges that the scientific and technical state-of-the-art when the Software was distributed did not enable all possible uses to be tested and verified, nor for the presence of possible defects to be detected. In this respect, the Licensee's attention has been drawn to the risks associated with loading, using, modifying and/or developing and reproducing the Software which are reserved for experienced users.\n\n      The Licensee shall be responsible for verifying, by any or all means, the suitability of the product for its requirements, its good working order, and for ensuring that it shall not cause damage to either persons or properties.\n\n      <<var;name=\"bullet\";original=\"9.2\";match=\".{0,20}\">> The Licensor hereby represents, in good faith, that it is entitled to grant all the rights over the Software (including in particular the rights set forth in Article 5).\n\n      <<var;name=\"bullet\";original=\"9.3\";match=\".{0,20}\">> The Licensee acknowledges that the Software is supplied \"as is\" by the Licensor without any other express or tacit warranty, other than that provided for in Article 9.2 and, in particular, without any warranty as to its commercial value, its secured, safe, innovative or relevant nature.\n\n      Specifically, the Licensor does not warrant that the Software is free from any error, that it will operate without interruption, that it will be compatible with the Licensee's own equipment and software configuration, nor that it will meet the Licensee's requirements.\n\n      <<var;name=\"bullet\";original=\"9.4\";match=\".{0,20}\">> The Licensor does not either expressly or tacitly warrant that the Software does not infringe any third party intellectual property right relating to a patent, software or any other property right. Therefore, the Licensor disclaims any and all liability towards the Licensee arising out of any or all proceedings for infringement that may be instituted in respect of the use, modification and redistribution of the Software. Nevertheless, should such proceedings be instituted against the Licensee, the Licensor shall provide it with technical and legal assistance for its defense. Such technical and legal assistance shall be decided on a case-by-case basis between the relevant Licensor and the Licensee pursuant to a memorandum of understanding. The Licensor disclaims any and all liability as regards the Licensee's use of the name of the Software. No warranty is given as regards the existence of prior rights over the name of the Software or as regards the existence of a trademark.\n\n   <<var;name=\"bullet\";original=\"Article 10 -\";match=\".{0,20}\">> TERMINATION\n\n      <<var;name=\"bullet\";original=\"10.1\";match=\".{0,20}\">> In the event of a breach by the Licensee of its obligations hereunder, the Licensor may automatically terminate this Agreement thirty (30) days after notice has been sent to the Licensee and has remained ineffective.\n\n      <<var;name=\"bullet\";original=\"10.2\";match=\".{0,20}\">> A Licensee whose Agreement is terminated shall no longer be authorized to use, modify or distribute the Software. However, any licenses that it may have granted prior to termination of the Agreement shall remain valid subject to their having been granted in compliance with the terms and conditions hereof.\n\n   <<var;name=\"bullet\";original=\"Article 11 -\";match=\".{0,20}\">> MISCELLANEOUS\n\n      <<var;name=\"bullet\";original=\"11.1\";match=\".{0,20}\">> EXCUSABLE EVENTS\n\n      Neither Party shall be liable for any or all delay, or failure to perform the Agreement, that may be attributable to an event of force majeure, an act of God or an outside cause, such as defective functioning or interruptions of the electricity or telecommunications networks, network paralysis following a virus attack, intervention by government authorities, natural disasters, water damage, earthquakes, fire, explosions, strikes and labor unrest, war, etc.\n\n      <<var;name=\"bullet\";original=\"11.2\";match=\".{0,20}\">> Any failure by either Party, on one or more occasions, to invoke one or more of the provisions hereof, shall under no circumstances be interpreted as being a waiver by the interested Party of its right to invoke said provision(s) subsequently.\n\n      <<var;name=\"bullet\";original=\"11.3\";match=\".{0,20}\">> The Agreement cancels and replaces any or all previous agreements, whether written or oral, between the Parties and having the same purpose, and constitutes the entirety of the agreement between said Parties concerning said purpose. No supplement or modification to the terms and conditions hereof shall be effective as between the Parties unless it is made in writing and signed by their duly authorized representatives.\n\n      <<var;name=\"bullet\";original=\"11.4\";match=\".{0,20}\">> In the event that one or more of the provisions hereof were to conflict with a current or future applicable act or legislative text, said act or legislative text shall prevail, and the Parties shall make the necessary amendments so as to comply with said act or legislative text. All other provisions shall remain effective. Similarly, invalidity of a provision of the Agreement, for any reason whatsoever, shall not cause the Agreement as a whole to be invalid.\n\n      <<var;name=\"bullet\";original=\"11.5\";match=\".{0,20}\">> LANGUAGE\n\n      The Agreement is drafted in both French and English and both versions are deemed authentic.\n\n   <<var;name=\"bullet\";original=\"Article 12 -\";match=\".{0,20}\">> NEW VERSIONS OF THE AGREEMENT\n\n      <<var;name=\"bullet\";original=\"12.1\";match=\".{0,20}\">> Any person is authorized to duplicate and distribute copies of this Agreement.\n\n      <<var;name=\"bullet\";original=\"12.2\";match=\".{0,20}\">> So as to ensure coherence, the wording of this Agreement is protected and may only be modified by the authors of the License, who reserve the right to periodically publish updates or new versions of the Agreement, each with a separate number. These subsequent versions may address new issues encountered by Free Software.\n\n      <<var;name=\"bullet\";original=\"12.3\";match=\".{0,20}\">> Any Software distributed under a given version of the Agreement may only be subsequently distributed under the same version of the Agreement or a subsequent version.\n\n   <<var;name=\"bullet\";original=\"Article 13 -\";match=\".{0,20}\">> GOVERNING LAW AND JURISDICTION\n\n      <<var;name=\"bullet\";original=\"13.1\";match=\".{0,20}\">> The Agreement is governed by French law. The Parties agree to endeavor to seek an amicable solution to any disagreements or disputes that may arise during the performance of the Agreement.\n\n      <<var;name=\"bullet\";original=\"13.2\";match=\".{0,20}\">> Failing an amicable solution within two (2) months as from their occurrence, and unless emergency proceedings are necessary, the disagreements or disputes shall be referred to the Paris Courts having jurisdiction, by the more diligent Party.\n\nVersion 1.0 dated 2006-09-05.\n\n<<beginOptional>>1 CeCILL stands for Ce(a) C(nrs) I(nria) L(ogiciel) L(ibre)<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:CECILL-C","tag":"LN"},[{"contents":"spdx:CECILL-C","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"CeCILL-C License","tag":"LN"},{"contents":"CeCILL-C","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","cfac74f08638653ca9f005a0a1d1f858"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"http://www.cecill.info/licences.en.html"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":["CeCILL-C"],"_legacy_names":["CeCILL-C License"],"_notes":null},"_id":"CECILL-C","_license":{"_expression":"spdx:CECILL-C","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":["http://www.cecill.info/licences.en.html"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":[{"contents":"BlueOak:CECILL-C","tag":"LN"},[{"contents":"CeCILL-C Free Software License Agreement","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"CeCILL Free Software License Agreement","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["BlueOakCouncil","09b2bace07ef4abb0afbb6e45427c594"],"impliedStmts":[{"contents":[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"},[{"contents":{"tag":"Copyleft"},"tag":"LicenseType"}]],"tag":"SubStatements"}],"raw":{"contents":["weak","CeCILL Free Software License Agreement",{"_id":"CECILL-C","_name":"CeCILL-C Free Software License Agreement","_url":null}],"tag":"BOCCopyleft"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fsf:CeCILL-C","tag":"LN"},[{"contents":"CeCILL-C version 1","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"spdx:CECILL-C","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FSF","451925bf5d74e856f1b4105d6a7f5838"],"impliedStmts":[{"contents":[null,"https://www.gnu.org/licenses/license-list.html#CeCILL-C"],"tag":"LicenseUrl"},{"contents":[null,"https://directory.fsf.org/wiki/License:CeCILL-C"],"tag":"LicenseUrl"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_id":"fsf:CeCILL-C","_identifiers":{"spdx":["CECILL-C"]},"_name":"CeCILL-C version 1","_tags":["libre"],"_uris":["https://www.gnu.org/licenses/license-list.html#CeCILL-C","https://directory.fsf.org/wiki/License:CeCILL-C"]},"type":"FSF"},{"applicableLNs":{"contents":[{"contents":"scancode:cecill-c","tag":"LN"},[{"contents":"CeCILL-C License","tag":"LN"},{"contents":"CeCILL-C Free Software License Agreement","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","f458269a9ef8a154b7b9b9a89fc39cd8"],"impliedStmts":[{"contents":{"tag":"Copyleft"},"tag":"LicenseType"},{"contents":{"contents":"http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","per SPDX.org, English translation can be found here\nhttp://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html\n"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html"],"tag":"LicenseUrl"},{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"tag":"LicenseUrl"},{"contents":"CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL-C\n\n\n    Avertissement\n\nCe contrat est une licence de logiciel libre issue d'une concertation\nentre ses auteurs afin que le respect de deux grands principes préside à\nsa rédaction:\n\n    * d'une part, le respect des principes de diffusion des logiciels\n      libres: accès au code source, droits étendus conférés aux\n      utilisateurs,\n    * d'autre part, la désignation d'un droit applicable, le droit\n      français, auquel elle est conforme, tant au regard du droit de la\n      responsabilité civile que du droit de la propriété intellectuelle\n      et de la protection qu'il offre aux auteurs et titulaires des\n      droits patrimoniaux sur un logiciel.\n\nLes auteurs de la licence CeCILL-C (pour Ce[a] C[nrs] I[nria] L[ogiciel]\nL[ibre]) sont:\n\nCommissariat à l'Energie Atomique - CEA, établissement public de\nrecherche à caractère scientifique, technique et industriel, dont le\nsiège est situé 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris.\n\nCentre National de la Recherche Scientifique - CNRS, établissement\npublic à caractère scientifique et technologique, dont le siège est\nsitué 3 rue Michel-Ange, 75794 Paris cedex 16.\n\nInstitut National de Recherche en Informatique et en Automatique -\nINRIA, établissement public à caractère scientifique et technologique,\ndont le siège est situé Domaine de Voluceau, Rocquencourt, BP 105, 78153\nLe Chesnay cedex.\n\n\n    Préambule\n\nCe contrat est une licence de logiciel libre dont l'objectif est de\nconférer aux utilisateurs la liberté de modifier et de réutiliser le\nlogiciel régi par cette licence.\n\nL'exercice de cette liberté est assorti d'une obligation de remettre à\nla disposition de la communauté les modifications apportées au code\nsource du logiciel afin de contribuer à son évolution.\n\nL'accessibilité au code source et les droits de copie, de modification\net de redistribution qui découlent de ce contrat ont pour contrepartie\nde n'offrir aux utilisateurs qu'une garantie limitée et de ne faire\npeser sur l'auteur du logiciel, le titulaire des droits patrimoniaux et\nles concédants successifs qu'une responsabilité restreinte.\n\nA cet égard l'attention de l'utilisateur est attirée sur les risques\nassociés au chargement, à l'utilisation, à la modification et/ou au\ndéveloppement et à la reproduction du logiciel par l'utilisateur étant\ndonné sa spécificité de logiciel libre, qui peut le rendre complexe à\nmanipuler et qui le réserve donc à des développeurs ou des\nprofessionnels avertis possédant des connaissances informatiques\napprofondies. Les utilisateurs sont donc invités à charger et tester\nl'adéquation du logiciel à leurs besoins dans des conditions permettant\nd'assurer la sécurité de leurs systèmes et/ou de leurs données et, plus\ngénéralement, à l'utiliser et l'exploiter dans les mêmes conditions de\nsécurité. Ce contrat peut être reproduit et diffusé librement, sous\nréserve de le conserver en l'état, sans ajout ni suppression de clauses.\n\nCe contrat est susceptible de s'appliquer à tout logiciel dont le\ntitulaire des droits patrimoniaux décide de soumettre l'exploitation aux\ndispositions qu'il contient.\n\n\n    Article 1 - DEFINITIONS\n\nDans ce contrat, les termes suivants, lorsqu'ils seront écrits avec une\nlettre capitale, auront la signification suivante:\n\nContrat: désigne le présent contrat de licence, ses éventuelles versions\npostérieures et annexes.\n\nLogiciel: désigne le logiciel sous sa forme de Code Objet et/ou de Code\nSource et le cas échéant sa documentation, dans leur état au moment de\nl'acceptation du Contrat par le Licencié.\n\nLogiciel Initial: désigne le Logiciel sous sa forme de Code Source et\néventuellement de Code Objet et le cas échéant sa documentation, dans\nleur état au moment de leur première diffusion sous les termes du Contrat.\n\nLogiciel Modifié: désigne le Logiciel modifié par au moins une\nContribution Intégrée.\n\nCode Source: désigne l'ensemble des instructions et des lignes de\nprogramme du Logiciel et auquel l'accès est nécessaire en vue de\nmodifier le Logiciel.\n\nCode Objet: désigne les fichiers binaires issus de la compilation du\nCode Source.\n\nTitulaire: désigne le ou les détenteurs des droits patrimoniaux d'auteur\nsur le Logiciel Initial.\n\nLicencié: désigne le ou les utilisateurs du Logiciel ayant accepté le\nContrat.\n\nContributeur: désigne le Licencié auteur d'au moins une Contribution\nIntégrée.\n\nConcédant: désigne le Titulaire ou toute personne physique ou morale\ndistribuant le Logiciel sous le Contrat.\n\nContribution Intégrée: désigne l'ensemble des modifications,\ncorrections, traductions, adaptations et/ou nouvelles fonctionnalités\nintégrées dans le Code Source par tout Contributeur.\n\nModule Lié: désigne un ensemble de fichiers sources y compris leur\ndocumentation qui, sans modification du Code Source, permet de réaliser\ndes fonctionnalités ou services supplémentaires à ceux fournis par le\nLogiciel.\n\nLogiciel Dérivé: désigne toute combinaison du Logiciel, modifié ou non,\net d'un Module Lié.\n\nParties: désigne collectivement le Licencié et le Concédant.\n\nCes termes s'entendent au singulier comme au pluriel.\n\n\n    Article 2 - OBJET\n\nLe Contrat a pour objet la concession par le Concédant au Licencié d'une\nlicence non exclusive, cessible et mondiale du Logiciel telle que\ndéfinie ci-après à l'article 5 pour toute la durée de protection des droits\nportant sur ce Logiciel.\n\n\n    Article 3 - ACCEPTATION\n\n3.1 L'acceptation par le Licencié des termes du Contrat est réputée\nacquise du fait du premier des faits suivants:\n\n    * (i) le chargement du Logiciel par tout moyen notamment par\n      téléchargement à partir d'un serveur distant ou par chargement à\n      partir d'un support physique;\n    * (ii) le premier exercice par le Licencié de l'un quelconque des\n      droits concédés par le Contrat.\n\n3.2 Un exemplaire du Contrat, contenant notamment un avertissement\nrelatif aux spécificités du Logiciel, à la restriction de garantie et à\nla limitation à un usage par des utilisateurs expérimentés a été mis à\ndisposition du Licencié préalablement à son acceptation telle que\ndéfinie à l'article 3.1 ci dessus et le Licencié reconnaît en avoir pris\nconnaissance.\n\n\n    Article 4 - ENTREE EN VIGUEUR ET DUREE\n\n\n      4.1 ENTREE EN VIGUEUR\n\nLe Contrat entre en vigueur à la date de son acceptation par le Licencié\ntelle que définie en 3.1.\n\n\n      4.2 DUREE\n\nLe Contrat produira ses effets pendant toute la durée légale de\nprotection des droits patrimoniaux portant sur le Logiciel.\n\n\n    Article 5 - ETENDUE DES DROITS CONCEDES\n\nLe Concédant concède au Licencié, qui accepte, les droits suivants sur\nle Logiciel pour toutes destinations et pour la durée du Contrat dans\nles conditions ci-après détaillées.\n\nPar ailleurs, si le Concédant détient ou venait à détenir un ou\nplusieurs brevets d'invention protégeant tout ou partie des\nfonctionnalités du Logiciel ou de ses composants, il s'engage à ne pas\nopposer les éventuels droits conférés par ces brevets aux Licenciés\nsuccessifs qui utiliseraient, exploiteraient ou modifieraient le\nLogiciel. En cas de cession de ces brevets, le Concédant s'engage à\nfaire reprendre les obligations du présent alinéa aux cessionnaires.\n\n\n      5.1 DROIT D'UTILISATION\n\nLe Licencié est autorisé à utiliser le Logiciel, sans restriction quant\naux domaines d'application, étant ci-après précisé que cela comporte:\n\n   1. la reproduction permanente ou provisoire du Logiciel en tout ou\n      partie par tout moyen et sous toute forme.\n\n   2. le chargement, l'affichage, l'exécution, ou le stockage du\n      Logiciel sur tout support.\n\n   3. la possibilité d'en observer, d'en étudier, ou d'en tester le\n      fonctionnement afin de déterminer les idées et principes qui sont\n      à la base de n'importe quel élément de ce Logiciel; et ceci,\n      lorsque le Licencié effectue toute opération de chargement,\n      d'affichage, d'exécution, de transmission ou de stockage du\n      Logiciel qu'il est en droit d'effectuer en vertu du Contrat.\n\n\n      5.2 DROIT DE MODIFICATION\n\nLe droit de modification comporte le droit de traduire, d'adapter,\nd'arranger ou d'apporter toute autre modification au Logiciel et le\ndroit de reproduire le logiciel en résultant. Il comprend en particulier\nle droit de créer un Logiciel Dérivé.\n\nLe Licencié est autorisé à apporter toute modification au Logiciel sous\nréserve de mentionner, de façon explicite, son nom en tant qu'auteur de\ncette modification et la date de création de celle-ci.\n\n\n      5.3 DROIT DE DISTRIBUTION\n\nLe droit de distribution comporte notamment le droit de diffuser, de\ntransmettre et de communiquer le Logiciel au public sur tout support et\npar tout moyen ainsi que le droit de mettre sur le marché à titre\nonéreux ou gratuit, un ou des exemplaires du Logiciel par tout procédé.\n\nLe Licencié est autorisé à distribuer des copies du Logiciel, modifié ou\nnon, à des tiers dans les conditions ci-après détaillées.\n\n\n        5.3.1 DISTRIBUTION DU LOGICIEL SANS MODIFICATION\n\nLe Licencié est autorisé à distribuer des copies conformes du Logiciel,\nsous forme de Code Source ou de Code Objet, à condition que cette\ndistribution respecte les dispositions du Contrat dans leur totalité et\nsoit accompagnée:\n\n   1. d'un exemplaire du Contrat,\n\n   2. d'un avertissement relatif à la restriction de garantie et de\n      responsabilité du Concédant telle que prévue aux articles 8\n      et 9,\n\net que, dans le cas où seul le Code Objet du Logiciel est redistribué,\nle Licencié permette un accès effectif au Code Source complet du\nLogiciel pendant au moins toute la durée de sa distribution du Logiciel,\nétant entendu que le coût additionnel d'acquisition du Code Source ne\ndevra pas excéder le simple coût de transfert des données.\n\n\n        5.3.2 DISTRIBUTION DU LOGICIEL MODIFIE\n\nLorsque le Licencié apporte une Contribution Intégrée au Logiciel, les\nconditions de distribution du Logiciel Modifié en résultant sont alors\nsoumises à l'intégralité des dispositions du Contrat.\n\nLe Licencié est autorisé à distribuer le Logiciel Modifié sous forme de\ncode source ou de code objet, à condition que cette distribution\nrespecte les dispositions du Contrat dans leur totalité et soit\naccompagnée:\n\n   1. d'un exemplaire du Contrat,\n\n   2. d'un avertissement relatif à la restriction de garantie et de\n      responsabilité du Concédant telle que prévue aux articles 8\n      et 9,\n\net que, dans le cas où seul le code objet du Logiciel Modifié est\nredistribué, le Licencié permette un accès effectif à son code source\ncomplet pendant au moins toute la durée de sa distribution du Logiciel\nModifié, étant entendu que le coût additionnel d'acquisition du code\nsource ne devra pas excéder le simple coût de transfert des données.\n\n\n        5.3.3 DISTRIBUTION DU LOGICIEL DERIVE\n\nLorsque le Licencié crée un Logiciel Dérivé, ce Logiciel Dérivé peut\nêtre distribué sous un contrat de licence autre que le présent Contrat à\ncondition de respecter les obligations de mention des droits sur le\nLogiciel telles que définies à l'article 6.4. Dans le cas où la création du\nLogiciel Dérivé a nécessité une modification du Code Source le licencié\ns'engage à ce que: \n\n   1. le Logiciel Modifié correspondant à cette modification soit régi\n      par le présent Contrat,\n   2. les Contributions Intégrées dont le Logiciel Modifié résulte\n      soient clairement identifiées et documentées,\n   3. le Licencié permette un accès effectif au code source du Logiciel\n      Modifié, pendant au moins toute la durée de la distribution du\n      Logiciel Dérivé, de telle sorte que ces modifications puissent\n      être reprises dans une version ultérieure du Logiciel, étant\n      entendu que le coût additionnel d'acquisition du code source du\n      Logiciel Modifié ne devra pas excéder le simple coût du transfert\n      des données.\n\n\n        5.3.4 COMPATIBILITE AVEC LA LICENCE CeCILL\n\nLorsqu'un Logiciel Modifié contient une Contribution Intégrée soumise au\ncontrat de licence CeCILL, ou lorsqu'un Logiciel Dérivé contient un\nModule Lié soumis au contrat de licence CeCILL, les stipulations prévues\nau troisième item de l'article 6.4 sont facultatives.\n\n\n    Article 6 - PROPRIETE INTELLECTUELLE\n\n\n      6.1 SUR LE LOGICIEL INITIAL\n\nLe Titulaire est détenteur des droits patrimoniaux sur le Logiciel\nInitial. Toute utilisation du Logiciel Initial est soumise au respect\ndes conditions dans lesquelles le Titulaire a choisi de diffuser son\noeuvre et nul autre n'a la faculté de modifier les conditions de\ndiffusion de ce Logiciel Initial.\n\nLe Titulaire s'engage à ce que le Logiciel Initial reste au moins régi\npar le Contrat et ce, pour la durée visée à l'article 4.2.\n\n\n      6.2 SUR LES CONTRIBUTIONS INTEGREES\n\nLe Licencié qui a développé une Contribution Intégrée est titulaire sur\ncelle-ci des droits de propriété intellectuelle dans les conditions\ndéfinies par la législation applicable.\n\n\n      6.3 SUR LES MODULES LIES\n\nLe Licencié qui a développé un Module Lié est titulaire sur celui-ci des\ndroits de propriété intellectuelle dans les conditions définies par la\nlégislation applicable et reste libre du choix du contrat régissant sa\ndiffusion dans les conditions définies à l'article 5.3.3.\n\n\n      6.4 MENTIONS DES DROITS\n\nLe Licencié s'engage expressément:\n\n   1. à ne pas supprimer ou modifier de quelque manière que ce soit les\n      mentions de propriété intellectuelle apposées sur le Logiciel;\n\n   2. à reproduire à l'identique lesdites mentions de propriété\n      intellectuelle sur les copies du Logiciel modifié ou non;\n\n   3. à faire en sorte que l'utilisation du Logiciel, ses mentions de\n      propriété intellectuelle et le fait qu'il est régi par le Contrat\n      soient indiqués dans un texte facilement accessible notamment\n      depuis l'interface de tout Logiciel Dérivé.\n\nLe Licencié s'engage à ne pas porter atteinte, directement ou\nindirectement, aux droits de propriété intellectuelle du Titulaire et/ou\ndes Contributeurs sur le Logiciel et à prendre, le cas échéant, à\nl'égard de son personnel toutes les mesures nécessaires pour assurer le\nrespect des dits droits de propriété intellectuelle du Titulaire et/ou\ndes Contributeurs.\n\n\n    Article 7 - SERVICES ASSOCIES\n\n7.1 Le Contrat n'oblige en aucun cas le Concédant à la réalisation de\nprestations d'assistance technique ou de maintenance du Logiciel.\n\nCependant le Concédant reste libre de proposer ce type de services. Les\ntermes et conditions d'une telle assistance technique et/ou d'une telle\nmaintenance seront alors déterminés dans un acte séparé. Ces actes de\nmaintenance et/ou assistance technique n'engageront que la seule\nresponsabilité du Concédant qui les propose.\n\n7.2 De même, tout Concédant est libre de proposer, sous sa seule\nresponsabilité, à ses licenciés une garantie, qui n'engagera que lui,\nlors de la redistribution du Logiciel et/ou du Logiciel Modifié et ce,\ndans les conditions qu'il souhaite. Cette garantie et les modalités\nfinancières de son application feront l'objet d'un acte séparé entre le\nConcédant et le Licencié.\n\n\n    Article 8 - RESPONSABILITE\n\n8.1 Sous réserve des dispositions de l'article 8.2, le Licencié a la \nfaculté, sous réserve de prouver la faute du Concédant concerné, de\nsolliciter la réparation du préjudice direct qu'il subirait du fait du\nLogiciel et dont il apportera la preuve.\n\n8.2 La responsabilité du Concédant est limitée aux engagements pris en\napplication du Contrat et ne saurait être engagée en raison notamment:\n(i) des dommages dus à l'inexécution, totale ou partielle, de ses\nobligations par le Licencié, (ii) des dommages directs ou indirects\ndécoulant de l'utilisation ou des performances du Logiciel subis par le\nLicencié et (iii) plus généralement d'un quelconque dommage indirect. En\nparticulier, les Parties conviennent expressément que tout préjudice\nfinancier ou commercial (par exemple perte de données, perte de\nbénéfices, perte d'exploitation, perte de clientèle ou de commandes,\nmanque à gagner, trouble commercial quelconque) ou toute action dirigée\ncontre le Licencié par un tiers, constitue un dommage indirect et\nn'ouvre pas droit à réparation par le Concédant.\n\n\n    Article 9 - GARANTIE\n\n9.1 Le Licencié reconnaît que l'état actuel des connaissances\nscientifiques et techniques au moment de la mise en circulation du\nLogiciel ne permet pas d'en tester et d'en vérifier toutes les\nutilisations ni de détecter l'existence d'éventuels défauts. L'attention\ndu Licencié a été attirée sur ce point sur les risques associés au\nchargement, à l'utilisation, la modification et/ou au développement et à\nla reproduction du Logiciel qui sont réservés à des utilisateurs avertis.\n\nIl relève de la responsabilité du Licencié de contrôler, par tous\nmoyens, l'adéquation du produit à ses besoins, son bon fonctionnement et\nde s'assurer qu'il ne causera pas de dommages aux personnes et aux biens.\n\n9.2 Le Concédant déclare de bonne foi être en droit de concéder\nl'ensemble des droits attachés au Logiciel (comprenant notamment les\ndroits visés à l'article 5).\n\n9.3 Le Licencié reconnaît que le Logiciel est fourni \"en l'état\" par le\nConcédant sans autre garantie, expresse ou tacite, que celle prévue à\nl'article 9.2 et notamment sans aucune garantie sur sa valeur commerciale,\nson caractère sécurisé, innovant ou pertinent.\n\nEn particulier, le Concédant ne garantit pas que le Logiciel est exempt\nd'erreur, qu'il fonctionnera sans interruption, qu'il sera compatible\navec l'équipement du Licencié et sa configuration logicielle ni qu'il\nremplira les besoins du Licencié.\n\n9.4 Le Concédant ne garantit pas, de manière expresse ou tacite, que le\nLogiciel ne porte pas atteinte à un quelconque droit de propriété\nintellectuelle d'un tiers portant sur un brevet, un logiciel ou sur tout\nautre droit de propriété. Ainsi, le Concédant exclut toute garantie au\nprofit du Licencié contre les actions en contrefaçon qui pourraient être\ndiligentées au titre de l'utilisation, de la modification, et de la\nredistribution du Logiciel. Néanmoins, si de telles actions sont\nexercées contre le Licencié, le Concédant lui apportera son aide\ntechnique et juridique pour sa défense. Cette aide technique et\njuridique est déterminée au cas par cas entre le Concédant concerné et\nle Licencié dans le cadre d'un protocole d'accord. Le Concédant dégage\ntoute responsabilité quant à l'utilisation de la dénomination du\nLogiciel par le Licencié. Aucune garantie n'est apportée quant à\nl'existence de droits antérieurs sur le nom du Logiciel et sur\nl'existence d'une marque.\n\n\n    Article 10 - RESILIATION\n\n10.1 En cas de manquement par le Licencié aux obligations mises à sa\ncharge par le Contrat, le Concédant pourra résilier de plein droit le\nContrat trente (30) jours après notification adressée au Licencié et\nrestée sans effet.\n\n10.2 Le Licencié dont le Contrat est résilié n'est plus autorisé à\nutiliser, modifier ou distribuer le Logiciel. Cependant, toutes les\nlicences qu'il aura concédées antérieurement à la résiliation du Contrat\nresteront valides sous réserve qu'elles aient été effectuées en\nconformité avec le Contrat.\n\n\n    Article 11 - DISPOSITIONS DIVERSES\n\n\n      11.1 CAUSE EXTERIEURE\n\nAucune des Parties ne sera responsable d'un retard ou d'une défaillance\nd'exécution du Contrat qui serait dû à un cas de force majeure, un cas\nfortuit ou une cause extérieure, telle que, notamment, le mauvais\nfonctionnement ou les interruptions du réseau électrique ou de\ntélécommunication, la paralysie du réseau liée à une attaque\ninformatique, l'intervention des autorités gouvernementales, les\ncatastrophes naturelles, les dégâts des eaux, les tremblements de terre,\nle feu, les explosions, les grèves et les conflits sociaux, l'état de\nguerre...\n\n11.2 Le fait, par l'une ou l'autre des Parties, d'omettre en une ou\nplusieurs occasions de se prévaloir d'une ou plusieurs dispositions du\nContrat, ne pourra en aucun cas impliquer renonciation par la Partie\nintéressée à s'en prévaloir ultérieurement.\n\n11.3 Le Contrat annule et remplace toute convention antérieure, écrite\nou orale, entre les Parties sur le même objet et constitue l'accord\nentier entre les Parties sur cet objet. Aucune addition ou modification\naux termes du Contrat n'aura d'effet à l'égard des Parties à moins\nd'être faite par écrit et signée par leurs représentants dûment habilités.\n\n11.4 Dans l'hypothèse où une ou plusieurs des dispositions du Contrat\ns'avèrerait contraire à une loi ou à un texte applicable, existants ou\nfuturs, cette loi ou ce texte prévaudrait, et les Parties feraient les\namendements nécessaires pour se conformer à cette loi ou à ce texte.\nToutes les autres dispositions resteront en vigueur. De même, la\nnullité, pour quelque raison que ce soit, d'une des dispositions du\nContrat ne saurait entraîner la nullité de l'ensemble du Contrat.\n\n\n      11.5 LANGUE\n\nLe Contrat est rédigé en langue française et en langue anglaise, ces\ndeux versions faisant également foi.\n\n\n    Article 12 - NOUVELLES VERSIONS DU CONTRAT\n\n12.1 Toute personne est autorisée à copier et distribuer des copies de\nce Contrat.\n\n12.2 Afin d'en préserver la cohérence, le texte du Contrat est protégé\net ne peut être modifié que par les auteurs de la licence, lesquels se\nréservent le droit de publier périodiquement des mises à jour ou de\nnouvelles versions du Contrat, qui posséderont chacune un numéro\ndistinct. Ces versions ultérieures seront susceptibles de prendre en\ncompte de nouvelles problématiques rencontrées par les logiciels libres.\n\n12.3 Tout Logiciel diffusé sous une version donnée du Contrat ne pourra\nfaire l'objet d'une diffusion ultérieure que sous la même version du\nContrat ou une version postérieure.\n\n\n    Article 13 - LOI APPLICABLE ET COMPETENCE TERRITORIALE\n\n13.1 Le Contrat est régi par la loi française. Les Parties conviennent\nde tenter de régler à l'amiable les différends ou litiges qui\nviendraient à se produire par suite ou à l'occasion du Contrat.\n\n13.2 A défaut d'accord amiable dans un délai de deux (2) mois à compter\nde leur survenance et sauf situation relevant d'une procédure d'urgence,\nles différends ou litiges seront portés par la Partie la plus diligente\ndevant les Tribunaux compétents de Paris.\n\n\nVersion 1.0 du 2006-09-05.","tag":"LicenseText"}],"raw":{"_category":"Copyleft","_homepageUrl":"http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html","_key":"cecill-c","_name":"CeCILL-C Free Software License Agreement","_notes":"per SPDX.org, English translation can be found here\nhttp://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html\n","_osiUrl":null,"_otherUrls":["http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"_owner":"CeCILL","_shortName":"CeCILL-C License","_spdxId":"CECILL-C","_text":"CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL-C\n\n\n    Avertissement\n\nCe contrat est une licence de logiciel libre issue d'une concertation\nentre ses auteurs afin que le respect de deux grands principes préside à\nsa rédaction:\n\n    * d'une part, le respect des principes de diffusion des logiciels\n      libres: accès au code source, droits étendus conférés aux\n      utilisateurs,\n    * d'autre part, la désignation d'un droit applicable, le droit\n      français, auquel elle est conforme, tant au regard du droit de la\n      responsabilité civile que du droit de la propriété intellectuelle\n      et de la protection qu'il offre aux auteurs et titulaires des\n      droits patrimoniaux sur un logiciel.\n\nLes auteurs de la licence CeCILL-C (pour Ce[a] C[nrs] I[nria] L[ogiciel]\nL[ibre]) sont:\n\nCommissariat à l'Energie Atomique - CEA, établissement public de\nrecherche à caractère scientifique, technique et industriel, dont le\nsiège est situé 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris.\n\nCentre National de la Recherche Scientifique - CNRS, établissement\npublic à caractère scientifique et technologique, dont le siège est\nsitué 3 rue Michel-Ange, 75794 Paris cedex 16.\n\nInstitut National de Recherche en Informatique et en Automatique -\nINRIA, établissement public à caractère scientifique et technologique,\ndont le siège est situé Domaine de Voluceau, Rocquencourt, BP 105, 78153\nLe Chesnay cedex.\n\n\n    Préambule\n\nCe contrat est une licence de logiciel libre dont l'objectif est de\nconférer aux utilisateurs la liberté de modifier et de réutiliser le\nlogiciel régi par cette licence.\n\nL'exercice de cette liberté est assorti d'une obligation de remettre à\nla disposition de la communauté les modifications apportées au code\nsource du logiciel afin de contribuer à son évolution.\n\nL'accessibilité au code source et les droits de copie, de modification\net de redistribution qui découlent de ce contrat ont pour contrepartie\nde n'offrir aux utilisateurs qu'une garantie limitée et de ne faire\npeser sur l'auteur du logiciel, le titulaire des droits patrimoniaux et\nles concédants successifs qu'une responsabilité restreinte.\n\nA cet égard l'attention de l'utilisateur est attirée sur les risques\nassociés au chargement, à l'utilisation, à la modification et/ou au\ndéveloppement et à la reproduction du logiciel par l'utilisateur étant\ndonné sa spécificité de logiciel libre, qui peut le rendre complexe à\nmanipuler et qui le réserve donc à des développeurs ou des\nprofessionnels avertis possédant des connaissances informatiques\napprofondies. Les utilisateurs sont donc invités à charger et tester\nl'adéquation du logiciel à leurs besoins dans des conditions permettant\nd'assurer la sécurité de leurs systèmes et/ou de leurs données et, plus\ngénéralement, à l'utiliser et l'exploiter dans les mêmes conditions de\nsécurité. Ce contrat peut être reproduit et diffusé librement, sous\nréserve de le conserver en l'état, sans ajout ni suppression de clauses.\n\nCe contrat est susceptible de s'appliquer à tout logiciel dont le\ntitulaire des droits patrimoniaux décide de soumettre l'exploitation aux\ndispositions qu'il contient.\n\n\n    Article 1 - DEFINITIONS\n\nDans ce contrat, les termes suivants, lorsqu'ils seront écrits avec une\nlettre capitale, auront la signification suivante:\n\nContrat: désigne le présent contrat de licence, ses éventuelles versions\npostérieures et annexes.\n\nLogiciel: désigne le logiciel sous sa forme de Code Objet et/ou de Code\nSource et le cas échéant sa documentation, dans leur état au moment de\nl'acceptation du Contrat par le Licencié.\n\nLogiciel Initial: désigne le Logiciel sous sa forme de Code Source et\néventuellement de Code Objet et le cas échéant sa documentation, dans\nleur état au moment de leur première diffusion sous les termes du Contrat.\n\nLogiciel Modifié: désigne le Logiciel modifié par au moins une\nContribution Intégrée.\n\nCode Source: désigne l'ensemble des instructions et des lignes de\nprogramme du Logiciel et auquel l'accès est nécessaire en vue de\nmodifier le Logiciel.\n\nCode Objet: désigne les fichiers binaires issus de la compilation du\nCode Source.\n\nTitulaire: désigne le ou les détenteurs des droits patrimoniaux d'auteur\nsur le Logiciel Initial.\n\nLicencié: désigne le ou les utilisateurs du Logiciel ayant accepté le\nContrat.\n\nContributeur: désigne le Licencié auteur d'au moins une Contribution\nIntégrée.\n\nConcédant: désigne le Titulaire ou toute personne physique ou morale\ndistribuant le Logiciel sous le Contrat.\n\nContribution Intégrée: désigne l'ensemble des modifications,\ncorrections, traductions, adaptations et/ou nouvelles fonctionnalités\nintégrées dans le Code Source par tout Contributeur.\n\nModule Lié: désigne un ensemble de fichiers sources y compris leur\ndocumentation qui, sans modification du Code Source, permet de réaliser\ndes fonctionnalités ou services supplémentaires à ceux fournis par le\nLogiciel.\n\nLogiciel Dérivé: désigne toute combinaison du Logiciel, modifié ou non,\net d'un Module Lié.\n\nParties: désigne collectivement le Licencié et le Concédant.\n\nCes termes s'entendent au singulier comme au pluriel.\n\n\n    Article 2 - OBJET\n\nLe Contrat a pour objet la concession par le Concédant au Licencié d'une\nlicence non exclusive, cessible et mondiale du Logiciel telle que\ndéfinie ci-après à l'article 5 pour toute la durée de protection des droits\nportant sur ce Logiciel.\n\n\n    Article 3 - ACCEPTATION\n\n3.1 L'acceptation par le Licencié des termes du Contrat est réputée\nacquise du fait du premier des faits suivants:\n\n    * (i) le chargement du Logiciel par tout moyen notamment par\n      téléchargement à partir d'un serveur distant ou par chargement à\n      partir d'un support physique;\n    * (ii) le premier exercice par le Licencié de l'un quelconque des\n      droits concédés par le Contrat.\n\n3.2 Un exemplaire du Contrat, contenant notamment un avertissement\nrelatif aux spécificités du Logiciel, à la restriction de garantie et à\nla limitation à un usage par des utilisateurs expérimentés a été mis à\ndisposition du Licencié préalablement à son acceptation telle que\ndéfinie à l'article 3.1 ci dessus et le Licencié reconnaît en avoir pris\nconnaissance.\n\n\n    Article 4 - ENTREE EN VIGUEUR ET DUREE\n\n\n      4.1 ENTREE EN VIGUEUR\n\nLe Contrat entre en vigueur à la date de son acceptation par le Licencié\ntelle que définie en 3.1.\n\n\n      4.2 DUREE\n\nLe Contrat produira ses effets pendant toute la durée légale de\nprotection des droits patrimoniaux portant sur le Logiciel.\n\n\n    Article 5 - ETENDUE DES DROITS CONCEDES\n\nLe Concédant concède au Licencié, qui accepte, les droits suivants sur\nle Logiciel pour toutes destinations et pour la durée du Contrat dans\nles conditions ci-après détaillées.\n\nPar ailleurs, si le Concédant détient ou venait à détenir un ou\nplusieurs brevets d'invention protégeant tout ou partie des\nfonctionnalités du Logiciel ou de ses composants, il s'engage à ne pas\nopposer les éventuels droits conférés par ces brevets aux Licenciés\nsuccessifs qui utiliseraient, exploiteraient ou modifieraient le\nLogiciel. En cas de cession de ces brevets, le Concédant s'engage à\nfaire reprendre les obligations du présent alinéa aux cessionnaires.\n\n\n      5.1 DROIT D'UTILISATION\n\nLe Licencié est autorisé à utiliser le Logiciel, sans restriction quant\naux domaines d'application, étant ci-après précisé que cela comporte:\n\n   1. la reproduction permanente ou provisoire du Logiciel en tout ou\n      partie par tout moyen et sous toute forme.\n\n   2. le chargement, l'affichage, l'exécution, ou le stockage du\n      Logiciel sur tout support.\n\n   3. la possibilité d'en observer, d'en étudier, ou d'en tester le\n      fonctionnement afin de déterminer les idées et principes qui sont\n      à la base de n'importe quel élément de ce Logiciel; et ceci,\n      lorsque le Licencié effectue toute opération de chargement,\n      d'affichage, d'exécution, de transmission ou de stockage du\n      Logiciel qu'il est en droit d'effectuer en vertu du Contrat.\n\n\n      5.2 DROIT DE MODIFICATION\n\nLe droit de modification comporte le droit de traduire, d'adapter,\nd'arranger ou d'apporter toute autre modification au Logiciel et le\ndroit de reproduire le logiciel en résultant. Il comprend en particulier\nle droit de créer un Logiciel Dérivé.\n\nLe Licencié est autorisé à apporter toute modification au Logiciel sous\nréserve de mentionner, de façon explicite, son nom en tant qu'auteur de\ncette modification et la date de création de celle-ci.\n\n\n      5.3 DROIT DE DISTRIBUTION\n\nLe droit de distribution comporte notamment le droit de diffuser, de\ntransmettre et de communiquer le Logiciel au public sur tout support et\npar tout moyen ainsi que le droit de mettre sur le marché à titre\nonéreux ou gratuit, un ou des exemplaires du Logiciel par tout procédé.\n\nLe Licencié est autorisé à distribuer des copies du Logiciel, modifié ou\nnon, à des tiers dans les conditions ci-après détaillées.\n\n\n        5.3.1 DISTRIBUTION DU LOGICIEL SANS MODIFICATION\n\nLe Licencié est autorisé à distribuer des copies conformes du Logiciel,\nsous forme de Code Source ou de Code Objet, à condition que cette\ndistribution respecte les dispositions du Contrat dans leur totalité et\nsoit accompagnée:\n\n   1. d'un exemplaire du Contrat,\n\n   2. d'un avertissement relatif à la restriction de garantie et de\n      responsabilité du Concédant telle que prévue aux articles 8\n      et 9,\n\net que, dans le cas où seul le Code Objet du Logiciel est redistribué,\nle Licencié permette un accès effectif au Code Source complet du\nLogiciel pendant au moins toute la durée de sa distribution du Logiciel,\nétant entendu que le coût additionnel d'acquisition du Code Source ne\ndevra pas excéder le simple coût de transfert des données.\n\n\n        5.3.2 DISTRIBUTION DU LOGICIEL MODIFIE\n\nLorsque le Licencié apporte une Contribution Intégrée au Logiciel, les\nconditions de distribution du Logiciel Modifié en résultant sont alors\nsoumises à l'intégralité des dispositions du Contrat.\n\nLe Licencié est autorisé à distribuer le Logiciel Modifié sous forme de\ncode source ou de code objet, à condition que cette distribution\nrespecte les dispositions du Contrat dans leur totalité et soit\naccompagnée:\n\n   1. d'un exemplaire du Contrat,\n\n   2. d'un avertissement relatif à la restriction de garantie et de\n      responsabilité du Concédant telle que prévue aux articles 8\n      et 9,\n\net que, dans le cas où seul le code objet du Logiciel Modifié est\nredistribué, le Licencié permette un accès effectif à son code source\ncomplet pendant au moins toute la durée de sa distribution du Logiciel\nModifié, étant entendu que le coût additionnel d'acquisition du code\nsource ne devra pas excéder le simple coût de transfert des données.\n\n\n        5.3.3 DISTRIBUTION DU LOGICIEL DERIVE\n\nLorsque le Licencié crée un Logiciel Dérivé, ce Logiciel Dérivé peut\nêtre distribué sous un contrat de licence autre que le présent Contrat à\ncondition de respecter les obligations de mention des droits sur le\nLogiciel telles que définies à l'article 6.4. Dans le cas où la création du\nLogiciel Dérivé a nécessité une modification du Code Source le licencié\ns'engage à ce que: \n\n   1. le Logiciel Modifié correspondant à cette modification soit régi\n      par le présent Contrat,\n   2. les Contributions Intégrées dont le Logiciel Modifié résulte\n      soient clairement identifiées et documentées,\n   3. le Licencié permette un accès effectif au code source du Logiciel\n      Modifié, pendant au moins toute la durée de la distribution du\n      Logiciel Dérivé, de telle sorte que ces modifications puissent\n      être reprises dans une version ultérieure du Logiciel, étant\n      entendu que le coût additionnel d'acquisition du code source du\n      Logiciel Modifié ne devra pas excéder le simple coût du transfert\n      des données.\n\n\n        5.3.4 COMPATIBILITE AVEC LA LICENCE CeCILL\n\nLorsqu'un Logiciel Modifié contient une Contribution Intégrée soumise au\ncontrat de licence CeCILL, ou lorsqu'un Logiciel Dérivé contient un\nModule Lié soumis au contrat de licence CeCILL, les stipulations prévues\nau troisième item de l'article 6.4 sont facultatives.\n\n\n    Article 6 - PROPRIETE INTELLECTUELLE\n\n\n      6.1 SUR LE LOGICIEL INITIAL\n\nLe Titulaire est détenteur des droits patrimoniaux sur le Logiciel\nInitial. Toute utilisation du Logiciel Initial est soumise au respect\ndes conditions dans lesquelles le Titulaire a choisi de diffuser son\noeuvre et nul autre n'a la faculté de modifier les conditions de\ndiffusion de ce Logiciel Initial.\n\nLe Titulaire s'engage à ce que le Logiciel Initial reste au moins régi\npar le Contrat et ce, pour la durée visée à l'article 4.2.\n\n\n      6.2 SUR LES CONTRIBUTIONS INTEGREES\n\nLe Licencié qui a développé une Contribution Intégrée est titulaire sur\ncelle-ci des droits de propriété intellectuelle dans les conditions\ndéfinies par la législation applicable.\n\n\n      6.3 SUR LES MODULES LIES\n\nLe Licencié qui a développé un Module Lié est titulaire sur celui-ci des\ndroits de propriété intellectuelle dans les conditions définies par la\nlégislation applicable et reste libre du choix du contrat régissant sa\ndiffusion dans les conditions définies à l'article 5.3.3.\n\n\n      6.4 MENTIONS DES DROITS\n\nLe Licencié s'engage expressément:\n\n   1. à ne pas supprimer ou modifier de quelque manière que ce soit les\n      mentions de propriété intellectuelle apposées sur le Logiciel;\n\n   2. à reproduire à l'identique lesdites mentions de propriété\n      intellectuelle sur les copies du Logiciel modifié ou non;\n\n   3. à faire en sorte que l'utilisation du Logiciel, ses mentions de\n      propriété intellectuelle et le fait qu'il est régi par le Contrat\n      soient indiqués dans un texte facilement accessible notamment\n      depuis l'interface de tout Logiciel Dérivé.\n\nLe Licencié s'engage à ne pas porter atteinte, directement ou\nindirectement, aux droits de propriété intellectuelle du Titulaire et/ou\ndes Contributeurs sur le Logiciel et à prendre, le cas échéant, à\nl'égard de son personnel toutes les mesures nécessaires pour assurer le\nrespect des dits droits de propriété intellectuelle du Titulaire et/ou\ndes Contributeurs.\n\n\n    Article 7 - SERVICES ASSOCIES\n\n7.1 Le Contrat n'oblige en aucun cas le Concédant à la réalisation de\nprestations d'assistance technique ou de maintenance du Logiciel.\n\nCependant le Concédant reste libre de proposer ce type de services. Les\ntermes et conditions d'une telle assistance technique et/ou d'une telle\nmaintenance seront alors déterminés dans un acte séparé. Ces actes de\nmaintenance et/ou assistance technique n'engageront que la seule\nresponsabilité du Concédant qui les propose.\n\n7.2 De même, tout Concédant est libre de proposer, sous sa seule\nresponsabilité, à ses licenciés une garantie, qui n'engagera que lui,\nlors de la redistribution du Logiciel et/ou du Logiciel Modifié et ce,\ndans les conditions qu'il souhaite. Cette garantie et les modalités\nfinancières de son application feront l'objet d'un acte séparé entre le\nConcédant et le Licencié.\n\n\n    Article 8 - RESPONSABILITE\n\n8.1 Sous réserve des dispositions de l'article 8.2, le Licencié a la \nfaculté, sous réserve de prouver la faute du Concédant concerné, de\nsolliciter la réparation du préjudice direct qu'il subirait du fait du\nLogiciel et dont il apportera la preuve.\n\n8.2 La responsabilité du Concédant est limitée aux engagements pris en\napplication du Contrat et ne saurait être engagée en raison notamment:\n(i) des dommages dus à l'inexécution, totale ou partielle, de ses\nobligations par le Licencié, (ii) des dommages directs ou indirects\ndécoulant de l'utilisation ou des performances du Logiciel subis par le\nLicencié et (iii) plus généralement d'un quelconque dommage indirect. En\nparticulier, les Parties conviennent expressément que tout préjudice\nfinancier ou commercial (par exemple perte de données, perte de\nbénéfices, perte d'exploitation, perte de clientèle ou de commandes,\nmanque à gagner, trouble commercial quelconque) ou toute action dirigée\ncontre le Licencié par un tiers, constitue un dommage indirect et\nn'ouvre pas droit à réparation par le Concédant.\n\n\n    Article 9 - GARANTIE\n\n9.1 Le Licencié reconnaît que l'état actuel des connaissances\nscientifiques et techniques au moment de la mise en circulation du\nLogiciel ne permet pas d'en tester et d'en vérifier toutes les\nutilisations ni de détecter l'existence d'éventuels défauts. L'attention\ndu Licencié a été attirée sur ce point sur les risques associés au\nchargement, à l'utilisation, la modification et/ou au développement et à\nla reproduction du Logiciel qui sont réservés à des utilisateurs avertis.\n\nIl relève de la responsabilité du Licencié de contrôler, par tous\nmoyens, l'adéquation du produit à ses besoins, son bon fonctionnement et\nde s'assurer qu'il ne causera pas de dommages aux personnes et aux biens.\n\n9.2 Le Concédant déclare de bonne foi être en droit de concéder\nl'ensemble des droits attachés au Logiciel (comprenant notamment les\ndroits visés à l'article 5).\n\n9.3 Le Licencié reconnaît que le Logiciel est fourni \"en l'état\" par le\nConcédant sans autre garantie, expresse ou tacite, que celle prévue à\nl'article 9.2 et notamment sans aucune garantie sur sa valeur commerciale,\nson caractère sécurisé, innovant ou pertinent.\n\nEn particulier, le Concédant ne garantit pas que le Logiciel est exempt\nd'erreur, qu'il fonctionnera sans interruption, qu'il sera compatible\navec l'équipement du Licencié et sa configuration logicielle ni qu'il\nremplira les besoins du Licencié.\n\n9.4 Le Concédant ne garantit pas, de manière expresse ou tacite, que le\nLogiciel ne porte pas atteinte à un quelconque droit de propriété\nintellectuelle d'un tiers portant sur un brevet, un logiciel ou sur tout\nautre droit de propriété. Ainsi, le Concédant exclut toute garantie au\nprofit du Licencié contre les actions en contrefaçon qui pourraient être\ndiligentées au titre de l'utilisation, de la modification, et de la\nredistribution du Logiciel. Néanmoins, si de telles actions sont\nexercées contre le Licencié, le Concédant lui apportera son aide\ntechnique et juridique pour sa défense. Cette aide technique et\njuridique est déterminée au cas par cas entre le Concédant concerné et\nle Licencié dans le cadre d'un protocole d'accord. Le Concédant dégage\ntoute responsabilité quant à l'utilisation de la dénomination du\nLogiciel par le Licencié. Aucune garantie n'est apportée quant à\nl'existence de droits antérieurs sur le nom du Logiciel et sur\nl'existence d'une marque.\n\n\n    Article 10 - RESILIATION\n\n10.1 En cas de manquement par le Licencié aux obligations mises à sa\ncharge par le Contrat, le Concédant pourra résilier de plein droit le\nContrat trente (30) jours après notification adressée au Licencié et\nrestée sans effet.\n\n10.2 Le Licencié dont le Contrat est résilié n'est plus autorisé à\nutiliser, modifier ou distribuer le Logiciel. Cependant, toutes les\nlicences qu'il aura concédées antérieurement à la résiliation du Contrat\nresteront valides sous réserve qu'elles aient été effectuées en\nconformité avec le Contrat.\n\n\n    Article 11 - DISPOSITIONS DIVERSES\n\n\n      11.1 CAUSE EXTERIEURE\n\nAucune des Parties ne sera responsable d'un retard ou d'une défaillance\nd'exécution du Contrat qui serait dû à un cas de force majeure, un cas\nfortuit ou une cause extérieure, telle que, notamment, le mauvais\nfonctionnement ou les interruptions du réseau électrique ou de\ntélécommunication, la paralysie du réseau liée à une attaque\ninformatique, l'intervention des autorités gouvernementales, les\ncatastrophes naturelles, les dégâts des eaux, les tremblements de terre,\nle feu, les explosions, les grèves et les conflits sociaux, l'état de\nguerre...\n\n11.2 Le fait, par l'une ou l'autre des Parties, d'omettre en une ou\nplusieurs occasions de se prévaloir d'une ou plusieurs dispositions du\nContrat, ne pourra en aucun cas impliquer renonciation par la Partie\nintéressée à s'en prévaloir ultérieurement.\n\n11.3 Le Contrat annule et remplace toute convention antérieure, écrite\nou orale, entre les Parties sur le même objet et constitue l'accord\nentier entre les Parties sur cet objet. Aucune addition ou modification\naux termes du Contrat n'aura d'effet à l'égard des Parties à moins\nd'être faite par écrit et signée par leurs représentants dûment habilités.\n\n11.4 Dans l'hypothèse où une ou plusieurs des dispositions du Contrat\ns'avèrerait contraire à une loi ou à un texte applicable, existants ou\nfuturs, cette loi ou ce texte prévaudrait, et les Parties feraient les\namendements nécessaires pour se conformer à cette loi ou à ce texte.\nToutes les autres dispositions resteront en vigueur. De même, la\nnullité, pour quelque raison que ce soit, d'une des dispositions du\nContrat ne saurait entraîner la nullité de l'ensemble du Contrat.\n\n\n      11.5 LANGUE\n\nLe Contrat est rédigé en langue française et en langue anglaise, ces\ndeux versions faisant également foi.\n\n\n    Article 12 - NOUVELLES VERSIONS DU CONTRAT\n\n12.1 Toute personne est autorisée à copier et distribuer des copies de\nce Contrat.\n\n12.2 Afin d'en préserver la cohérence, le texte du Contrat est protégé\net ne peut être modifié que par les auteurs de la licence, lesquels se\nréservent le droit de publier périodiquement des mises à jour ou de\nnouvelles versions du Contrat, qui posséderont chacune un numéro\ndistinct. Ces versions ultérieures seront susceptibles de prendre en\ncompte de nouvelles problématiques rencontrées par les logiciels libres.\n\n12.3 Tout Logiciel diffusé sous une version donnée du Contrat ne pourra\nfaire l'objet d'une diffusion ultérieure que sous la même version du\nContrat ou une version postérieure.\n\n\n    Article 13 - LOI APPLICABLE ET COMPETENCE TERRITORIALE\n\n13.1 Le Contrat est régi par la loi française. Les Parties conviennent\nde tenter de régler à l'amiable les différends ou litiges qui\nviendraient à se produire par suite ou à l'occasion du Contrat.\n\n13.2 A défaut d'accord amiable dans un délai de deux (2) mois à compter\nde leur survenance et sauf situation relevant d'une procédure d'urgence,\nles différends ou litiges seront portés par la Partie la plus diligente\ndevant les Tribunaux compétents de Paris.\n\n\nVersion 1.0 du 2006-09-05.","_textUrls":["http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html","http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.txt"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:CECILL-C","tag":"LN"},[{"contents":"CeCILL-C Free Software License Agreement","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","e6f4ba649c13b4d43d776a21005561ca"],"impliedStmts":[{"contents":{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","French version can be found here: http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"CeCILL-C FREE SOFTWARE LICENSE AGREEMENT Notice\n\nThis Agreement is a Free Software license agreement that is the result of discussions between its authors in order to ensure compliance with the two main principles guiding its drafting:\n\n   * firstly, compliance with the principles governing the distribution of Free Software: access to source code, broad rights granted to users,\n\n   * secondly, the election of a governing law, French law, with which it is conformant, both as regards the law of torts and intellectual property law, and the protection that it offers to both authors and holders of the economic rights over software.\n\nThe authors of the CeCILL¹ license are:\n\n   \n\n   Commissariat à l'Energie Atomique - CEA, a public scientific, technical and industrial research establishment, having its principal place of business at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n\n   \n\n   Centre National de la Recherche Scientifique - CNRS, a public scientific and technological establishment, having its principal place of business at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n\n   \n\n   Institut National de Recherche en Informatique et en Automatique - INRIA, a public scientific and technological establishment, having its principal place of business at Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le Chesnay cedex, France.\n\n   Preamble The purpose of this Free Software license agreement is to grant users the right to modify and re-use the software governed by this license.\n\n   The exercising of this right is conditional upon the obligation to make available to the community the modifications made to the source code of the software so as to contribute to its evolution.\n\n   In consideration of access to the source code and the rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software's author, the holder of the economic rights, and the successive licensors only have limited liability.\n\n   In this respect, the risks associated with loading, using, modifying and/or developing or reproducing the software by the user are brought to the user's attention, given its Free Software status, which may make it complicated to use, with the result that its use is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the suitability of the software as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions of security. This Agreement may be freely reproduced and published, provided it is not altered, and that no provisions are either added or removed herefrom.\n\n   This Agreement may apply to any or all software for which the holder of the economic rights decides to submit the use thereof to its provisions.\n\n   Article 1 - DEFINITIONS\n\n   For the purpose of this Agreement, when the following expressions commence with a capital letter, they shall have the following meaning:\n\n      \n\n      Agreement: means this license agreement, and its possible subsequent versions and annexes.\n\n      \n\n      Software: means the software in its Object Code and/or Source Code form and, where applicable, its documentation, \"as is\" when the Licensee accepts the Agreement.\n\n      \n\n      Initial Software: means the Software in its Source Code and possibly its Object Code form and, where applicable, its documentation, \"as is\" when it is first distributed under the terms and conditions of the Agreement.\n\n      \n\n      Modified Software: means the Software modified by at least one Integrated Contribution.\n\n      \n\n      Source Code: means all the Software's instructions and program lines to which access is required so as to modify the Software.\n\n      \n\n      Object Code: means the binary files originating from the compilation of the Source Code.\n\n      \n\n      Holder: means the holder(s) of the economic rights over the Initial Software.\n\n      \n\n      Licensee: means the Software user(s) having accepted the Agreement.\n\n      \n\n      Contributor: means a Licensee having made at least one Integrated Contribution.\n\n      \n\n      Licensor: means the Holder, or any other individual or legal entity, who distributes the Software under the Agreement.\n\n      \n\n      Integrated Contribution: means any or all modifications, corrections, translations, adaptations and/or new functions integrated into the Source Code by any or all Contributors.\n\n      \n\n      Related Module: means a set of sources files including their documentation that, without modification to the Source Code, enables supplementary functions or services in addition to those offered by the Software.\n\n      \n\n      Derivative Software: means any combination of the Software, modified or not, and of a Related Module.\n\n      \n\n      Parties: mean both the Licensee and the Licensor.\n\n   These expressions may be used both in singular and plural form.\n\n   Article 2 - PURPOSE\n\n   The purpose of the Agreement is the grant by the Licensor to the Licensee of a non-exclusive, transferable and worldwide license for the Software as set forth in Article 5 hereinafter for the whole term of the protection granted by the rights over said Software.\n\n   Article 3 - ACCEPTANCE\n\n      3.1 The Licensee shall be deemed as having accepted the terms and conditions of this Agreement upon the occurrence of the first of the following events:\n\n         (i) loading the Software by any or all means, notably, by downloading from a remote server, or by loading from a physical medium;\n\n         (ii) the first time the Licensee exercises any of the rights granted hereunder.\n\n      3.2 One copy of the Agreement, containing a notice relating to the characteristics of the Software, to the limited warranty, and to the fact that its use is restricted to experienced users has been provided to the Licensee prior to its acceptance as set forth in Article 3.1 hereinabove, and the Licensee hereby acknowledges that it has read and understood it.\n\n   Article 4 - EFFECTIVE DATE AND TERM\n\n      4.1 EFFECTIVE DATE\n\n      The Agreement shall become effective on the date when it is accepted by the Licensee as set forth in Article 3.1.\n\n      4.2 TERM\n\n      The Agreement shall remain in force for the entire legal term of protection of the economic rights over the Software.\n\n   Article 5 - SCOPE OF RIGHTS GRANTED\n\n   The Licensor hereby grants to the Licensee, who accepts, the following rights over the Software for any or all use, and for the term of the Agreement, on the basis of the terms and conditions set forth hereinafter.\n\n   Besides, if the Licensor owns or comes to own one or more patents protecting all or part of the functions of the Software or of its components, the Licensor undertakes not to enforce the rights granted by these patents against successive Licensees using, exploiting or modifying the Software. If these patents are transferred, the Licensor undertakes to have the transferees subscribe to the obligations set forth in this paragraph.\n\n      5.1 RIGHT OF USE\n\n      The Licensee is authorized to use the Software, without any limitation as to its fields of application, with it being hereinafter specified that this comprises:\n\n         1. permanent or temporary reproduction of all or part of the Software by any or all means and in any or all form.\n\n         2. loading, displaying, running, or storing the Software on any or all medium.\n\n         3. entitlement to observe, study or test its operation so as to determine the ideas and principles behind any or all constituent elements of said Software. This shall apply when the Licensee carries out any or all loading, displaying, running, transmission or storage operation as regards the Software, that it is entitled to carry out hereunder.\n\n      5.2 RIGHT OF MODIFICATION\n\n      The right of modification includes the right to translate, adapt, arrange, or make any or all modifications to the Software, and the right to reproduce the resulting software. It includes, in particular, the right to create a Derivative Software.\n\n      The Licensee is authorized to make any or all modification to the Software provided that it includes an explicit notice that it is the author of said modification and indicates the date of the creation thereof.\n\n      5.3 RIGHT OF DISTRIBUTION\n\n      In particular, the right of distribution includes the right to publish, transmit and communicate the Software to the general public on any or all medium, and by any or all means, and the right to market, either in consideration of a fee, or free of charge, one or more copies of the Software by any means.\n\n      The Licensee is further authorized to distribute copies of the modified or unmodified Software to third parties according to the terms and conditions set forth hereinafter.\n\n         5.3.1. DISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\n         The Licensee is authorized to distribute true copies of the Software in Source Code or Object Code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            1. a copy of the Agreement,\n\n            2. a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the Object Code of the Software is redistributed, the Licensee allows effective access to the full Source Code of the Software at a minimum during the entire period of its distribution of the Software, it being understood that the additional cost of acquiring the Source Code shall not exceed the cost of transferring the data.\n\n         5.3.2. DISTRIBUTION OF MODIFIED SOFTWARE\n\n         When the Licensee makes an Integrated Contribution to the Software, the terms and conditions for the distribution of the resulting Modified Software become subject to all the provisions of this Agreement.\n\n         The Licensee is authorized to distribute the Modified Software, in source code or object code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            1. a copy of the Agreement,\n\n            2. a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the object code of the Modified Software is redistributed, the Licensee allows effective access to the full source code of the Modified Software at a minimum during the entire period of its distribution of the Modified Software, it being understood that the additional cost of acquiring the source code shall not exceed the cost of transferring the data.\n\n         5.3.3. DISTRIBUTION OF DERIVATIVE SOFTWARE\n\n         When the Licensee creates Derivative Software, this Derivative Software may be distributed under a license agreement other than this Agreement, subject to compliance with the requirement to include a notice concerning the rights over the Software as defined in Article 6.4. In the event the creation of the Derivative Software required modification of the Source Code, the Licensee undertakes that:\n\n            1. the resulting Modified Software will be governed by this Agreement,\n\n            2. the Integrated Contributions in the resulting Modified Software will be clearly identified and documented,\n\n            3. the Licensee will allow effective access to the source code of the Modified Software, at a minimum during the entire period of distribution of the Derivative Software, such that such modifications may be carried over in a subsequent version of the Software; it being understood that the additional cost of purchasing the source code of the Modified Software shall not exceed the cost of transferring the data.\n\n         5.3.4. COMPATIBILITY WITH THE CeCILL LICENSE\n\n         When a Modified Software contains an Integrated Contribution subject to the CeCILL license agreement, or when a Derivative Software contains a Related Module subject to the CeCILL license agreement, the provisions set forth in the third item of Article 6.4 are optional.\n\n   Article 6 - INTELLECTUAL PROPERTY\n\n      6.1 OVER THE INITIAL SOFTWARE\n\n      The Holder owns the economic rights over the Initial Software. Any or all use of the Initial Software is subject to compliance with the terms and conditions under which the Holder has elected to distribute its work and no one shall be entitled to modify the terms and conditions for the distribution of said Initial Software.\n\n      The Holder undertakes that the Initial Software will remain ruled at least by this Agreement, for the duration set forth in Article 4.2.\n\n      6.2 OVER THE INTEGRATED CONTRIBUTIONS\n\n      The Licensee who develops an Integrated Contribution is the owner of the intellectual property rights over this Contribution as defined by applicable law.\n\n      6.3 OVER THE RELATED MODULES\n\n      The Licensee who develops a Related Module is the owner of the intellectual property rights over this Related Module as defined by applicable law and is free to choose the type of agreement that shall govern its distribution under the conditions defined in Article 5.3.3.\n\n      6.4 NOTICE OF RIGHTS\n\n      The Licensee expressly undertakes:\n\n         1. not to remove, or modify, in any manner, the intellectual property notices attached to the Software;\n\n         2. to reproduce said notices, in an identical manner, in the copies of the Software modified or not;\n\n         3. to ensure that use of the Software, its intellectual property notices and the fact that it is governed by the Agreement is indicated in a text that is easily accessible, specifically from the interface of any Derivative Software.\n\n      The Licensee undertakes not to directly or indirectly infringe the intellectual property rights of the Holder and/or Contributors on the Software and to take, where applicable, vis-à-vis its staff, any and all measures required to ensure respect of said intellectual property rights of the Holder and/or Contributors.\n\n   Article 7 - RELATED SERVICES\n\n      7.1 Under no circumstances shall the Agreement oblige the Licensor to provide technical assistance or maintenance services for the Software.\n\n      However, the Licensor is entitled to offer this type of services. The terms and conditions of such technical assistance, and/or such maintenance, shall be set forth in a separate instrument. Only the Licensor offering said maintenance and/or technical assistance services shall incur liability therefor.\n\n      7.2 Similarly, any Licensor is entitled to offer to its licensees, under its sole responsibility, a warranty, that shall only be binding upon itself, for the redistribution of the Software and/or the Modified Software, under terms and conditions that it is free to decide. Said warranty, and the financial terms and conditions of its application, shall be subject of a separate instrument executed between the Licensor and the Licensee.\n\n   Article 8 - LIABILITY\n\n      8.1 Subject to the provisions of Article 8.2, the Licensee shall be entitled to claim compensation for any direct loss it may have suffered from the Software as a result of a fault on the part of the relevant Licensor, subject to providing evidence thereof.\n\n      8.2 The Licensor's liability is limited to the commitments made under this Agreement and shall not be incurred as a result of in particular: (i) loss due the Licensee's total or partial failure to fulfill its obligations, (ii) direct or consequential loss that is suffered by the Licensee due to the use or performance of the Software, and (iii) more generally, any consequential loss. In particular the Parties expressly agree that any or all pecuniary or business loss (i.e. loss of data, loss of profits, operating loss, loss of customers or orders, opportunity cost, any disturbance to business activities) or any or all legal proceedings instituted against the Licensee by a third party, shall constitute consequential loss and shall not provide entitlement to any or all compensation from the Licensor.\n\n   Article 9 - WARRANTY\n\n      9.1 The Licensee acknowledges that the scientific and technical state-of-the-art when the Software was distributed did not enable all possible uses to be tested and verified, nor for the presence of possible defects to be detected. In this respect, the Licensee's attention has been drawn to the risks associated with loading, using, modifying and/or developing and reproducing the Software which are reserved for experienced users.\n\n      The Licensee shall be responsible for verifying, by any or all means, the suitability of the product for its requirements, its good working order, and for ensuring that it shall not cause damage to either persons or properties.\n\n      9.2 The Licensor hereby represents, in good faith, that it is entitled to grant all the rights over the Software (including in particular the rights set forth in Article 5).\n\n      9.3 The Licensee acknowledges that the Software is supplied \"as is\" by the Licensor without any other express or tacit warranty, other than that provided for in Article 9.2 and, in particular, without any warranty as to its commercial value, its secured, safe, innovative or relevant nature.\n\n      Specifically, the Licensor does not warrant that the Software is free from any error, that it will operate without interruption, that it will be compatible with the Licensee's own equipment and software configuration, nor that it will meet the Licensee's requirements.\n\n      9.4 The Licensor does not either expressly or tacitly warrant that the Software does not infringe any third party intellectual property right relating to a patent, software or any other property right. Therefore, the Licensor disclaims any and all liability towards the Licensee arising out of any or all proceedings for infringement that may be instituted in respect of the use, modification and redistribution of the Software. Nevertheless, should such proceedings be instituted against the Licensee, the Licensor shall provide it with technical and legal assistance for its defense. Such technical and legal assistance shall be decided on a case-by-case basis between the relevant Licensor and the Licensee pursuant to a memorandum of understanding. The Licensor disclaims any and all liability as regards the Licensee's use of the name of the Software. No warranty is given as regards the existence of prior rights over the name of the Software or as regards the existence of a trademark.\n\n   Article 10 - TERMINATION\n\n      10.1 In the event of a breach by the Licensee of its obligations hereunder, the Licensor may automatically terminate this Agreement thirty (30) days after notice has been sent to the Licensee and has remained ineffective.\n\n      10.2 A Licensee whose Agreement is terminated shall no longer be authorized to use, modify or distribute the Software. However, any licenses that it may have granted prior to termination of the Agreement shall remain valid subject to their having been granted in compliance with the terms and conditions hereof.\n\n   Article 11 - MISCELLANEOUS\n\n      11.1 EXCUSABLE EVENTS\n\n      Neither Party shall be liable for any or all delay, or failure to perform the Agreement, that may be attributable to an event of force majeure, an act of God or an outside cause, such as defective functioning or interruptions of the electricity or telecommunications networks, network paralysis following a virus attack, intervention by government authorities, natural disasters, water damage, earthquakes, fire, explosions, strikes and labor unrest, war, etc.\n\n      11.2 Any failure by either Party, on one or more occasions, to invoke one or more of the provisions hereof, shall under no circumstances be interpreted as being a waiver by the interested Party of its right to invoke said provision(s) subsequently.\n\n      11.3 The Agreement cancels and replaces any or all previous agreements, whether written or oral, between the Parties and having the same purpose, and constitutes the entirety of the agreement between said Parties concerning said purpose. No supplement or modification to the terms and conditions hereof shall be effective as between the Parties unless it is made in writing and signed by their duly authorized representatives.\n\n      11.4 In the event that one or more of the provisions hereof were to conflict with a current or future applicable act or legislative text, said act or legislative text shall prevail, and the Parties shall make the necessary amendments so as to comply with said act or legislative text. All other provisions shall remain effective. Similarly, invalidity of a provision of the Agreement, for any reason whatsoever, shall not cause the Agreement as a whole to be invalid.\n\n      11.5 LANGUAGE\n\n      The Agreement is drafted in both French and English and both versions are deemed authentic.\n\n   Article 12 - NEW VERSIONS OF THE AGREEMENT\n\n      12.1 Any person is authorized to duplicate and distribute copies of this Agreement.\n\n      12.2 So as to ensure coherence, the wording of this Agreement is protected and may only be modified by the authors of the License, who reserve the right to periodically publish updates or new versions of the Agreement, each with a separate number. These subsequent versions may address new issues encountered by Free Software.\n\n      12.3 Any Software distributed under a given version of the Agreement may only be subsequently distributed under the same version of the Agreement or a subsequent version.\n\n   Article 13 - GOVERNING LAW AND JURISDICTION\n\n      13.1 The Agreement is governed by French law. The Parties agree to endeavor to seek an amicable solution to any disagreements or disputes that may arise during the performance of the Agreement.\n\n      13.2 Failing an amicable solution within two (2) months as from their occurrence, and unless emergency proceedings are necessary, the disagreements or disputes shall be referred to the Paris Courts having jurisdiction, by the more diligent Party.\n\nVersion 1.0 dated 2006-09-05. 1 CeCILL stands for Ce(a) C(nrs) I(nria) L(ogiciel) L(ibre)","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"CeCILL-C Free Software License Agreement","_rf_notes":"French version can be found here: http://www.cecill.info/licences/Licence_CeCILL-C_V1-fr.html","_rf_risk":null,"_rf_shortname":"fossology:CECILL-C","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"CeCILL-C FREE SOFTWARE LICENSE AGREEMENT Notice\n\nThis Agreement is a Free Software license agreement that is the result of discussions between its authors in order to ensure compliance with the two main principles guiding its drafting:\n\n   * firstly, compliance with the principles governing the distribution of Free Software: access to source code, broad rights granted to users,\n\n   * secondly, the election of a governing law, French law, with which it is conformant, both as regards the law of torts and intellectual property law, and the protection that it offers to both authors and holders of the economic rights over software.\n\nThe authors of the CeCILL¹ license are:\n\n   \n\n   Commissariat à l'Energie Atomique - CEA, a public scientific, technical and industrial research establishment, having its principal place of business at 25 rue Leblanc, immeuble Le Ponant D, 75015 Paris, France.\n\n   \n\n   Centre National de la Recherche Scientifique - CNRS, a public scientific and technological establishment, having its principal place of business at 3 rue Michel-Ange, 75794 Paris cedex 16, France.\n\n   \n\n   Institut National de Recherche en Informatique et en Automatique - INRIA, a public scientific and technological establishment, having its principal place of business at Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le Chesnay cedex, France.\n\n   Preamble The purpose of this Free Software license agreement is to grant users the right to modify and re-use the software governed by this license.\n\n   The exercising of this right is conditional upon the obligation to make available to the community the modifications made to the source code of the software so as to contribute to its evolution.\n\n   In consideration of access to the source code and the rights to copy, modify and redistribute granted by the license, users are provided only with a limited warranty and the software's author, the holder of the economic rights, and the successive licensors only have limited liability.\n\n   In this respect, the risks associated with loading, using, modifying and/or developing or reproducing the software by the user are brought to the user's attention, given its Free Software status, which may make it complicated to use, with the result that its use is reserved for developers and experienced professionals having in-depth computer knowledge. Users are therefore encouraged to load and test the suitability of the software as regards their requirements in conditions enabling the security of their systems and/or data to be ensured and, more generally, to use and operate it in the same conditions of security. This Agreement may be freely reproduced and published, provided it is not altered, and that no provisions are either added or removed herefrom.\n\n   This Agreement may apply to any or all software for which the holder of the economic rights decides to submit the use thereof to its provisions.\n\n   Article 1 - DEFINITIONS\n\n   For the purpose of this Agreement, when the following expressions commence with a capital letter, they shall have the following meaning:\n\n      \n\n      Agreement: means this license agreement, and its possible subsequent versions and annexes.\n\n      \n\n      Software: means the software in its Object Code and/or Source Code form and, where applicable, its documentation, \"as is\" when the Licensee accepts the Agreement.\n\n      \n\n      Initial Software: means the Software in its Source Code and possibly its Object Code form and, where applicable, its documentation, \"as is\" when it is first distributed under the terms and conditions of the Agreement.\n\n      \n\n      Modified Software: means the Software modified by at least one Integrated Contribution.\n\n      \n\n      Source Code: means all the Software's instructions and program lines to which access is required so as to modify the Software.\n\n      \n\n      Object Code: means the binary files originating from the compilation of the Source Code.\n\n      \n\n      Holder: means the holder(s) of the economic rights over the Initial Software.\n\n      \n\n      Licensee: means the Software user(s) having accepted the Agreement.\n\n      \n\n      Contributor: means a Licensee having made at least one Integrated Contribution.\n\n      \n\n      Licensor: means the Holder, or any other individual or legal entity, who distributes the Software under the Agreement.\n\n      \n\n      Integrated Contribution: means any or all modifications, corrections, translations, adaptations and/or new functions integrated into the Source Code by any or all Contributors.\n\n      \n\n      Related Module: means a set of sources files including their documentation that, without modification to the Source Code, enables supplementary functions or services in addition to those offered by the Software.\n\n      \n\n      Derivative Software: means any combination of the Software, modified or not, and of a Related Module.\n\n      \n\n      Parties: mean both the Licensee and the Licensor.\n\n   These expressions may be used both in singular and plural form.\n\n   Article 2 - PURPOSE\n\n   The purpose of the Agreement is the grant by the Licensor to the Licensee of a non-exclusive, transferable and worldwide license for the Software as set forth in Article 5 hereinafter for the whole term of the protection granted by the rights over said Software.\n\n   Article 3 - ACCEPTANCE\n\n      3.1 The Licensee shall be deemed as having accepted the terms and conditions of this Agreement upon the occurrence of the first of the following events:\n\n         (i) loading the Software by any or all means, notably, by downloading from a remote server, or by loading from a physical medium;\n\n         (ii) the first time the Licensee exercises any of the rights granted hereunder.\n\n      3.2 One copy of the Agreement, containing a notice relating to the characteristics of the Software, to the limited warranty, and to the fact that its use is restricted to experienced users has been provided to the Licensee prior to its acceptance as set forth in Article 3.1 hereinabove, and the Licensee hereby acknowledges that it has read and understood it.\n\n   Article 4 - EFFECTIVE DATE AND TERM\n\n      4.1 EFFECTIVE DATE\n\n      The Agreement shall become effective on the date when it is accepted by the Licensee as set forth in Article 3.1.\n\n      4.2 TERM\n\n      The Agreement shall remain in force for the entire legal term of protection of the economic rights over the Software.\n\n   Article 5 - SCOPE OF RIGHTS GRANTED\n\n   The Licensor hereby grants to the Licensee, who accepts, the following rights over the Software for any or all use, and for the term of the Agreement, on the basis of the terms and conditions set forth hereinafter.\n\n   Besides, if the Licensor owns or comes to own one or more patents protecting all or part of the functions of the Software or of its components, the Licensor undertakes not to enforce the rights granted by these patents against successive Licensees using, exploiting or modifying the Software. If these patents are transferred, the Licensor undertakes to have the transferees subscribe to the obligations set forth in this paragraph.\n\n      5.1 RIGHT OF USE\n\n      The Licensee is authorized to use the Software, without any limitation as to its fields of application, with it being hereinafter specified that this comprises:\n\n         1. permanent or temporary reproduction of all or part of the Software by any or all means and in any or all form.\n\n         2. loading, displaying, running, or storing the Software on any or all medium.\n\n         3. entitlement to observe, study or test its operation so as to determine the ideas and principles behind any or all constituent elements of said Software. This shall apply when the Licensee carries out any or all loading, displaying, running, transmission or storage operation as regards the Software, that it is entitled to carry out hereunder.\n\n      5.2 RIGHT OF MODIFICATION\n\n      The right of modification includes the right to translate, adapt, arrange, or make any or all modifications to the Software, and the right to reproduce the resulting software. It includes, in particular, the right to create a Derivative Software.\n\n      The Licensee is authorized to make any or all modification to the Software provided that it includes an explicit notice that it is the author of said modification and indicates the date of the creation thereof.\n\n      5.3 RIGHT OF DISTRIBUTION\n\n      In particular, the right of distribution includes the right to publish, transmit and communicate the Software to the general public on any or all medium, and by any or all means, and the right to market, either in consideration of a fee, or free of charge, one or more copies of the Software by any means.\n\n      The Licensee is further authorized to distribute copies of the modified or unmodified Software to third parties according to the terms and conditions set forth hereinafter.\n\n         5.3.1. DISTRIBUTION OF SOFTWARE WITHOUT MODIFICATION\n\n         The Licensee is authorized to distribute true copies of the Software in Source Code or Object Code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            1. a copy of the Agreement,\n\n            2. a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the Object Code of the Software is redistributed, the Licensee allows effective access to the full Source Code of the Software at a minimum during the entire period of its distribution of the Software, it being understood that the additional cost of acquiring the Source Code shall not exceed the cost of transferring the data.\n\n         5.3.2. DISTRIBUTION OF MODIFIED SOFTWARE\n\n         When the Licensee makes an Integrated Contribution to the Software, the terms and conditions for the distribution of the resulting Modified Software become subject to all the provisions of this Agreement.\n\n         The Licensee is authorized to distribute the Modified Software, in source code or object code form, provided that said distribution complies with all the provisions of the Agreement and is accompanied by:\n\n            1. a copy of the Agreement,\n\n            2. a notice relating to the limitation of both the Licensor's warranty and liability as set forth in Articles 8 and 9,\n\n         and that, in the event that only the object code of the Modified Software is redistributed, the Licensee allows effective access to the full source code of the Modified Software at a minimum during the entire period of its distribution of the Modified Software, it being understood that the additional cost of acquiring the source code shall not exceed the cost of transferring the data.\n\n         5.3.3. DISTRIBUTION OF DERIVATIVE SOFTWARE\n\n         When the Licensee creates Derivative Software, this Derivative Software may be distributed under a license agreement other than this Agreement, subject to compliance with the requirement to include a notice concerning the rights over the Software as defined in Article 6.4. In the event the creation of the Derivative Software required modification of the Source Code, the Licensee undertakes that:\n\n            1. the resulting Modified Software will be governed by this Agreement,\n\n            2. the Integrated Contributions in the resulting Modified Software will be clearly identified and documented,\n\n            3. the Licensee will allow effective access to the source code of the Modified Software, at a minimum during the entire period of distribution of the Derivative Software, such that such modifications may be carried over in a subsequent version of the Software; it being understood that the additional cost of purchasing the source code of the Modified Software shall not exceed the cost of transferring the data.\n\n         5.3.4. COMPATIBILITY WITH THE CeCILL LICENSE\n\n         When a Modified Software contains an Integrated Contribution subject to the CeCILL license agreement, or when a Derivative Software contains a Related Module subject to the CeCILL license agreement, the provisions set forth in the third item of Article 6.4 are optional.\n\n   Article 6 - INTELLECTUAL PROPERTY\n\n      6.1 OVER THE INITIAL SOFTWARE\n\n      The Holder owns the economic rights over the Initial Software. Any or all use of the Initial Software is subject to compliance with the terms and conditions under which the Holder has elected to distribute its work and no one shall be entitled to modify the terms and conditions for the distribution of said Initial Software.\n\n      The Holder undertakes that the Initial Software will remain ruled at least by this Agreement, for the duration set forth in Article 4.2.\n\n      6.2 OVER THE INTEGRATED CONTRIBUTIONS\n\n      The Licensee who develops an Integrated Contribution is the owner of the intellectual property rights over this Contribution as defined by applicable law.\n\n      6.3 OVER THE RELATED MODULES\n\n      The Licensee who develops a Related Module is the owner of the intellectual property rights over this Related Module as defined by applicable law and is free to choose the type of agreement that shall govern its distribution under the conditions defined in Article 5.3.3.\n\n      6.4 NOTICE OF RIGHTS\n\n      The Licensee expressly undertakes:\n\n         1. not to remove, or modify, in any manner, the intellectual property notices attached to the Software;\n\n         2. to reproduce said notices, in an identical manner, in the copies of the Software modified or not;\n\n         3. to ensure that use of the Software, its intellectual property notices and the fact that it is governed by the Agreement is indicated in a text that is easily accessible, specifically from the interface of any Derivative Software.\n\n      The Licensee undertakes not to directly or indirectly infringe the intellectual property rights of the Holder and/or Contributors on the Software and to take, where applicable, vis-à-vis its staff, any and all measures required to ensure respect of said intellectual property rights of the Holder and/or Contributors.\n\n   Article 7 - RELATED SERVICES\n\n      7.1 Under no circumstances shall the Agreement oblige the Licensor to provide technical assistance or maintenance services for the Software.\n\n      However, the Licensor is entitled to offer this type of services. The terms and conditions of such technical assistance, and/or such maintenance, shall be set forth in a separate instrument. Only the Licensor offering said maintenance and/or technical assistance services shall incur liability therefor.\n\n      7.2 Similarly, any Licensor is entitled to offer to its licensees, under its sole responsibility, a warranty, that shall only be binding upon itself, for the redistribution of the Software and/or the Modified Software, under terms and conditions that it is free to decide. Said warranty, and the financial terms and conditions of its application, shall be subject of a separate instrument executed between the Licensor and the Licensee.\n\n   Article 8 - LIABILITY\n\n      8.1 Subject to the provisions of Article 8.2, the Licensee shall be entitled to claim compensation for any direct loss it may have suffered from the Software as a result of a fault on the part of the relevant Licensor, subject to providing evidence thereof.\n\n      8.2 The Licensor's liability is limited to the commitments made under this Agreement and shall not be incurred as a result of in particular: (i) loss due the Licensee's total or partial failure to fulfill its obligations, (ii) direct or consequential loss that is suffered by the Licensee due to the use or performance of the Software, and (iii) more generally, any consequential loss. In particular the Parties expressly agree that any or all pecuniary or business loss (i.e. loss of data, loss of profits, operating loss, loss of customers or orders, opportunity cost, any disturbance to business activities) or any or all legal proceedings instituted against the Licensee by a third party, shall constitute consequential loss and shall not provide entitlement to any or all compensation from the Licensor.\n\n   Article 9 - WARRANTY\n\n      9.1 The Licensee acknowledges that the scientific and technical state-of-the-art when the Software was distributed did not enable all possible uses to be tested and verified, nor for the presence of possible defects to be detected. In this respect, the Licensee's attention has been drawn to the risks associated with loading, using, modifying and/or developing and reproducing the Software which are reserved for experienced users.\n\n      The Licensee shall be responsible for verifying, by any or all means, the suitability of the product for its requirements, its good working order, and for ensuring that it shall not cause damage to either persons or properties.\n\n      9.2 The Licensor hereby represents, in good faith, that it is entitled to grant all the rights over the Software (including in particular the rights set forth in Article 5).\n\n      9.3 The Licensee acknowledges that the Software is supplied \"as is\" by the Licensor without any other express or tacit warranty, other than that provided for in Article 9.2 and, in particular, without any warranty as to its commercial value, its secured, safe, innovative or relevant nature.\n\n      Specifically, the Licensor does not warrant that the Software is free from any error, that it will operate without interruption, that it will be compatible with the Licensee's own equipment and software configuration, nor that it will meet the Licensee's requirements.\n\n      9.4 The Licensor does not either expressly or tacitly warrant that the Software does not infringe any third party intellectual property right relating to a patent, software or any other property right. Therefore, the Licensor disclaims any and all liability towards the Licensee arising out of any or all proceedings for infringement that may be instituted in respect of the use, modification and redistribution of the Software. Nevertheless, should such proceedings be instituted against the Licensee, the Licensor shall provide it with technical and legal assistance for its defense. Such technical and legal assistance shall be decided on a case-by-case basis between the relevant Licensor and the Licensee pursuant to a memorandum of understanding. The Licensor disclaims any and all liability as regards the Licensee's use of the name of the Software. No warranty is given as regards the existence of prior rights over the name of the Software or as regards the existence of a trademark.\n\n   Article 10 - TERMINATION\n\n      10.1 In the event of a breach by the Licensee of its obligations hereunder, the Licensor may automatically terminate this Agreement thirty (30) days after notice has been sent to the Licensee and has remained ineffective.\n\n      10.2 A Licensee whose Agreement is terminated shall no longer be authorized to use, modify or distribute the Software. However, any licenses that it may have granted prior to termination of the Agreement shall remain valid subject to their having been granted in compliance with the terms and conditions hereof.\n\n   Article 11 - MISCELLANEOUS\n\n      11.1 EXCUSABLE EVENTS\n\n      Neither Party shall be liable for any or all delay, or failure to perform the Agreement, that may be attributable to an event of force majeure, an act of God or an outside cause, such as defective functioning or interruptions of the electricity or telecommunications networks, network paralysis following a virus attack, intervention by government authorities, natural disasters, water damage, earthquakes, fire, explosions, strikes and labor unrest, war, etc.\n\n      11.2 Any failure by either Party, on one or more occasions, to invoke one or more of the provisions hereof, shall under no circumstances be interpreted as being a waiver by the interested Party of its right to invoke said provision(s) subsequently.\n\n      11.3 The Agreement cancels and replaces any or all previous agreements, whether written or oral, between the Parties and having the same purpose, and constitutes the entirety of the agreement between said Parties concerning said purpose. No supplement or modification to the terms and conditions hereof shall be effective as between the Parties unless it is made in writing and signed by their duly authorized representatives.\n\n      11.4 In the event that one or more of the provisions hereof were to conflict with a current or future applicable act or legislative text, said act or legislative text shall prevail, and the Parties shall make the necessary amendments so as to comply with said act or legislative text. All other provisions shall remain effective. Similarly, invalidity of a provision of the Agreement, for any reason whatsoever, shall not cause the Agreement as a whole to be invalid.\n\n      11.5 LANGUAGE\n\n      The Agreement is drafted in both French and English and both versions are deemed authentic.\n\n   Article 12 - NEW VERSIONS OF THE AGREEMENT\n\n      12.1 Any person is authorized to duplicate and distribute copies of this Agreement.\n\n      12.2 So as to ensure coherence, the wording of this Agreement is protected and may only be modified by the authors of the License, who reserve the right to periodically publish updates or new versions of the Agreement, each with a separate number. These subsequent versions may address new issues encountered by Free Software.\n\n      12.3 Any Software distributed under a given version of the Agreement may only be subsequently distributed under the same version of the Agreement or a subsequent version.\n\n   Article 13 - GOVERNING LAW AND JURISDICTION\n\n      13.1 The Agreement is governed by French law. The Parties agree to endeavor to seek an amicable solution to any disagreements or disputes that may arise during the performance of the Agreement.\n\n      13.2 Failing an amicable solution within two (2) months as from their occurrence, and unless emergency proceedings are necessary, the disagreements or disputes shall be referred to the Paris Courts having jurisdiction, by the more diligent Party.\n\nVersion 1.0 dated 2006-09-05. 1 CeCILL stands for Ce(a) C(nrs) I(nria) L(ogiciel) L(ibre)","_rf_text_updatable":false,"_rf_url":"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:CECILL-C","tag":"LN"},"id":["OrtLicenseCategorization","4546fe635375826cdefb72b64c8f442f"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:CECILL-C"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:CECILL-C","tag":"LN"},[{"contents":"CECILL-C","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","227ba2e7d49ab6ed6b272d346cc03846"],"impliedStmts":[],"raw":{"_clcAlias":["CECILL-C"],"_clcName":"cavil:CECILL-C"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:CeCILL-C License","tag":"LN"},[{"contents":"spdx:CECILL-C","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"CeCILL-C","tag":"LN"},{"contents":"CeCILL C","tag":"LN"},{"contents":"CeCILL-C","tag":"LN"},{"contents":"CECILL C","tag":"LN"},{"contents":"CECILL-C","tag":"LN"},{"contents":"CECILL C License","tag":"LN"},{"contents":"CECILL-C License","tag":"LN"},{"contents":"https://spdx.org/licenses/cecill-c","tag":"LN"},{"contents":"eCILL-C Free Software License Agreement","tag":"LN"},{"contents":"scancode:cecill-c-en","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","2dd980a4cc763fbf4c7eb35a1b75c804"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prüfung seitens Open CoDE sowohl der Open Source Definition (gemäß Definition der Open Source Initiative [extern]) entspricht und darüber hinaus keine für die Öffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Außer in Ausnahmefällen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["CeCILL C","CeCILL-C","CECILL C","CECILL-C","CECILL C License","CECILL-C License","https://spdx.org/licenses/cecill-c","eCILL-C Free Software License Agreement"],"_canonicalName":"metaeffekt:CeCILL-C License","_category":"CeCILL-C","_openCoDEStatus":"approved","_otherIds":["scancode:cecill-c-en"],"_shortName":null,"_spdxIdentifier":"spdx:CECILL-C"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"ifrOSS:CeCILL-C Free Software License Agreement","tag":"LN"},[{"contents":"CeCILL-C Free Software License Agreement","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["ifrOSS License","95c2bb074232d40760ead8779c298c75"],"impliedStmts":[{"contents":[null,"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"],"tag":"LicenseUrl"},{"contents":[{"contents":{"contents":{"contents":["ifrOSS Classification","Sonstige Lizenzen mit beschränktem Copyleft-Effekt",{"contents":"","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},[{"contents":[{"contents":[{"contents":{"contents":{"contents":["ifrOSS Classification","Lizenzen mit beschränktem Copyleft-Effekt",{"contents":"Lizenzen mit beschränktem Copyleft-Effekt haben ebenfalls einen Copyleft-Effekt, der aber nicht alle Berbeitungen und abgeleiteten Werke umfasst, sondern definierte Ausnahmen enthält.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"}]],"tag":"SubStatements"},[{"contents":{"contents":{"contents":["ifrOSS Classification","Open Source Lizenzen",{"contents":"Die hier aufgeführten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschränktem Copyleft-Effekt](#lizenzen-mit-beschränktem-copyleft-effekt)\n* [Lizenzen mit Wahlmöglichkeiten](#lizenzen-mit-wahlmöglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgeführten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfüllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"}]],"tag":"SubStatements"}],"raw":{"ifrossCategoriesWithDescription":[["Open Source Lizenzen","Die hier aufgeführten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschränktem Copyleft-Effekt](#lizenzen-mit-beschränktem-copyleft-effekt)\n* [Lizenzen mit Wahlmöglichkeiten](#lizenzen-mit-wahlmöglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgeführten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfüllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n"],["Lizenzen mit beschränktem Copyleft-Effekt","Lizenzen mit beschränktem Copyleft-Effekt haben ebenfalls einen Copyleft-Effekt, der aber nicht alle Berbeitungen und abgeleiteten Werke umfasst, sondern definierte Ausnahmen enthält."],["Sonstige Lizenzen mit beschränktem Copyleft-Effekt",""]],"ifrossLicenseName":"ifrOSS:CeCILL-C Free Software License Agreement","ifrossLicenseNameShortened":"CeCILL-C Free Software License Agreement","ifrossLicenseUrl":"http://www.cecill.info/licences/Licence_CeCILL-C_V1-en.html"},"type":"ifrOSS License"}]