[{"applicableLNs":{"contents":[{"contents":"spdx:ClArtistic","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","41032ce4419e1fbc581ff900407b90c7"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":null,"tag":"MaybeStatement"},{"contents":[{"contents":"The Clarified Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n \"You\" is you, if you're thinking about copying or distributing this Package.\n\n \"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n \"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n     b) use the modified Package only within your corporation or organization.\n\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n     e) permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n     c) give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n     e) offer the machine-readable source of the Package, with your modifications, by mail order.\n\n5. You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n\n7. C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n\n8. Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The Clarified Artistic License</p>\n\n      </div>\n      <p>Preamble</p>\n\n      <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder as specified below.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Distribution fee&quot; is a fee you charge for providing a copy of this Package to another party.</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the right to use the item, though there may\n         be fees involved in handling the item. It also means that recipients of the item may redistribute it\n         under the same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public\n             Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in\n             such a way shall still be considered the Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            place your modifications in the Public Domain or otherwise make them Freely Available, such\n               as by posting said modifications to Usenet or an equivalent medium, or placing the\n               modifications on a major network archive site allowing unrestricted access to them, or by\n               allowing the Copyright Holder to include your modifications in the Standard Version of the\n               Package.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            use the modified Package only within your corporation or organization.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            rename any non-standard executables so the names do not conflict with standard executables,\n               which must also be provided, and provide a separate manual page for each non-standard\n               executable that clearly documents how it differs from the Standard Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            permit and encourge anyone who receives a copy of the modified Package permission to make\n               your modifications Freely Available in some specific way.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            distribute a Standard Version of the executables and library files, together with\n               instructions (in the manual page or equivalent) on where to get the Standard Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            accompany the distribution with the machine-readable source of the Package with your modifications.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            give non-standard executables non-standard names, and clearly document the differences in\n               manual pages (or equivalent), together with instructions on where to get the Standard\n               Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            offer the machine-readable source of the Package, with your modifications, by mail order.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a distribution fee for any distribution of this Package. If you offer support for\n             this Package, you may charge any fee you choose for that support. You may not charge a license\n             fee for the right to use this Package itself. You may distribute this Package in aggregate\n             with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly\n             commercial and possibly nonfree) software distribution, and charge license fees for other\n             parts of that software distribution, provided that you do not advertise this Package as a\n             product of your own. If the Package includes an interpreter, You may embed this Package&apos;s\n             interpreter within an executable of yours (by linking); this shall be construed as a mere form\n             of aggregation, provided that the complete Standard Version of the interpreter is so\n             embedded.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whoever generated them, and may be sold commercially, and may be aggregated with this Package.\n             If such scripts or library files are aggregated with this Package via the so-called\n             &quot;undump&quot; or &quot;unexec&quot; methods of producing a binary executable image, then\n             distribution of such an image shall neither be construed as a distribution of this Package nor\n             shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent\n             such an executable image as a Standard Version of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked\n             into this Package in order to emulate subroutines and variables of the language defined by\n             this Package shall not be considered part of this Package, but are the equivalent of input as\n             in Paragraph 6, provided these subroutines do not change the language in any way that would\n             cause it to fail the regression tests for the language.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Aggregation of the Standard Version of the Package with a commercial distribution is always\n             permitted provided that the use of this Package is embedded; that is, when no overt attempt is\n             made to make this Package&apos;s interfaces visible to the end user of the commercial\n             distribution. Such use shall not be construed as a distribution of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n      <div class=\"optional-license-text\"> <p>The End</p>\n</div>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://www.ncftp.com/ncftp/doc/LICENSE.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"tag":"LicenseUrl"},{"contents":[null,"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"tag":"LicenseUrl"},{"contents":[null,"http://www.ncftp.com/ncftp/doc/LICENSE.txt"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":1,"timestamp":"2024-04-17T05:13:48Z","url":"http://www.ncftp.com/ncftp/doc/LICENSE.txt"},{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:13:48Z","url":"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":false,"licenseComments":null,"licenseId":"spdx:ClArtistic","licenseText":"The Clarified Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n \"You\" is you, if you're thinking about copying or distributing this Package.\n\n \"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n \"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n     b) use the modified Package only within your corporation or organization.\n\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n     e) permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n     c) give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n     e) offer the machine-readable source of the Package, with your modifications, by mail order.\n\n5. You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n\n7. C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n\n8. Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The Clarified Artistic License</p>\n\n      </div>\n      <p>Preamble</p>\n\n      <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder as specified below.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Distribution fee&quot; is a fee you charge for providing a copy of this Package to another party.</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the right to use the item, though there may\n         be fees involved in handling the item. It also means that recipients of the item may redistribute it\n         under the same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public\n             Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in\n             such a way shall still be considered the Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            place your modifications in the Public Domain or otherwise make them Freely Available, such\n               as by posting said modifications to Usenet or an equivalent medium, or placing the\n               modifications on a major network archive site allowing unrestricted access to them, or by\n               allowing the Copyright Holder to include your modifications in the Standard Version of the\n               Package.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            use the modified Package only within your corporation or organization.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            rename any non-standard executables so the names do not conflict with standard executables,\n               which must also be provided, and provide a separate manual page for each non-standard\n               executable that clearly documents how it differs from the Standard Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            permit and encourge anyone who receives a copy of the modified Package permission to make\n               your modifications Freely Available in some specific way.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> a)</var>\n            distribute a Standard Version of the executables and library files, together with\n               instructions (in the manual page or equivalent) on where to get the Standard Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> b)</var>\n            accompany the distribution with the machine-readable source of the Package with your modifications.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> c)</var>\n            give non-standard executables non-standard names, and clearly document the differences in\n               manual pages (or equivalent), together with instructions on where to get the Standard\n               Version.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> e)</var>\n            offer the machine-readable source of the Package, with your modifications, by mail order.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a distribution fee for any distribution of this Package. If you offer support for\n             this Package, you may charge any fee you choose for that support. You may not charge a license\n             fee for the right to use this Package itself. You may distribute this Package in aggregate\n             with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly\n             commercial and possibly nonfree) software distribution, and charge license fees for other\n             parts of that software distribution, provided that you do not advertise this Package as a\n             product of your own. If the Package includes an interpreter, You may embed this Package&apos;s\n             interpreter within an executable of yours (by linking); this shall be construed as a mere form\n             of aggregation, provided that the complete Standard Version of the interpreter is so\n             embedded.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whoever generated them, and may be sold commercially, and may be aggregated with this Package.\n             If such scripts or library files are aggregated with this Package via the so-called\n             &quot;undump&quot; or &quot;unexec&quot; methods of producing a binary executable image, then\n             distribution of such an image shall neither be construed as a distribution of this Package nor\n             shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent\n             such an executable image as a Standard Version of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked\n             into this Package in order to emulate subroutines and variables of the language defined by\n             this Package shall not be considered part of this Package, but are the equivalent of input as\n             in Paragraph 6, provided these subroutines do not change the language in any way that would\n             cause it to fail the regression tests for the language.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Aggregation of the Standard Version of the Package with a commercial distribution is always\n             permitted provided that the use of this Package is embedded; that is, when no overt attempt is\n             made to make this Package&apos;s interfaces visible to the end user of the commercial\n             distribution. Such use shall not be construed as a distribution of this Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n      <div class=\"optional-license-text\"> <p>The End</p>\n</div>\n    ","name":"Clarified Artistic License","seeAlso":["http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/","http://www.ncftp.com/ncftp/doc/LICENSE.txt"],"standardLicenseTemplate":"<<beginOptional>>The Clarified Artistic License\n\n<<endOptional>>\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n\"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> use the modified Package only within your corporation or organization.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n      <<var;name=\"bullet\";original=\"e)\";match=\".{0,20}\">> permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n      <<var;name=\"bullet\";original=\"e)\";match=\".{0,20}\">> offer the machine-readable source of the Package, with your modifications, by mail order.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n\n   <<var;name=\"bullet\";original=\"8.\";match=\".{0,20}\">> Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   <<var;name=\"bullet\";original=\"9.\";match=\".{0,20}\">> The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   <<var;name=\"bullet\";original=\"10.\";match=\".{0,20}\">> THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.<<beginOptional>> The End\n\n<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:ClArtistic","tag":"LN"},[{"contents":"spdx:ClArtistic","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Artistic (clarified)","tag":"LN"},{"contents":"Artistic clarified","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","167c3e590111f9b138cdad49e1d76138"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/ArtisticClarified"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":["Artistic clarified"],"_legacy_names":["Artistic (clarified)"],"_notes":null},"_id":"ClArtistic","_license":{"_expression":"spdx:ClArtistic","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":["https://fedoraproject.org/wiki/Licensing/ArtisticClarified"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"BlueOak:ClArtistic","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","6f1f465a5b036a21d1013226ebda98d9"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Lead",{"contents":"These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/ClArtistic.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Lead","These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.",{"_id":"ClArtistic","_name":"Clarified Artistic License","_url":"https://spdx.org/licenses/ClArtistic.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fsf:ClarifiedArtistic","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"spdx:ClArtistic","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FSF","8205d6dc074c1cd8e481c31b638d0298"],"impliedStmts":[{"contents":[null,"https://www.gnu.org/licenses/license-list.html#ClarifiedArtistic"],"tag":"LicenseUrl"},{"contents":[null,"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"tag":"LicenseUrl"},{"contents":{"contents":["FSF","gpl-2-compatible",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["FSF","gpl-3-compatible",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_id":"fsf:ClarifiedArtistic","_identifiers":{"spdx":["ClArtistic"]},"_name":"Clarified Artistic License","_tags":["gpl-2-compatible","gpl-3-compatible","libre"],"_uris":["https://www.gnu.org/licenses/license-list.html#ClarifiedArtistic","http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"]},"type":"FSF"},{"applicableLNs":{"contents":[{"contents":"scancode:artistic-clarified","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"},{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","d93e8796812372c13d4be362ed47f7c9"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"https://fedoraproject.org/wiki/Licensing/ArtisticClarified","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":[null,"http://www.ncftp.com/ncftp/doc/LICENSE.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"tag":"LicenseUrl"},{"contents":"             The Clarified Artistic License\n \n                Preamble\n \nThe intent of this document is to state the conditions under which a\nPackage may be copied, such that the Copyright Holder maintains some\nsemblance of artistic control over the development of the package,\nwhile giving the users of the package the right to use and distribute\nthe Package in a more-or-less customary fashion, plus the right to make\nreasonable modifications.\n \nDefinitions:\n \n    \"Package\" refers to the collection of files distributed by the\n    Copyright Holder, and derivatives of that collection of files\n    created through textual modification.\n \n    \"Standard Version\" refers to such a Package if it has not been\n    modified, or has been modified in accordance with the wishes\n    of the Copyright Holder as specified below.\n \n    \"Copyright Holder\" is whoever is named in the copyright or\n    copyrights for the package.\n \n    \"You\" is you, if you're thinking about copying or distributing\n    this Package.\n \n    \"Distribution fee\" is a fee you charge for providing a copy\n        of this Package to another party.\n \n    \"Freely Available\" means that no fee is charged for the right to\n        use the item, though there may be fees involved in handling the\n        item.  It also means that recipients of the item may redistribute\n        it under the same conditions they received it.\n \n1. You may make and give away verbatim copies of the source form of the\nStandard Version of this Package without restriction, provided that you\nduplicate all of the original copyright notices and associated disclaimers.\n \n2. You may apply bug fixes, portability fixes and other modifications\nderived from the Public Domain, or those made Freely Available, or from\nthe Copyright Holder.  A Package modified in such a way shall still be\nconsidered the Standard Version.\n \n3. You may otherwise modify your copy of this Package in any way, provided\nthat you insert a prominent notice in each changed file stating how and\nwhen you changed that file, and provided that you do at least ONE of the\nfollowing:\n \n    a) place your modifications in the Public Domain or otherwise make them\n    Freely Available, such as by posting said modifications to Usenet or an\n    equivalent medium, or placing the modifications on a major network\n    archive site allowing unrestricted access to them, or by allowing the\n    Copyright Holder to include your modifications in the Standard Version\n    of the Package.\n \n    b) use the modified Package only within your corporation or organization.\n \n    c) rename any non-standard executables so the names do not conflict\n    with standard executables, which must also be provided, and provide\n    a separate manual page for each non-standard executable that clearly\n    documents how it differs from the Standard Version.\n \n    d) make other distribution arrangements with the Copyright Holder.\n \n    e) permit and encourge anyone who receives a copy of the modified Package\n       permission to make your modifications Freely Available\n       in some specific way.\n \n\n4. You may distribute the programs of this Package in object code or\nexecutable form, provided that you do at least ONE of the following:\n \n    a) distribute a Standard Version of the executables and library files,\n    together with instructions (in the manual page or equivalent) on where\n    to get the Standard Version.\n \n    b) accompany the distribution with the machine-readable source of\n    the Package with your modifications.\n \n    c) give non-standard executables non-standard names, and clearly\n    document the differences in manual pages (or equivalent), together\n    with instructions on where to get the Standard Version.\n \n    d) make other distribution arrangements with the Copyright Holder.\n \n    e) offer the machine-readable source of the Package, with your\n       modifications, by mail order.\n \n5. You may charge a distribution fee for any distribution of this Package.\nIf you offer support for this Package, you may charge any fee you choose\nfor that support.  You may not charge a license fee for the right to use\nthis Package itself.  You may distribute this Package in aggregate with\nother (possibly commercial and possibly nonfree) programs as part of a\nlarger (possibly commercial and possibly nonfree) software distribution,\nand charge license fees for other parts of that software distribution,\nprovided that you do not advertise this Package as a product of your own.\nIf the Package includes an interpreter, You may embed this Package's\ninterpreter within an executable of yours (by linking); this shall be\nconstrued as a mere form of aggregation, provided that the complete\nStandard Version of the interpreter is so embedded.\n \n6. The scripts and library files supplied as input to or produced as\noutput from the programs of this Package do not automatically fall\nunder the copyright of this Package, but belong to whoever generated\nthem, and may be sold commercially, and may be aggregated with this\nPackage.  If such scripts or library files are aggregated with this\nPackage via the so-called \"undump\" or \"unexec\" methods of producing a\nbinary executable image, then distribution of such an image shall\nneither be construed as a distribution of this Package nor shall it\nfall under the restrictions of Paragraphs 3 and 4, provided that you do\nnot represent such an executable image as a Standard Version of this\nPackage.\n \n7. C subroutines (or comparably compiled subroutines in other\nlanguages) supplied by you and linked into this Package in order to\nemulate subroutines and variables of the language defined by this\nPackage shall not be considered part of this Package, but are the\nequivalent of input as in Paragraph 6, provided these subroutines do\nnot change the language in any way that would cause it to fail the\nregression tests for the language.\n \n8. Aggregation of the Standard Version of the Package with a commercial\ndistribution is always permitted provided that the use of this Package\nis embedded; that is, when no overt attempt is made to make this Package's\ninterfaces visible to the end user of the commercial distribution.\nSuch use shall not be construed as a distribution of this Package.\n \n9. The name of the Copyright Holder may not be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n \n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n \n                The End","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"https://fedoraproject.org/wiki/Licensing/ArtisticClarified","_key":"artistic-clarified","_name":"Clarified Artistic License","_notes":null,"_osiUrl":null,"_otherUrls":["http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"_owner":"Fedora","_shortName":"Clarified Artistic License","_spdxId":"ClArtistic","_text":"             The Clarified Artistic License\n \n                Preamble\n \nThe intent of this document is to state the conditions under which a\nPackage may be copied, such that the Copyright Holder maintains some\nsemblance of artistic control over the development of the package,\nwhile giving the users of the package the right to use and distribute\nthe Package in a more-or-less customary fashion, plus the right to make\nreasonable modifications.\n \nDefinitions:\n \n    \"Package\" refers to the collection of files distributed by the\n    Copyright Holder, and derivatives of that collection of files\n    created through textual modification.\n \n    \"Standard Version\" refers to such a Package if it has not been\n    modified, or has been modified in accordance with the wishes\n    of the Copyright Holder as specified below.\n \n    \"Copyright Holder\" is whoever is named in the copyright or\n    copyrights for the package.\n \n    \"You\" is you, if you're thinking about copying or distributing\n    this Package.\n \n    \"Distribution fee\" is a fee you charge for providing a copy\n        of this Package to another party.\n \n    \"Freely Available\" means that no fee is charged for the right to\n        use the item, though there may be fees involved in handling the\n        item.  It also means that recipients of the item may redistribute\n        it under the same conditions they received it.\n \n1. You may make and give away verbatim copies of the source form of the\nStandard Version of this Package without restriction, provided that you\nduplicate all of the original copyright notices and associated disclaimers.\n \n2. You may apply bug fixes, portability fixes and other modifications\nderived from the Public Domain, or those made Freely Available, or from\nthe Copyright Holder.  A Package modified in such a way shall still be\nconsidered the Standard Version.\n \n3. You may otherwise modify your copy of this Package in any way, provided\nthat you insert a prominent notice in each changed file stating how and\nwhen you changed that file, and provided that you do at least ONE of the\nfollowing:\n \n    a) place your modifications in the Public Domain or otherwise make them\n    Freely Available, such as by posting said modifications to Usenet or an\n    equivalent medium, or placing the modifications on a major network\n    archive site allowing unrestricted access to them, or by allowing the\n    Copyright Holder to include your modifications in the Standard Version\n    of the Package.\n \n    b) use the modified Package only within your corporation or organization.\n \n    c) rename any non-standard executables so the names do not conflict\n    with standard executables, which must also be provided, and provide\n    a separate manual page for each non-standard executable that clearly\n    documents how it differs from the Standard Version.\n \n    d) make other distribution arrangements with the Copyright Holder.\n \n    e) permit and encourge anyone who receives a copy of the modified Package\n       permission to make your modifications Freely Available\n       in some specific way.\n \n\n4. You may distribute the programs of this Package in object code or\nexecutable form, provided that you do at least ONE of the following:\n \n    a) distribute a Standard Version of the executables and library files,\n    together with instructions (in the manual page or equivalent) on where\n    to get the Standard Version.\n \n    b) accompany the distribution with the machine-readable source of\n    the Package with your modifications.\n \n    c) give non-standard executables non-standard names, and clearly\n    document the differences in manual pages (or equivalent), together\n    with instructions on where to get the Standard Version.\n \n    d) make other distribution arrangements with the Copyright Holder.\n \n    e) offer the machine-readable source of the Package, with your\n       modifications, by mail order.\n \n5. You may charge a distribution fee for any distribution of this Package.\nIf you offer support for this Package, you may charge any fee you choose\nfor that support.  You may not charge a license fee for the right to use\nthis Package itself.  You may distribute this Package in aggregate with\nother (possibly commercial and possibly nonfree) programs as part of a\nlarger (possibly commercial and possibly nonfree) software distribution,\nand charge license fees for other parts of that software distribution,\nprovided that you do not advertise this Package as a product of your own.\nIf the Package includes an interpreter, You may embed this Package's\ninterpreter within an executable of yours (by linking); this shall be\nconstrued as a mere form of aggregation, provided that the complete\nStandard Version of the interpreter is so embedded.\n \n6. The scripts and library files supplied as input to or produced as\noutput from the programs of this Package do not automatically fall\nunder the copyright of this Package, but belong to whoever generated\nthem, and may be sold commercially, and may be aggregated with this\nPackage.  If such scripts or library files are aggregated with this\nPackage via the so-called \"undump\" or \"unexec\" methods of producing a\nbinary executable image, then distribution of such an image shall\nneither be construed as a distribution of this Package nor shall it\nfall under the restrictions of Paragraphs 3 and 4, provided that you do\nnot represent such an executable image as a Standard Version of this\nPackage.\n \n7. C subroutines (or comparably compiled subroutines in other\nlanguages) supplied by you and linked into this Package in order to\nemulate subroutines and variables of the language defined by this\nPackage shall not be considered part of this Package, but are the\nequivalent of input as in Paragraph 6, provided these subroutines do\nnot change the language in any way that would cause it to fail the\nregression tests for the language.\n \n8. Aggregation of the Standard Version of the Package with a commercial\ndistribution is always permitted provided that the use of this Package\nis embedded; that is, when no overt attempt is made to make this Package's\ninterfaces visible to the end user of the commercial distribution.\nSuch use shall not be construed as a distribution of this Package.\n \n9. The name of the Copyright Holder may not be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n \n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n \n                The End","_textUrls":["http://www.ncftp.com/ncftp/doc/LICENSE.txt"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:ClArtistic","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","59c6a4d7043fdc4e378ffaca2671c560"],"impliedStmts":[{"contents":{"contents":[null,"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The Clarified Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n\"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n      e) permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n      e) offer the machine-readable source of the Package, with your modifications, by mail order.\n\n   5. You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n\n   7. C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n\n   8. Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Clarified Artistic License","_rf_notes":"","_rf_risk":null,"_rf_shortname":"fossology:ClArtistic","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The Clarified Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n\"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n      e) permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n      e) offer the machine-readable source of the Package, with your modifications, by mail order.\n\n   5. You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n\n   7. C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n\n   8. Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","_rf_text_updatable":false,"_rf_url":"http://gianluca.dellavedova.org/2011/01/03/clarified-artistic-license/"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:ClArtistic","tag":"LN"},"id":["OrtLicenseCategorization","6c267dd3e5f0b797b4c66f3f880bab9d"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:ClArtistic"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:ClArtistic","tag":"LN"},[{"contents":"ClArtistic","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","59d4b2b5669fe12fd279060101f06970"],"impliedStmts":[],"raw":{"_clcAlias":["ClArtistic"],"_clcName":"cavil:ClArtistic"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Clarified Artistic License","tag":"LN"},[{"contents":"spdx:ClArtistic","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"ClArtistic","tag":"LN"},{"contents":"ClArtistic","tag":"LN"},{"contents":"CLARTISTIC","tag":"LN"},{"contents":"Artistic clarified","tag":"LN"},{"contents":"clarified Artistic","tag":"LN"},{"contents":"Clarified Artistic","tag":"LN"},{"contents":"scancode:artistic-clarified","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","9e3cea9e0c284c155634c211892402a0"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prfung seitens Open CoDE sowohl der Open Source Definition (gem Definition der Open Source Initiative [extern]) entspricht und darber hinaus keine fr die ffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Auer in Ausnahmefllen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["ClArtistic","CLARTISTIC","Artistic clarified","clarified Artistic","Clarified Artistic"],"_canonicalName":"metaeffekt:Clarified Artistic License","_category":"ClArtistic","_openCoDEStatus":"approved","_otherIds":["scancode:artistic-clarified"],"_shortName":null,"_spdxIdentifier":"spdx:ClArtistic"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fosslight:Clarified Artistic License","tag":"LN"},[{"contents":"ClArtistic","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["FOSSLight","877786e313ed392d08740d798c34fee1"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}],"raw":{"_FOSSLightFact_License":{"_fossLight_ATTRIBUTION":"","_fossLight_CREATED_DATE":[],"_fossLight_CREATOR":[],"_fossLight_DESCRIPTION":"1. Object code ?? Executable form?? ???? ?? Standard Version? ?? ? ?? ??? ?? ??(manual ?? ?? ??? ?)? ?? ???? ?. \n2. ????? ???? ??? ??? ??? ??? ???? ??? ???? standard ?? ??? ??? ??? ?? non-standard ?? ??? rename ?? ?? ??? ???? ? \n\n1. You may distribute the programs of this Package in object code or executable form, and provided that you distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n2. You may modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and you rename any non-standard executables so the names do not conflict with standard executables, which must also be provided.","_fossLight_LICENSE_TEXT":"The Clarified Artistic License\n\nPreamble\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Distribution fee\" is a fee you charge for providing a copy of this Package to another party.\n\n\"Freely Available\" means that no fee is charged for the right to use the item, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain, or those made Freely Available, or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\na) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major network archive site allowing unrestricted access to them, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\nb) use the modified Package only within your corporation or organization.\nc) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\nd) make other distribution arrangements with the Copyright Holder.\ne) permit and encourge anyone who receives a copy of the modified Package permission to make your modifications Freely Available in some specific way.\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\na) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\nb) accompany the distribution with the machine-readable source of the Package with your modifications.\nc) give non-standard executables non-standard names, and clearly document the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\nd) make other distribution arrangements with the Copyright Holder.\ne) offer the machine-readable source of the Package, with your modifications, by mail order.\n5. You may charge a distribution fee for any distribution of this Package. If you offer support for this Package, you may charge any fee you choose for that support. You may not charge a license fee for the right to use this Package itself. You may distribute this Package in aggregate with other (possibly commercial and possibly nonfree) programs as part of a larger (possibly commercial and possibly nonfree) software distribution, and charge license fees for other parts of that software distribution, provided that you do not advertise this Package as a product of your own. If the Package includes an interpreter, You may embed this Package's interpreter within an executable of yours (by linking); this shall be construed as a mere form of aggregation, provided that the complete Standard Version of the interpreter is so embedded.\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package. If such scripts or library files are aggregated with this Package via the so-called \"undump\" or \"unexec\" methods of producing a binary executable image, then distribution of such an image shall neither be construed as a distribution of this Package nor shall it fall under the restrictions of Paragraphs 3 and 4, provided that you do not represent such an executable image as a Standard Version of this Package.\n7. C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.\n8. Aggregation of the Standard Version of the Package with a commercial distribution is always permitted provided that the use of this Package is embedded; that is, when no overt attempt is made to make this Package's interfaces visible to the end user of the commercial distribution. Such use shall not be construed as a distribution of this Package.\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End","_fossLight_MODIFIED_DATE":[],"_fossLight_MODIFIER":[],"_fossLight_OBLIGATION_DISCLOSING_SRC":false,"_fossLight_OBLIGATION_NEEDS_CHECK":false,"_fossLight_OBLIGATION_NOTIFICATION":true,"_fossLight_REQ_LICENSE_TEXT":false,"_fossLight_RESTRICTION":"","_fossLight_SHORT_IDENTIFIER":"ClArtistic","_fossLight_USE":true,"_fossLight_WEBPAGE":"https://spdx.org/licenses/ClArtistic.html","_fossLight_id":553,"_fossLight_name":"fosslight:Clarified Artistic License","_fossLight_type":"FOSSLight_License_Type_Permissive"},"_FOSSLightFact_Nicks":[]},"type":"FOSSLight"},{"applicableLNs":{"contents":[{"contents":"ifrOSS:Clarified Artistic License","tag":"LN"},[{"contents":"Clarified Artistic License","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["ifrOSS License","23fa8c7d6712481f13d87e3c1db99421"],"impliedStmts":[{"contents":[null,"http://www.statistica.unimib.it/utenti/dellavedova/software/artistic2.html"],"tag":"LicenseUrl"},{"contents":[{"contents":[{"contents":{"contents":{"contents":["ifrOSS Classification","Lizenzen mit Wahlmglichkeiten",{"contents":"Diese Lizenzen sehen unterschiedliche rechtliche Folgen vor, je nachdem wie umfangreich eine Modifikation ist. Zudem werden dem Lizenznehmer verschiedene Wahlmglichkeiten eingerumt, wie Weiterentwicklungen weiterverbreitet werden knnen.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"}]],"tag":"SubStatements"},[{"contents":{"contents":{"contents":["ifrOSS Classification","Open Source Lizenzen",{"contents":"Die hier aufgefhrten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschrnktem Copyleft-Effekt](#lizenzen-mit-beschrnktem-copyleft-effekt)\n* [Lizenzen mit Wahlmglichkeiten](#lizenzen-mit-wahlmglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgefhrten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"}],"raw":{"ifrossCategoriesWithDescription":[["Open Source Lizenzen","Die hier aufgefhrten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschrnktem Copyleft-Effekt](#lizenzen-mit-beschrnktem-copyleft-effekt)\n* [Lizenzen mit Wahlmglichkeiten](#lizenzen-mit-wahlmglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgefhrten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n"],["Lizenzen mit Wahlmglichkeiten","Diese Lizenzen sehen unterschiedliche rechtliche Folgen vor, je nachdem wie umfangreich eine Modifikation ist. Zudem werden dem Lizenznehmer verschiedene Wahlmglichkeiten eingerumt, wie Weiterentwicklungen weiterverbreitet werden knnen."]],"ifrossLicenseName":"ifrOSS:Clarified Artistic License","ifrossLicenseNameShortened":"Clarified Artistic License","ifrossLicenseUrl":"http://www.statistica.unimib.it/utenti/dellavedova/software/artistic2.html"},"type":"ifrOSS License"},{"applicableLNs":{"contents":[{"contents":"ClArtistic","tag":"LN"},[{"contents":"Artistic (clarified)","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Curation","a8e3693d51ce36d8361c1ffdda86e5a4"],"impliedStmts":[],"raw":[{"contents":[{"contents":"ClArtistic","tag":"LN"},[{"contents":"Artistic (clarified)","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"type":"Curation"}]