[{"applicableLNs":{"contents":[{"contents":"spdx:FTL","tag":"LN"},[{"contents":"Freetype Project License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","2ab0594dfa87b7a819fc3327e999944a"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","This license was released 27 Jan 2006"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"The FreeType Project LICENSE\n\n2006-Jan-27\n\nCopyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n\nThe FreeType Project is distributed in several archive packages; some of them may contain, in addition to the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType Project.\n\nThis license applies to all files found in such packages, and which do not fall under their own explicit license. The license affects thus the FreeType font engine, the test programs, documentation and makefiles, at the very least.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n     o We don't promise that this software works. However, we will be interested in any kind of bug reports. (`as is' distribution)\n\n     o You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n     o You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering The FreeType Project and assume no liability related to The FreeType Project.\n\nFinally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this license. We thus encourage you to use the following text:\n\n     \"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved. \"\"\"\n\nPlease replace <year> with the value from the FreeType version you actually use.\n\nLegal Terms\n\n0. Definitions\n\nThroughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n\n`You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using the FreeType engine'.\n\nThis license applies to all files distributed in the original FreeType Project, including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\nThe FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner Lemberg. All rights reserved except as specified below.\n\n1. No Warranty\n\nTHE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n\nThis license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the FreeType Project (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n     o Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n     o Redistribution in binary form must provide a disclaimer that states that the software is based in part of the work of the FreeType Team, in the distribution documentation. We also encourage you to put an URL to the FreeType web page in your documentation, though this isn't mandatory.\n\nThese conditions apply to any software derived from or based on the FreeType Project, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n3. Advertising\n\nNeither the FreeType authors and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\nWe suggest, but do not require, that you use one or more of the following phrases to refer to this software in your documentation or advertising materials: `FreeType Project', `FreeType Engine', `FreeType library', or `FreeType Distribution'.\n\nAs you have not signed this license, you are not required to accept it. However, as the FreeType Project is copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the FreeType Project, you indicate that you understand and accept all the terms of this license.\n\n4. Contacts\n\nThere are two mailing lists related to FreeType:\n\n     o freetype@nongnu.org\n\n     Discusses general use and applications of FreeType, as well as future and wanted additions to the library and distribution. If you are looking for support, start in this list if you haven't found anything to help you in the documentation.\n\n     o freetype-devel@nongnu.org\n\n     Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n\nOur home page can be found at\n\n http://www.freetype.org\n\n--- end of FTL.TXT ---\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The FreeType Project LICENSE</p>\n\n         <p>2006-Jan-27</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg</p>\n\n         <p>Introduction</p>\n\n         <p>The FreeType Project is distributed in several archive packages; some of them may contain, in addition to\n         the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType\n         Project.</p>\n\n         <p>This license applies to all files found in such packages, and which do not fall under their own explicit\n         license. The license affects thus the FreeType font engine, the test programs, documentation and\n         makefiles, at the very least.</p>\n\n         <p>This license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all\n         encourage inclusion and use of free software in commercial and freeware products alike. As a\n         consequence, its main points are that:</p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          We don&apos;t promise that this software works. However, we will be interested in any kind of bug reports.\n             (`as is&apos; distribution)\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          You can use this software for whatever you want, in parts or full form, without having to pay us.\n             (`royalty-free&apos; usage)\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you\n             must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits&apos;)\n        </li>\n         \n</ul>\n         <p>We specifically permit and encourage the inclusion of this software, with or without modifications, in\n         commercial products. We disclaim all warranties covering The FreeType Project and assume no liability\n         related to The FreeType Project.</p>\n\n         <p>Finally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this\n         license. We thus encourage you to use the following text:</p>\n\n         <p>&quot;&quot;&quot; Portions of this software are copyright © &lt;year&gt; The FreeType Project (www.freetype.org). All\n         rights reserved. &quot;&quot;&quot;</p>\n\n         <p>Please replace &lt;year&gt; with the value from the FreeType version you actually use.</p>\n\n      </div>\n\n      <p>Legal Terms</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 0.</var>\n          Definitions\n          <p>Throughout this license, the terms `package&apos;, `FreeType Project&apos;, and `FreeType archive&apos; refer to\n             the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and\n             Werner Lemberg) as the `FreeType Project&apos;, be they named as alpha, beta or final release.</p>\n\n            <p>`You&apos; refers to the licensee, or person using the project, where `using&apos; is a generic term\n             including compiling the project&apos;s source code as well as linking it to form a `program&apos; or\n             `executable&apos;. This program is referred to as `a program using the FreeType engine&apos;.</p>\n\n            <p>This license applies to all files distributed in the original FreeType Project, including all\n             source code, binaries and documentation, unless otherwise stated in the file in its original,\n             unmodified form as distributed in the original archive. If you are unsure whether or not a\n             particular file is covered by this license, you must contact us to verify this.</p>\n\n            <p>The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner\n             Lemberg. All rights reserved except as specified below.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          No Warranty\n          <p>THE FREETYPE PROJECT IS PROVIDED `AS IS&apos; WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,\n             INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n             PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES\n             CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Redistribution\n          <p>This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to\n             use, execute, perform, compile, display, copy, create derivative works of, distribute and\n             sublicense the FreeType Project (in both source and object code forms) and derivative works\n             thereof for any purpose; and to authorize others to exercise some or all of the rights granted\n             herein, subject to the following conditions:</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              Redistribution of source code must retain this license file (`FTL.TXT&apos;) unaltered; any\n                 additions, deletions or changes to the original files must be clearly indicated in\n                 accompanying documentation. The copyright notices of the unaltered, original files must be\n                 preserved in all copies of source files.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              Redistribution in binary form must provide a disclaimer that states that the software is based\n                 in part of the work of the FreeType Team, in the distribution documentation. We also encourage\n                 you to put an URL to the FreeType web page in your documentation, though this isn&apos;t\n                 mandatory.\n            </li>\n            \n</ul>\n            <p>These conditions apply to any software derived from or based on the FreeType Project, not just\n             the unmodified files. If you use our work, you must acknowledge us. However, no fee need be\n             paid to us.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Advertising\n          <p>Neither the FreeType authors and contributors nor you shall use the name of the other for\n             commercial, advertising, or promotional purposes without specific prior written\n             permission.</p>\n\n            <p>We suggest, but do not require, that you use one or more of the following phrases to refer to\n             this software in your documentation or advertising materials: `FreeType Project&apos;, `FreeType\n             Engine&apos;, `FreeType library&apos;, or `FreeType Distribution&apos;.</p>\n\n            <p>As you have not signed this license, you are not required to accept it. However, as the FreeType\n             Project is copyrighted material, only this license, or another one contracted with the\n             authors, grants you the right to use, distribute, and modify it. Therefore, by using,\n             distributing, or modifying the FreeType Project, you indicate that you understand and accept\n             all the terms of this license.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Contacts\n          <p>There are two mailing lists related to FreeType:</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              freetype@nongnu.org\n              <p>Discusses general use and applications of FreeType, as well as future and wanted additions to the library\n                 and distribution. If you are looking for support, start in this list if you haven&apos;t found anything to\n                 help you in the documentation.</p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              freetype-devel@nongnu.org\n              <p>Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.</p>\n\n               </li>\n            \n</ul>\n            <p>Our home page can be found at</p>\n\n            <p>http://www.freetype.org</p>\n\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>--- end of FTL.TXT ---</p>\n\n      </div>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://freetype.fis.uniroma2.it/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://freetype.fis.uniroma2.it/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":1,"timestamp":"2024-04-17T05:09:01Z","url":"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"},{"isLive":false,"isValid":true,"isWayBackLink":false,"match":"N/A","order":0,"timestamp":"2024-04-17T05:09:12Z","url":"http://freetype.fis.uniroma2.it/FTL.TXT"},{"isLive":false,"isValid":true,"isWayBackLink":false,"match":"N/A","order":2,"timestamp":"2024-04-17T05:09:12Z","url":"http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT"}],"isDeprecatedLicenseId":false,"isFsfLibre":true,"isOsiApproved":false,"licenseComments":"This license was released 27 Jan 2006","licenseId":"spdx:FTL","licenseText":"The FreeType Project LICENSE\n\n2006-Jan-27\n\nCopyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n\nThe FreeType Project is distributed in several archive packages; some of them may contain, in addition to the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType Project.\n\nThis license applies to all files found in such packages, and which do not fall under their own explicit license. The license affects thus the FreeType font engine, the test programs, documentation and makefiles, at the very least.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n     o We don't promise that this software works. However, we will be interested in any kind of bug reports. (`as is' distribution)\n\n     o You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n     o You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering The FreeType Project and assume no liability related to The FreeType Project.\n\nFinally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this license. We thus encourage you to use the following text:\n\n     \"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved. \"\"\"\n\nPlease replace <year> with the value from the FreeType version you actually use.\n\nLegal Terms\n\n0. Definitions\n\nThroughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n\n`You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using the FreeType engine'.\n\nThis license applies to all files distributed in the original FreeType Project, including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\nThe FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner Lemberg. All rights reserved except as specified below.\n\n1. No Warranty\n\nTHE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n\nThis license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the FreeType Project (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n     o Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n     o Redistribution in binary form must provide a disclaimer that states that the software is based in part of the work of the FreeType Team, in the distribution documentation. We also encourage you to put an URL to the FreeType web page in your documentation, though this isn't mandatory.\n\nThese conditions apply to any software derived from or based on the FreeType Project, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n3. Advertising\n\nNeither the FreeType authors and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\nWe suggest, but do not require, that you use one or more of the following phrases to refer to this software in your documentation or advertising materials: `FreeType Project', `FreeType Engine', `FreeType library', or `FreeType Distribution'.\n\nAs you have not signed this license, you are not required to accept it. However, as the FreeType Project is copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the FreeType Project, you indicate that you understand and accept all the terms of this license.\n\n4. Contacts\n\nThere are two mailing lists related to FreeType:\n\n     o freetype@nongnu.org\n\n     Discusses general use and applications of FreeType, as well as future and wanted additions to the library and distribution. If you are looking for support, start in this list if you haven't found anything to help you in the documentation.\n\n     o freetype-devel@nongnu.org\n\n     Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n\nOur home page can be found at\n\n http://www.freetype.org\n\n--- end of FTL.TXT ---\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The FreeType Project LICENSE</p>\n\n         <p>2006-Jan-27</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg</p>\n\n         <p>Introduction</p>\n\n         <p>The FreeType Project is distributed in several archive packages; some of them may contain, in addition to\n         the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType\n         Project.</p>\n\n         <p>This license applies to all files found in such packages, and which do not fall under their own explicit\n         license. The license affects thus the FreeType font engine, the test programs, documentation and\n         makefiles, at the very least.</p>\n\n         <p>This license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all\n         encourage inclusion and use of free software in commercial and freeware products alike. As a\n         consequence, its main points are that:</p>\n\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          We don&apos;t promise that this software works. However, we will be interested in any kind of bug reports.\n             (`as is&apos; distribution)\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          You can use this software for whatever you want, in parts or full form, without having to pay us.\n             (`royalty-free&apos; usage)\n        </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> o</var>\n          You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you\n             must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits&apos;)\n        </li>\n         \n</ul>\n         <p>We specifically permit and encourage the inclusion of this software, with or without modifications, in\n         commercial products. We disclaim all warranties covering The FreeType Project and assume no liability\n         related to The FreeType Project.</p>\n\n         <p>Finally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this\n         license. We thus encourage you to use the following text:</p>\n\n         <p>&quot;&quot;&quot; Portions of this software are copyright © &lt;year&gt; The FreeType Project (www.freetype.org). All\n         rights reserved. &quot;&quot;&quot;</p>\n\n         <p>Please replace &lt;year&gt; with the value from the FreeType version you actually use.</p>\n\n      </div>\n\n      <p>Legal Terms</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 0.</var>\n          Definitions\n          <p>Throughout this license, the terms `package&apos;, `FreeType Project&apos;, and `FreeType archive&apos; refer to\n             the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and\n             Werner Lemberg) as the `FreeType Project&apos;, be they named as alpha, beta or final release.</p>\n\n            <p>`You&apos; refers to the licensee, or person using the project, where `using&apos; is a generic term\n             including compiling the project&apos;s source code as well as linking it to form a `program&apos; or\n             `executable&apos;. This program is referred to as `a program using the FreeType engine&apos;.</p>\n\n            <p>This license applies to all files distributed in the original FreeType Project, including all\n             source code, binaries and documentation, unless otherwise stated in the file in its original,\n             unmodified form as distributed in the original archive. If you are unsure whether or not a\n             particular file is covered by this license, you must contact us to verify this.</p>\n\n            <p>The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner\n             Lemberg. All rights reserved except as specified below.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          No Warranty\n          <p>THE FREETYPE PROJECT IS PROVIDED `AS IS&apos; WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,\n             INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n             PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES\n             CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Redistribution\n          <p>This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to\n             use, execute, perform, compile, display, copy, create derivative works of, distribute and\n             sublicense the FreeType Project (in both source and object code forms) and derivative works\n             thereof for any purpose; and to authorize others to exercise some or all of the rights granted\n             herein, subject to the following conditions:</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              Redistribution of source code must retain this license file (`FTL.TXT&apos;) unaltered; any\n                 additions, deletions or changes to the original files must be clearly indicated in\n                 accompanying documentation. The copyright notices of the unaltered, original files must be\n                 preserved in all copies of source files.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              Redistribution in binary form must provide a disclaimer that states that the software is based\n                 in part of the work of the FreeType Team, in the distribution documentation. We also encourage\n                 you to put an URL to the FreeType web page in your documentation, though this isn&apos;t\n                 mandatory.\n            </li>\n            \n</ul>\n            <p>These conditions apply to any software derived from or based on the FreeType Project, not just\n             the unmodified files. If you use our work, you must acknowledge us. However, no fee need be\n             paid to us.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Advertising\n          <p>Neither the FreeType authors and contributors nor you shall use the name of the other for\n             commercial, advertising, or promotional purposes without specific prior written\n             permission.</p>\n\n            <p>We suggest, but do not require, that you use one or more of the following phrases to refer to\n             this software in your documentation or advertising materials: `FreeType Project&apos;, `FreeType\n             Engine&apos;, `FreeType library&apos;, or `FreeType Distribution&apos;.</p>\n\n            <p>As you have not signed this license, you are not required to accept it. However, as the FreeType\n             Project is copyrighted material, only this license, or another one contracted with the\n             authors, grants you the right to use, distribute, and modify it. Therefore, by using,\n             distributing, or modifying the FreeType Project, you indicate that you understand and accept\n             all the terms of this license.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Contacts\n          <p>There are two mailing lists related to FreeType:</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              freetype@nongnu.org\n              <p>Discusses general use and applications of FreeType, as well as future and wanted additions to the library\n                 and distribution. If you are looking for support, start in this list if you haven&apos;t found anything to\n                 help you in the documentation.</p>\n\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> o</var>\n              freetype-devel@nongnu.org\n              <p>Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.</p>\n\n               </li>\n            \n</ul>\n            <p>Our home page can be found at</p>\n\n            <p>http://www.freetype.org</p>\n\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>--- end of FTL.TXT ---</p>\n\n      </div>\n    ","name":"Freetype Project License","seeAlso":["http://freetype.fis.uniroma2.it/FTL.TXT","http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT","http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT"],"standardLicenseTemplate":"<<beginOptional>>The FreeType Project LICENSE\n\n2006-Jan-27\n\n<<endOptional>><<beginOptional>> Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n\nThe FreeType Project is distributed in several archive packages; some of them may contain, in addition to the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType Project.\n\nThis license applies to all files found in such packages, and which do not fall under their own explicit license. The license affects thus the FreeType font engine, the test programs, documentation and makefiles, at the very least.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> We don't promise that this software works. However, we will be interested in any kind of bug reports. (`as is' distribution)\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering The FreeType Project and assume no liability related to The FreeType Project.\n\nFinally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this license. We thus encourage you to use the following text:\n\n\"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved. \"\"\"\n\nPlease replace <year> with the value from the FreeType version you actually use.\n\n<<endOptional>>\n\nLegal Terms\n\n   <<var;name=\"bullet\";original=\"0.\";match=\".{0,20}\">> Definitions\n\n   Throughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n\n   `You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using the FreeType engine'.\n\n   This license applies to all files distributed in the original FreeType Project, including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\n   The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner Lemberg. All rights reserved except as specified below.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> No Warranty\n\n   THE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Redistribution\n\n   This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the FreeType Project (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> Redistribution in binary form must provide a disclaimer that states that the software is based in part of the work of the FreeType Team, in the distribution documentation. We also encourage you to put an URL to the FreeType web page in your documentation, though this isn't mandatory.\n\n   These conditions apply to any software derived from or based on the FreeType Project, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Advertising\n\n   Neither the FreeType authors and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\n   We suggest, but do not require, that you use one or more of the following phrases to refer to this software in your documentation or advertising materials: `FreeType Project', `FreeType Engine', `FreeType library', or `FreeType Distribution'.\n\n   As you have not signed this license, you are not required to accept it. However, as the FreeType Project is copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the FreeType Project, you indicate that you understand and accept all the terms of this license.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Contacts\n\n   There are two mailing lists related to FreeType:\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as future and wanted additions to the library and distribution. If you are looking for support, start in this list if you haven't found anything to help you in the documentation.\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">> freetype-devel@nongnu.org\n\n      Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n\n   Our home page can be found at\n\n   http://www.freetype.org\n\n   <<beginOptional>>--- end of FTL.TXT ---\n\n<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"google:FTL","tag":"LN"},[{"contents":"spdx:FTL","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["GoogleLicense","ecaba7603c98cb758bbedd3815e4e25e"],"impliedStmts":[{"contents":{"contents":{"contents":["Google Policy Classification","notice",{"contents":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"googleLicenseName":"google:FTL","googleLicenseType":"notice","googleLicenseTypeDescription":"notice - These licenses contain few restrictions, allowing original or modified third-party software to be shipped in any product without endangering or encumbering our source code. All of the licenses in this category do, however, have an \"original Copyright notice\" or \"advertising clause\", wherein any external distributions must include the notice or clause specified in the license.","spdxLicenseName":"spdx:FTL"},"type":"GoogleLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:FTL","tag":"LN"},[{"contents":"spdx:FTL","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Freetype License","tag":"LN"},{"contents":"FTL","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","62ddcb90ee8451ddcc7cee2a3d465ed4"],"impliedStmts":[{"contents":[{"contents":"[\"allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","allowed",{"contents":"A license is allowed if Fedora determines that the license is a free software / open source license. At a high level, the inquiry involves determining whether the license provides software freedom, and (equivalently) making sure that the license does not place burdens on users' exercise of its permissions that are inconsistent with evolving community norms and traditions around what is acceptable in a free software / open source license. See below for more on the history of Fedora licensing policy.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"http://freetype.fis.uniroma2.it/FTL.TXT"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":["FTL"],"_legacy_names":["Freetype License"],"_notes":null},"_id":"FTL","_license":{"_expression":"spdx:FTL","_scancode_key":null,"_status":["allowed"],"_text":null,"_urls":["http://freetype.fis.uniroma2.it/FTL.TXT"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"BlueOak:FTL","tag":"LN"},[{"contents":"Freetype Project License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","9921a851979c94a0d81a1a3d76d0d5ff"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Bronze",{"contents":"These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/FTL.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Bronze","These licenses lack important but nonessential elements of permissive open software licenses or impose additional requirements or restrictions, such as BSD-style prohibitions against endorsement and promotion.",{"_id":"FTL","_name":"Freetype Project License","_url":"https://spdx.org/licenses/FTL.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"osadl:FTL","tag":"LN"},[{"contents":"spdx:FTL","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["OSADLRule","c11ac9716efb103f2fcc309bb9ac938e"],"impliedStmts":[{"contents":[{"contents":"USE CASE Source code delivery\n\tYOU MUST Forward License text\n\tYOU MUST NOT Modify License text\n\tIF Software modification\n\t\tYOU MUST Provide Modification report\n\tYOU MUST Forward Copyright notices\n\tYOU MUST NOT Promote\n\tYOU MUST Credit FreeType Team\nUSE CASE Binary delivery\n\tYOU MUST Credit In Documentation FreeType Team\n\tYOU MUST NOT Promote\n\tYOU MUST Credit FreeType Team\n","tag":"LicenseRule"},[{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}]],"tag":"SubStatements"}],"raw":{"osadlRule":"USE CASE Source code delivery\n\tYOU MUST Forward License text\n\tYOU MUST NOT Modify License text\n\tIF Software modification\n\t\tYOU MUST Provide Modification report\n\tYOU MUST Forward Copyright notices\n\tYOU MUST NOT Promote\n\tYOU MUST Credit FreeType Team\nUSE CASE Binary delivery\n\tYOU MUST Credit In Documentation FreeType Team\n\tYOU MUST NOT Promote\n\tYOU MUST Credit FreeType Team\n","spdxId":"osadl:FTL"},"type":"OSADLRule"},{"applicableLNs":{"contents":"osadl:FTL","tag":"LN"},"id":["OSADLMatrix","7d0ea337c50b799ee1de25937374b761"],"impliedStmts":[{"contents":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the FTL license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.1 license and the FTL license are generally considered mutually compatible.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the FTL license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the FTL license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the FTL license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the FTL license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the FTL license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the FTL license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the FTL license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the FTL license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the FTL license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the FTL license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the FTL license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the FTL license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the FTL license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the FTL license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the FTL license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC0-1.0 license and the FTL license are generally considered mutually compatible.","_other":"CC0-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the FTL license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the FTL license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the FTL license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the FTL license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the FTL license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Same","_explanation":"n.a.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the FTL license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the FTL license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the FTL license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the FTL license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the FTL license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the FTL license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the FTL license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the FTL license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the FTL license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the FTL license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the FTL license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the FTL license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the FTL license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the FTL license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the FTL license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the FTL license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the FTL license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the FTL license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the FTL license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the FTL license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the FTL license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the FTL license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the FTL license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the FTL license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the FTL license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the FTL license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the FTL license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the FTL license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the FTL license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the FTL license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the FTL license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the FTL license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the FTL license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the FTL license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the FTL license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the FTL license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the FTL license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the FTL license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the FTL license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the FTL license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the FTL license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"ZPL-2.0"}],"tag":"LicenseCompatibilities"}],"raw":{"_name":"osadl:FTL","compatibilities":[{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the 0BSD license and the FTL license are generally considered mutually compatible.","_other":"0BSD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"AFL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-2.1 license and the FTL license are generally considered mutually compatible.","_other":"AFL-2.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the AFL-3.0 license and the FTL license are generally considered mutually compatible.","_other":"AFL-3.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the AGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"AGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.0 license and the FTL license are generally considered mutually compatible.","_other":"Apache-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-1.1 license and the FTL license are generally considered mutually compatible.","_other":"Apache-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Apache-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Apache-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0 license and the FTL license are generally considered mutually compatible.","_other":"Artistic-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-1.0-Perl license and the FTL license are generally considered mutually compatible.","_other":"Artistic-1.0-Perl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Artistic-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Artistic-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Bitstream-Vera license and the FTL license are generally considered mutually compatible.","_other":"Bitstream-Vera"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the blessing license and the FTL license are generally considered mutually compatible.","_other":"blessing"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-1-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-1-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-2-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-2-Clause-Patent license and the FTL license are generally considered mutually compatible.","_other":"BSD-2-Clause-Patent"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-3-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-3-Clause-Open-MPI license and the FTL license are generally considered mutually compatible.","_other":"BSD-3-Clause-Open-MPI"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause license and the FTL license are generally considered mutually compatible.","_other":"BSD-4-Clause"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-4-Clause-UC license and the FTL license are generally considered mutually compatible.","_other":"BSD-4-Clause-UC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSD-Source-Code license and the FTL license are generally considered mutually compatible.","_other":"BSD-Source-Code"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the BSL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"BSL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.5 license and the FTL license are generally considered mutually compatible.","_other":"bzip2-1.0.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the bzip2-1.0.6 license and the FTL license are generally considered mutually compatible.","_other":"bzip2-1.0.6"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-2.5 license and the FTL license are generally considered mutually compatible.","_other":"CC-BY-2.5"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC-BY-3.0 license and the FTL license are generally considered mutually compatible.","_other":"CC-BY-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the CC0-1.0 license and the FTL license are generally considered mutually compatible.","_other":"CC0-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CDDL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CDDL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the CPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"CPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the curl license and the FTL license are generally considered mutually compatible.","_other":"curl"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"ECL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ECL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"ECL-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the EFL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"EFL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EPL-1.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the EUPL-1.2 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"EUPL-1.2"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFAP license and the FTL license are generally considered mutually compatible.","_other":"FSFAP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFUL license and the FTL license are generally considered mutually compatible.","_other":"FSFUL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLR license and the FTL license are generally considered mutually compatible.","_other":"FSFULLR"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the FSFULLRWD license and the FTL license are generally considered mutually compatible.","_other":"FSFULLRWD"},{"_compatibility":"Same","_explanation":"n.a.","_other":"FTL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-1.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-1.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-only WITH Classpath-exception-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-only WITH Classpath-exception-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the GPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"GPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the HPND license and the FTL license are generally considered mutually compatible.","_other":"HPND"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IBM-pibs license and the FTL license are generally considered mutually compatible.","_other":"IBM-pibs"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ICU license and the FTL license are generally considered mutually compatible.","_other":"ICU"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the IJG license and the FTL license are generally considered mutually compatible.","_other":"IJG"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ImageMagick license and the FTL license are generally considered mutually compatible.","_other":"ImageMagick"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Info-ZIP license and the FTL license are generally considered mutually compatible.","_other":"Info-ZIP"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the IPL-1.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"IPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ISC license and the FTL license are generally considered mutually compatible.","_other":"ISC"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the JasPer-2.0 license and the FTL license are generally considered mutually compatible.","_other":"JasPer-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.0-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-2.1-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-2.1-or-later"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-only license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-only"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the LGPL-3.0-or-later license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"LGPL-3.0-or-later"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Libpng license and the FTL license are generally considered mutually compatible.","_other":"Libpng"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libpng-2.0 license and the FTL license are generally considered mutually compatible.","_other":"libpng-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the libtiff license and the FTL license are generally considered mutually compatible.","_other":"libtiff"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-info-zip-2003-05 license and the FTL license are generally considered mutually compatible.","_other":"LicenseRef-scancode-info-zip-2003-05"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the LicenseRef-scancode-ppp license and the FTL license are generally considered mutually compatible.","_other":"LicenseRef-scancode-ppp"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Minpack license and the FTL license are generally considered mutually compatible.","_other":"Minpack"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MirOS license and the FTL license are generally considered mutually compatible.","_other":"MirOS"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT license and the FTL license are generally considered mutually compatible.","_other":"MIT"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the MIT-CMU license and the FTL license are generally considered mutually compatible.","_other":"MIT-CMU"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-1.1 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-1.1"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MPL-2.0-no-copyleft-exception license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MPL-2.0-no-copyleft-exception"},{"_compatibility":"Unknown","_explanation":"It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases. Interpretation: It is unclear whether &quot;any portion of the software&quot; assumes code changes and additions that also must be distributed &quot;only under this license&quot;. In addition, a &quot;license that complies with this license&quot; may or may not be interpreted as a copyleft clause. If not, the copyleft condition would depend on the mode of delivery which would require a case-by-case assessment. Therefore, a general recommendation on the compatibility of the MS-PL license can only be given for selected cases.","_other":"MS-PL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the MS-RL license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"MS-RL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NBPL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"NBPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NCSA license and the FTL license are generally considered mutually compatible.","_other":"NCSA"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the NTP license and the FTL license are generally considered mutually compatible.","_other":"NTP"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the OLDAP-2.8 license and the FTL license are generally considered mutually compatible.","_other":"OLDAP-2.8"},{"_compatibility":"Unknown","_explanation":"The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases. Interpretation: The final statement of the appended SSLeay License &quot;The licence and distribution terms for any publically available version or derivative of this code cannot be changed&quot; normally must be interpreted as a copyleft clause, but there is no general consensus on this interpretation. Therefore, a recommendation on the compatibility of the OpenSSL license can only be given for selected cases.","_other":"OpenSSL"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the OSL-3.0 license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"OSL-3.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PHP-3.01 license and the FTL license are generally considered mutually compatible.","_other":"PHP-3.01"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the PostgreSQL license and the FTL license are generally considered mutually compatible.","_other":"PostgreSQL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Python-2.0 license and the FTL license are generally considered mutually compatible.","_other":"Python-2.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Qhull license and the FTL license are generally considered mutually compatible.","_other":"Qhull"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the RSA-MD license and the FTL license are generally considered mutually compatible.","_other":"RSA-MD"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Saxpath license and the FTL license are generally considered mutually compatible.","_other":"Saxpath"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SGI-B-2.0 license and the FTL license are generally considered mutually compatible.","_other":"SGI-B-2.0"},{"_compatibility":"No","_explanation":"Software under a copyleft license such as the Sleepycat license normally cannot be redistributed under a non-copyleft license such as the FTL license, except if it were explicitly permitted in the licenses.","_other":"Sleepycat"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SMLNJ license and the FTL license are generally considered mutually compatible.","_other":"SMLNJ"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-OpenSSH license and the FTL license are generally considered mutually compatible.","_other":"SSH-OpenSSH"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SSH-short license and the FTL license are generally considered mutually compatible.","_other":"SSH-short"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the SunPro license and the FTL license are generally considered mutually compatible.","_other":"SunPro"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2015 license and the FTL license are generally considered mutually compatible.","_other":"Unicode-DFS-2015"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unicode-DFS-2016 license and the FTL license are generally considered mutually compatible.","_other":"Unicode-DFS-2016"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Unlicense license and the FTL license are generally considered mutually compatible.","_other":"Unlicense"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the UPL-1.0 license and the FTL license are generally considered mutually compatible.","_other":"UPL-1.0"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C license and the FTL license are generally considered mutually compatible.","_other":"W3C"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-19980720 license and the FTL license are generally considered mutually compatible.","_other":"W3C-19980720"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the W3C-20150513 license and the FTL license are generally considered mutually compatible.","_other":"W3C-20150513"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the WTFPL license and the FTL license are generally considered mutually compatible.","_other":"WTFPL"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the X11 license and the FTL license are generally considered mutually compatible.","_other":"X11"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the XFree86-1.1 license and the FTL license are generally considered mutually compatible.","_other":"XFree86-1.1"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the Zlib license and the FTL license are generally considered mutually compatible.","_other":"Zlib"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the zlib-acknowledgement license and the FTL license are generally considered mutually compatible.","_other":"zlib-acknowledgement"},{"_compatibility":"Yes","_explanation":"Non-copyleft licenses such as the ZPL-2.0 license and the FTL license are generally considered mutually compatible.","_other":"ZPL-2.0"}]},"type":"OSADLMatrix"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fsf:freetype","tag":"LN"},[{"contents":"Freetype Project License","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"spdx:FTL","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FSF","2bd9106500b6fdcab2ab93b492ae689a"],"impliedStmts":[{"contents":[null,"https://www.gnu.org/licenses/license-list.html#freetype"],"tag":"LicenseUrl"},{"contents":[null,"http://directory.fsf.org/wiki/License:FreeType"],"tag":"LicenseUrl"},{"contents":{"contents":["FSF","gpl-3-compatible",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":{"contents":["FSF","Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_id":"fsf:freetype","_identifiers":{"spdx":["FTL"]},"_name":"Freetype Project License","_tags":["gpl-3-compatible","libre"],"_uris":["https://www.gnu.org/licenses/license-list.html#freetype","http://directory.fsf.org/wiki/License:FreeType"]},"type":"FSF"},{"applicableLNs":{"contents":[{"contents":"scancode:freetype","tag":"LN"},[{"contents":"FreeType Project License","tag":"LN"},{"contents":"FreeType Project License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","732794d4b6886c6dbf2071d693a9dd27"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":"http://www.freetype.org/license.html","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license was released 27 Jan 2006"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[null,"http://www.freetype.org/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://freetype.fis.uniroma2.it/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://freetype.org/patents.html"],"tag":"LicenseUrl"},{"contents":[null,"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://www.freetype.org/"],"tag":"LicenseUrl"},{"contents":"The FreeType Project LICENSE\n----------------------------\n2006-Jan-27\n\nCopyright 1996-2002, 2006 by\nDavid Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n============\n\n  The FreeType  Project is distributed in  several archive packages;\n  some of them may contain, in addition to the FreeType font engine,\n  various tools and  contributions which rely on, or  relate to, the\n  FreeType Project.\n\n  This  license applies  to all  files found  in such  packages, and\n  which do not  fall under their own explicit  license.  The license\n  affects  thus  the  FreeType   font  engine,  the  test  programs,\n  documentation and makefiles, at the very least.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We don't promise that this software works. However, we will be\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      FreeType code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We  disclaim  all warranties  covering  The  FreeType Project  and\n  assume no liability related to The FreeType Project.\n\n  Finally,  many  people  asked  us  for  a  preferred  form  for  a\n  credit/disclaimer to use in compliance with this license.  We thus\n  encourage you to use the following text:\n\n   \"\"\"  \n    Portions of this software are copyright © <year> The FreeType\n    Project (www.freetype.org).  All rights reserved.\n   \"\"\"\n\n  Please replace <year> with the value from the FreeType version you\n  actually use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `package', `FreeType Project',\n  and  `FreeType  archive' refer  to  the  set  of files  originally\n  distributed  by the  authors  (David Turner,  Robert Wilhelm,  and\n  Werner Lemberg) as the `FreeType Project', be they named as alpha,\n  beta or final release.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program is  referred to  as  `a program  using the  FreeType\n  engine'.\n\n  This  license applies  to all  files distributed  in  the original\n  FreeType  Project,   including  all  source   code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The FreeType  Project is copyright (C) 1996-2000  by David Turner,\n  Robert Wilhelm, and Werner Lemberg.  All rights reserved except as\n  specified below.\n\n1. No Warranty\n--------------\n\n  THE FREETYPE PROJECT  IS PROVIDED `AS IS' WITHOUT  WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE  FOR ANY DAMAGES CAUSED  BY THE USE OR  THE INABILITY TO\n  USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  FreeType Project (in  both source and  object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution of  source code  must retain this  license file\n      (`FTL.TXT') unaltered; any  additions, deletions or changes to\n      the original  files must be clearly  indicated in accompanying\n      documentation.   The  copyright   notices  of  the  unaltered,\n      original  files must  be  preserved in  all  copies of  source\n      files.\n\n    o Redistribution in binary form must provide a  disclaimer  that\n      states  that  the software is based in part of the work of the\n      FreeType Team,  in  the  distribution  documentation.  We also\n      encourage you to put an URL to the FreeType web page  in  your\n      documentation, though this isn't mandatory.\n\n  These conditions  apply to any  software derived from or  based on\n  the FreeType Project,  not just the unmodified files.   If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither the  FreeType authors and  contributors nor you  shall use\n  the name of the  other for commercial, advertising, or promotional\n  purposes without specific prior written permission.\n\n  We suggest,  but do not require, that  you use one or  more of the\n  following phrases to refer  to this software in your documentation\n  or advertising  materials: `FreeType Project',  `FreeType Engine',\n  `FreeType library', or `FreeType Distribution'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.   However,  as  the FreeType  Project  is  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  FreeType\n  Project, you indicate that you understand and accept all the terms\n  of this license.\n\n4. Contacts\n-----------\n\n  There are two mailing lists related to FreeType:\n\n    o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as\n      future and  wanted additions to the  library and distribution.\n      If  you are looking  for support,  start in  this list  if you\n      haven't found anything to help you in the documentation.\n\n    o freetype-devel@nongnu.org\n\n      Discusses bugs,  as well  as engine internals,  design issues,\n      specific licenses, porting, etc.\n\n  Our home page can be found at\n\n    http://www.freetype.org\n\n--- end of FTL.TXT ---","tag":"LicenseText"}],"raw":{"_category":"Permissive","_homepageUrl":"http://www.freetype.org/license.html","_key":"freetype","_name":"FreeType Project License","_notes":"Per SPDX.org, this license was released 27 Jan 2006","_osiUrl":null,"_otherUrls":["http://freetype.fis.uniroma2.it/FTL.TXT","http://freetype.org/patents.html","http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT","http://gitlab.freedesktop.org/freetype/freetype/-/raw/master/docs/FTL.TXT","http://www.freetype.org/"],"_owner":"FreeType Project","_shortName":"FreeType Project License","_spdxId":"FTL","_text":"The FreeType Project LICENSE\n----------------------------\n2006-Jan-27\n\nCopyright 1996-2002, 2006 by\nDavid Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n============\n\n  The FreeType  Project is distributed in  several archive packages;\n  some of them may contain, in addition to the FreeType font engine,\n  various tools and  contributions which rely on, or  relate to, the\n  FreeType Project.\n\n  This  license applies  to all  files found  in such  packages, and\n  which do not  fall under their own explicit  license.  The license\n  affects  thus  the  FreeType   font  engine,  the  test  programs,\n  documentation and makefiles, at the very least.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We don't promise that this software works. However, we will be\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      FreeType code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We  disclaim  all warranties  covering  The  FreeType Project  and\n  assume no liability related to The FreeType Project.\n\n  Finally,  many  people  asked  us  for  a  preferred  form  for  a\n  credit/disclaimer to use in compliance with this license.  We thus\n  encourage you to use the following text:\n\n   \"\"\"  \n    Portions of this software are copyright © <year> The FreeType\n    Project (www.freetype.org).  All rights reserved.\n   \"\"\"\n\n  Please replace <year> with the value from the FreeType version you\n  actually use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `package', `FreeType Project',\n  and  `FreeType  archive' refer  to  the  set  of files  originally\n  distributed  by the  authors  (David Turner,  Robert Wilhelm,  and\n  Werner Lemberg) as the `FreeType Project', be they named as alpha,\n  beta or final release.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program is  referred to  as  `a program  using the  FreeType\n  engine'.\n\n  This  license applies  to all  files distributed  in  the original\n  FreeType  Project,   including  all  source   code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The FreeType  Project is copyright (C) 1996-2000  by David Turner,\n  Robert Wilhelm, and Werner Lemberg.  All rights reserved except as\n  specified below.\n\n1. No Warranty\n--------------\n\n  THE FREETYPE PROJECT  IS PROVIDED `AS IS' WITHOUT  WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE  FOR ANY DAMAGES CAUSED  BY THE USE OR  THE INABILITY TO\n  USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  FreeType Project (in  both source and  object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution of  source code  must retain this  license file\n      (`FTL.TXT') unaltered; any  additions, deletions or changes to\n      the original  files must be clearly  indicated in accompanying\n      documentation.   The  copyright   notices  of  the  unaltered,\n      original  files must  be  preserved in  all  copies of  source\n      files.\n\n    o Redistribution in binary form must provide a  disclaimer  that\n      states  that  the software is based in part of the work of the\n      FreeType Team,  in  the  distribution  documentation.  We also\n      encourage you to put an URL to the FreeType web page  in  your\n      documentation, though this isn't mandatory.\n\n  These conditions  apply to any  software derived from or  based on\n  the FreeType Project,  not just the unmodified files.   If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither the  FreeType authors and  contributors nor you  shall use\n  the name of the  other for commercial, advertising, or promotional\n  purposes without specific prior written permission.\n\n  We suggest,  but do not require, that  you use one or  more of the\n  following phrases to refer  to this software in your documentation\n  or advertising  materials: `FreeType Project',  `FreeType Engine',\n  `FreeType library', or `FreeType Distribution'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.   However,  as  the FreeType  Project  is  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  FreeType\n  Project, you indicate that you understand and accept all the terms\n  of this license.\n\n4. Contacts\n-----------\n\n  There are two mailing lists related to FreeType:\n\n    o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as\n      future and  wanted additions to the  library and distribution.\n      If  you are looking  for support,  start in  this list  if you\n      haven't found anything to help you in the documentation.\n\n    o freetype-devel@nongnu.org\n\n      Discusses bugs,  as well  as engine internals,  design issues,\n      specific licenses, porting, etc.\n\n  Our home page can be found at\n\n    http://www.freetype.org\n\n--- end of FTL.TXT ---","_textUrls":["http://www.freetype.org/FTL.TXT"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:FTL","tag":"LN"},[{"contents":"Freetype Project License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","3b7e9c86519d6edbfd973a5c65ef8717"],"impliedStmts":[{"contents":{"contents":[null,"http://freetype.fis.uniroma2.it/FTL.TXT"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","This license was released 27 Jan 2006"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The FreeType Project LICENSE\n\n2006-Jan-27 Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n\nThe FreeType Project is distributed in several archive packages; some of them may contain, in addition to the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType Project.\n\nThis license applies to all files found in such packages, and which do not fall under their own explicit license. The license affects thus the FreeType font engine, the test programs, documentation and makefiles, at the very least.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n   o We don't promise that this software works. However, we will be interested in any kind of bug reports. (`as is' distribution)\n\n   o You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n   o You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering The FreeType Project and assume no liability related to The FreeType Project.\n\nFinally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this license. We thus encourage you to use the following text:\n\n\"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved. \"\"\"\n\nPlease replace <year> with the value from the FreeType version you actually use.\n\nLegal Terms\n\n   0. Definitions\n\n   Throughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n\n   `You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using the FreeType engine'.\n\n   This license applies to all files distributed in the original FreeType Project, including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\n   The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner Lemberg. All rights reserved except as specified below.\n\n   1. No Warranty\n\n   THE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n\n   2. Redistribution\n\n   This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the FreeType Project (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n      o Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n      o Redistribution in binary form must provide a disclaimer that states that the software is based in part of the work of the FreeType Team, in the distribution documentation. We also encourage you to put an URL to the FreeType web page in your documentation, though this isn't mandatory.\n\n   These conditions apply to any software derived from or based on the FreeType Project, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n   3. Advertising\n\n   Neither the FreeType authors and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\n   We suggest, but do not require, that you use one or more of the following phrases to refer to this software in your documentation or advertising materials: `FreeType Project', `FreeType Engine', `FreeType library', or `FreeType Distribution'.\n\n   As you have not signed this license, you are not required to accept it. However, as the FreeType Project is copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the FreeType Project, you indicate that you understand and accept all the terms of this license.\n\n   4. Contacts\n\n   There are two mailing lists related to FreeType:\n\n      o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as future and wanted additions to the library and distribution. If you are looking for support, start in this list if you haven't found anything to help you in the documentation.\n\n      o freetype-devel@nongnu.org\n\n      Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n\n   Our home page can be found at\n\n   http://www.freetype.org --- end of FTL.TXT ---","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Freetype Project License","_rf_notes":"This license was released 27 Jan 2006","_rf_risk":null,"_rf_shortname":"fossology:FTL","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The FreeType Project LICENSE\n\n2006-Jan-27 Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n\nThe FreeType Project is distributed in several archive packages; some of them may contain, in addition to the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType Project.\n\nThis license applies to all files found in such packages, and which do not fall under their own explicit license. The license affects thus the FreeType font engine, the test programs, documentation and makefiles, at the very least.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n   o We don't promise that this software works. However, we will be interested in any kind of bug reports. (`as is' distribution)\n\n   o You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n   o You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering The FreeType Project and assume no liability related to The FreeType Project.\n\nFinally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this license. We thus encourage you to use the following text:\n\n\"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved. \"\"\"\n\nPlease replace <year> with the value from the FreeType version you actually use.\n\nLegal Terms\n\n   0. Definitions\n\n   Throughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n\n   `You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using the FreeType engine'.\n\n   This license applies to all files distributed in the original FreeType Project, including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\n   The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner Lemberg. All rights reserved except as specified below.\n\n   1. No Warranty\n\n   THE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n\n   2. Redistribution\n\n   This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the FreeType Project (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n      o Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n      o Redistribution in binary form must provide a disclaimer that states that the software is based in part of the work of the FreeType Team, in the distribution documentation. We also encourage you to put an URL to the FreeType web page in your documentation, though this isn't mandatory.\n\n   These conditions apply to any software derived from or based on the FreeType Project, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n   3. Advertising\n\n   Neither the FreeType authors and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\n   We suggest, but do not require, that you use one or more of the following phrases to refer to this software in your documentation or advertising materials: `FreeType Project', `FreeType Engine', `FreeType library', or `FreeType Distribution'.\n\n   As you have not signed this license, you are not required to accept it. However, as the FreeType Project is copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the FreeType Project, you indicate that you understand and accept all the terms of this license.\n\n   4. Contacts\n\n   There are two mailing lists related to FreeType:\n\n      o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as future and wanted additions to the library and distribution. If you are looking for support, start in this list if you haven't found anything to help you in the documentation.\n\n      o freetype-devel@nongnu.org\n\n      Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n\n   Our home page can be found at\n\n   http://www.freetype.org --- end of FTL.TXT ---","_rf_text_updatable":false,"_rf_url":"http://freetype.fis.uniroma2.it/FTL.TXT"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:FTL","tag":"LN"},"id":["OrtLicenseCategorization","a59bc3b4e16cb50b90c84acfe8d1dbfb"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"permissive"},{"description":null,"name":"include-in-notice-file"}],"_olcLicensename":"SPDX:FTL"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":"SPDX:FTL","tag":"LN"},"id":["OrtLicenseCategorization","696f98efa52a0e5c4742bab7c6754fa1"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","permissive",{"contents":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","property:include-in-notice-file",{"contents":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"contents":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":"Open source license that is made available under \"non-copyleft\" licenses. These generally require attribution of the included works and may include other obligations.","name":"permissive"},{"description":"Whether the license includes a notice obligation or similar which can be fulfilled by adding the relevant copyright notices and the license text into the project/product notice file.","name":"property:include-in-notice-file"},{"description":"Same as above, as a temporary work-around for the category name not being configurable in ORT reports, see https://github.com/oss-review-toolkit/ort/issues/8220.","name":"include-in-notice-file"}],"_olcLicensename":"SPDX:FTL"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:FTL","tag":"LN"},[{"contents":"FTL","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","3af3425816635d69b7c44381d018d87f"],"impliedStmts":[],"raw":{"_clcAlias":["FTL"],"_clcName":"cavil:FTL"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:FreeType Project License","tag":"LN"},[{"contents":"spdx:FTL","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"FreeType","tag":"LN"},{"contents":"and may include FreeType","tag":"LN"},{"contents":"License: FTL","tag":"LN"},{"contents":"FreeType project license","tag":"LN"},{"contents":"Freetype Project License","tag":"LN"},{"contents":"FreeType Project LICENSE","tag":"LN"},{"contents":"http://www.freetype.org/FTL.TXT","tag":"LN"},{"contents":"http://www.freetype.org/license.html","tag":"LN"},{"contents":"https://spdx.org/licenses/ftl","tag":"LN"},{"contents":"FreeType License","tag":"LN"},{"contents":"scancode:freetype","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","9ff9d062df5def61d9cda04e56f4f5e7"],"impliedStmts":[{"contents":{"contents":{"contents":["CoDEStatus","Approved",{"contents":"Eine Lizenz ist freigegeben, wenn sie nach fachlicher und juristischer Prüfung seitens Open CoDE sowohl der Open Source Definition (gemäß Definition der Open Source Initiative [extern]) entspricht und darüber hinaus keine für die Öffentliche Verwaltung erkennbaren Schwierigkeiten birgt. Außer in Ausnahmefällen ist nicht zu erwarten, dass einmal freigegebene Lizenzen deklassifiziert werden.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_alternativeNames":["and may include FreeType","License: FTL","FreeType project license","Freetype Project License","FreeType Project LICENSE","http://www.freetype.org/FTL.TXT","http://www.freetype.org/license.html","https://spdx.org/licenses/ftl","FreeType License"],"_canonicalName":"metaeffekt:FreeType Project License","_category":"FreeType","_openCoDEStatus":"approved","_otherIds":["scancode:freetype"],"_shortName":null,"_spdxIdentifier":"spdx:FTL"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"foss-license:FreeType Project License","tag":"LN"},[{"contents":"scancode:freetype","tag":"LN"},{"contents":"Freetype Project License","tag":"LN"},{"contents":"FreeType Project License","tag":"LN"},{"contents":"FreeType Project LICENSE","tag":"LN"},{"contents":"FreeType","tag":"LN"},{"contents":"scancode://freetype","tag":"LN"},{"contents":"License: FTL","tag":"LN"},{"contents":"FreeType project license","tag":"LN"},{"contents":"http://www.freetype.org/FTL.TXT","tag":"LN"},{"contents":"http://www.freetype.org/license.html","tag":"LN"},{"contents":"https://spdx.org/licenses/ftl","tag":"LN"},{"contents":"FreeType License","tag":"LN"},{"contents":"scancode:freetype","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["FossLicense","1c35c1cab7d521237c108d1f483c1f01"],"impliedStmts":[],"raw":{"aliases":["Freetype Project License","FreeType Project License","FreeType Project LICENSE","FreeType","scancode://freetype","License: FTL","FreeType project license","http://www.freetype.org/FTL.TXT","http://www.freetype.org/license.html","https://spdx.org/licenses/ftl","FreeType License","scancode:freetype"],"meta":{"comment":"","disclaimer":"https://github.com/hesa/license-db/tree/main/var/disclamer.md"},"name":"FreeType Project License","scancode_key":"freetype","spdxid":"FTL","text":"The FreeType Project LICENSE\n----------------------------\n2006-Jan-27\n\nCopyright 1996-2002, 2006 by\nDavid Turner, Robert Wilhelm, and Werner Lemberg\n\nIntroduction\n============\n\n  The FreeType  Project is distributed in  several archive packages;\n  some of them may contain, in addition to the FreeType font engine,\n  various tools and  contributions which rely on, or  relate to, the\n  FreeType Project.\n\n  This  license applies  to all  files found  in such  packages, and\n  which do not  fall under their own explicit  license.  The license\n  affects  thus  the  FreeType   font  engine,  the  test  programs,\n  documentation and makefiles, at the very least.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We don't promise that this software works. However, we will be\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      FreeType code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We  disclaim  all warranties  covering  The  FreeType Project  and\n  assume no liability related to The FreeType Project.\n\n  Finally,  many  people  asked  us  for  a  preferred  form  for  a\n  credit/disclaimer to use in compliance with this license.  We thus\n  encourage you to use the following text:\n\n   \"\"\"  \n    Portions of this software are copyright © <year> The FreeType\n    Project (www.freetype.org).  All rights reserved.\n   \"\"\"\n\n  Please replace <year> with the value from the FreeType version you\n  actually use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `package', `FreeType Project',\n  and  `FreeType  archive' refer  to  the  set  of files  originally\n  distributed  by the  authors  (David Turner,  Robert Wilhelm,  and\n  Werner Lemberg) as the `FreeType Project', be they named as alpha,\n  beta or final release.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program is  referred to  as  `a program  using the  FreeType\n  engine'.\n\n  This  license applies  to all  files distributed  in  the original\n  FreeType  Project,   including  all  source   code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The FreeType  Project is copyright (C) 1996-2000  by David Turner,\n  Robert Wilhelm, and Werner Lemberg.  All rights reserved except as\n  specified below.\n\n1. No Warranty\n--------------\n\n  THE FREETYPE PROJECT  IS PROVIDED `AS IS' WITHOUT  WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE  FOR ANY DAMAGES CAUSED  BY THE USE OR  THE INABILITY TO\n  USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  FreeType Project (in  both source and  object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution of  source code  must retain this  license file\n      (`FTL.TXT') unaltered; any  additions, deletions or changes to\n      the original  files must be clearly  indicated in accompanying\n      documentation.   The  copyright   notices  of  the  unaltered,\n      original  files must  be  preserved in  all  copies of  source\n      files.\n\n    o Redistribution in binary form must provide a  disclaimer  that\n      states  that  the software is based in part of the work of the\n      FreeType Team,  in  the  distribution  documentation.  We also\n      encourage you to put an URL to the FreeType web page  in  your\n      documentation, though this isn't mandatory.\n\n  These conditions  apply to any  software derived from or  based on\n  the FreeType Project,  not just the unmodified files.   If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither the  FreeType authors and  contributors nor you  shall use\n  the name of the  other for commercial, advertising, or promotional\n  purposes without specific prior written permission.\n\n  We suggest,  but do not require, that  you use one or  more of the\n  following phrases to refer  to this software in your documentation\n  or advertising  materials: `FreeType Project',  `FreeType Engine',\n  `FreeType library', or `FreeType Distribution'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.   However,  as  the FreeType  Project  is  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  FreeType\n  Project, you indicate that you understand and accept all the terms\n  of this license.\n\n4. Contacts\n-----------\n\n  There are two mailing lists related to FreeType:\n\n    o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as\n      future and  wanted additions to the  library and distribution.\n      If  you are looking  for support,  start in  this list  if you\n      haven't found anything to help you in the documentation.\n\n    o freetype-devel@nongnu.org\n\n      Discusses bugs,  as well  as engine internals,  design issues,\n      specific licenses, porting, etc.\n\n  Our home page can be found at\n\n    http://www.freetype.org\n\n--- end of FTL.TXT ---"},"type":"FossLicense"},{"applicableLNs":{"contents":[{"contents":"hitachi:FreeType Project LICENSE","tag":"LN"},[]],"tag":"AlternativeLNs"},"id":["HitachiOpenLicense","965eaf4caf4cab092c3d1887d7da117c"],"impliedStmts":[{"contents":"                    The FreeType Project LICENSE\n                    ----------------------------\n\n                            2006-Jan-27\n\n                    Copyright 1996-2002, 2006 by\n          David Turner, Robert Wilhelm, and Werner Lemberg\n\n\n\nIntroduction\n============\n\n  The FreeType  Project is distributed in  several archive packages;\n  some of them may contain, in addition to the FreeType font engine,\n  various tools and  contributions which rely on, or  relate to, the\n  FreeType Project.\n\n  This  license applies  to all  files found  in such  packages, and\n  which do not  fall under their own explicit  license.  The license\n  affects  thus  the  FreeType   font  engine,  the  test  programs,\n  documentation and makefiles, at the very least.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We don't promise that this software works. However, we will be\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      FreeType code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We  disclaim  all warranties  covering  The  FreeType Project  and\n  assume no liability related to The FreeType Project.\n\n\n  Finally,  many  people  asked  us  for  a  preferred  form  for  a\n  credit/disclaimer to use in compliance with this license.  We thus\n  encourage you to use the following text:\n\n   \"\"\"\n    Portions of this software are copyright ｩ <year> The FreeType\n    Project (www.freetype.org).  All rights reserved.\n   \"\"\"\n\n  Please replace <year> with the value from the FreeType version you\n  actually use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `package', `FreeType Project',\n  and  `FreeType  archive' refer  to  the  set  of files  originally\n  distributed  by the  authors  (David Turner,  Robert Wilhelm,  and\n  Werner Lemberg) as the `FreeType Project', be they named as alpha,\n  beta or final release.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program is  referred to  as  `a program  using the  FreeType\n  engine'.\n\n  This  license applies  to all  files distributed  in  the original\n  FreeType  Project,   including  all  source   code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The FreeType  Project is copyright (C) 1996-2000  by David Turner,\n  Robert Wilhelm, and Werner Lemberg.  All rights reserved except as\n  specified below.\n\n1. No Warranty\n--------------\n\n  THE FREETYPE PROJECT  IS PROVIDED `AS IS' WITHOUT  WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE  FOR ANY DAMAGES CAUSED  BY THE USE OR  THE INABILITY TO\n  USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  FreeType Project (in  both source and  object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution of  source code  must retain this  license file\n      (`FTL.TXT') unaltered; any  additions, deletions or changes to\n      the original  files must be clearly  indicated in accompanying\n      documentation.   The  copyright   notices  of  the  unaltered,\n      original  files must  be  preserved in  all  copies of  source\n      files.\n\n    o Redistribution in binary form must provide a  disclaimer  that\n      states  that  the software is based in part of the work of the\n      FreeType Team,  in  the  distribution  documentation.  We also\n      encourage you to put an URL to the FreeType web page  in  your\n      documentation, though this isn't mandatory.\n\n  These conditions  apply to any  software derived from or  based on\n  the FreeType Project,  not just the unmodified files.   If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither the  FreeType authors and  contributors nor you  shall use\n  the name of the  other for commercial, advertising, or promotional\n  purposes without specific prior written permission.\n\n  We suggest,  but do not require, that  you use one or  more of the\n  following phrases to refer  to this software in your documentation\n  or advertising  materials: `FreeType Project',  `FreeType Engine',\n  `FreeType library', or `FreeType Distribution'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.   However,  as  the FreeType  Project  is  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  FreeType\n  Project, you indicate that you understand and accept all the terms\n  of this license.\n\n4. Contacts\n-----------\n\n  There are two mailing lists related to FreeType:\n\n    o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as\n      future and  wanted additions to the  library and distribution.\n      If  you are looking  for support,  start in  this list  if you\n      haven't found anything to help you in the documentation.\n\n    o freetype-devel@nongnu.org\n\n      Discusses bugs,  as well  as engine internals,  design issues,\n      specific licenses, porting, etc.\n\n  Our home page can be found at\n\n    http://www.freetype.org\n\n\n--- end of FTL.TXT ---","tag":"LicenseText"},{"contents":{"contents":["HitachiOpenLicense","package\", \"FreeType Project\", and \"FreeType archive\" are the original source code distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as \"FreeType Project\". Sublicense means all binaries and related documentation. Sublicensing means that a person who has been granted this license re-grants the license granted to a third party."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":["HitachiOpenLicense","http://www.freetype.org/license.html[http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT]"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"content":"                    The FreeType Project LICENSE\n                    ----------------------------\n\n                            2006-Jan-27\n\n                    Copyright 1996-2002, 2006 by\n          David Turner, Robert Wilhelm, and Werner Lemberg\n\n\n\nIntroduction\n============\n\n  The FreeType  Project is distributed in  several archive packages;\n  some of them may contain, in addition to the FreeType font engine,\n  various tools and  contributions which rely on, or  relate to, the\n  FreeType Project.\n\n  This  license applies  to all  files found  in such  packages, and\n  which do not  fall under their own explicit  license.  The license\n  affects  thus  the  FreeType   font  engine,  the  test  programs,\n  documentation and makefiles, at the very least.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We don't promise that this software works. However, we will be\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      FreeType code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We  disclaim  all warranties  covering  The  FreeType Project  and\n  assume no liability related to The FreeType Project.\n\n\n  Finally,  many  people  asked  us  for  a  preferred  form  for  a\n  credit/disclaimer to use in compliance with this license.  We thus\n  encourage you to use the following text:\n\n   \"\"\"\n    Portions of this software are copyright ｩ <year> The FreeType\n    Project (www.freetype.org).  All rights reserved.\n   \"\"\"\n\n  Please replace <year> with the value from the FreeType version you\n  actually use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `package', `FreeType Project',\n  and  `FreeType  archive' refer  to  the  set  of files  originally\n  distributed  by the  authors  (David Turner,  Robert Wilhelm,  and\n  Werner Lemberg) as the `FreeType Project', be they named as alpha,\n  beta or final release.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program is  referred to  as  `a program  using the  FreeType\n  engine'.\n\n  This  license applies  to all  files distributed  in  the original\n  FreeType  Project,   including  all  source   code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The FreeType  Project is copyright (C) 1996-2000  by David Turner,\n  Robert Wilhelm, and Werner Lemberg.  All rights reserved except as\n  specified below.\n\n1. No Warranty\n--------------\n\n  THE FREETYPE PROJECT  IS PROVIDED `AS IS' WITHOUT  WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE  FOR ANY DAMAGES CAUSED  BY THE USE OR  THE INABILITY TO\n  USE, OF THE FREETYPE PROJECT.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  FreeType Project (in  both source and  object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution of  source code  must retain this  license file\n      (`FTL.TXT') unaltered; any  additions, deletions or changes to\n      the original  files must be clearly  indicated in accompanying\n      documentation.   The  copyright   notices  of  the  unaltered,\n      original  files must  be  preserved in  all  copies of  source\n      files.\n\n    o Redistribution in binary form must provide a  disclaimer  that\n      states  that  the software is based in part of the work of the\n      FreeType Team,  in  the  distribution  documentation.  We also\n      encourage you to put an URL to the FreeType web page  in  your\n      documentation, though this isn't mandatory.\n\n  These conditions  apply to any  software derived from or  based on\n  the FreeType Project,  not just the unmodified files.   If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither the  FreeType authors and  contributors nor you  shall use\n  the name of the  other for commercial, advertising, or promotional\n  purposes without specific prior written permission.\n\n  We suggest,  but do not require, that  you use one or  more of the\n  following phrases to refer  to this software in your documentation\n  or advertising  materials: `FreeType Project',  `FreeType Engine',\n  `FreeType library', or `FreeType Distribution'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.   However,  as  the FreeType  Project  is  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  FreeType\n  Project, you indicate that you understand and accept all the terms\n  of this license.\n\n4. Contacts\n-----------\n\n  There are two mailing lists related to FreeType:\n\n    o freetype@nongnu.org\n\n      Discusses general use and applications of FreeType, as well as\n      future and  wanted additions to the  library and distribution.\n      If  you are looking  for support,  start in  this list  if you\n      haven't found anything to help you in the documentation.\n\n    o freetype-devel@nongnu.org\n\n      Discusses bugs,  as well  as engine internals,  design issues,\n      specific licenses, porting, etc.\n\n  Our home page can be found at\n\n    http://www.freetype.org\n\n\n--- end of FTL.TXT ---","description":"package\", \"FreeType Project\", and \"FreeType archive\" are the original source code distributed by the authors (David Turner, Robert Wilhelm, and Werner Lemberg) as \"FreeType Project\". Sublicense means all binaries and related documentation. Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"hitachi:FreeType Project LICENSE","notices":[{"contents":{"content":"the software is provided \"as-is\" and without any warranties of any kind, either express or implied, including, but not limited to, warranties of merchantability and fitness for a particular purpose. the software is provided \"as-is\" and without warranty of any kind, either express or implied, including, but not limited to, the warranties of commercial applicability and fitness for a particular purpose.","description":"There is no guarantee."},"tag":"Ol"},{"contents":{"content":"Neither the author nor the copyright holder shall be liable for any damage caused by the use or inability to use such software."},"tag":"Ol"}],"permissions":[{"_str":"Description: Related documents should be treated in the same way as software.\nActions:\n- Ol Use the obtained source code without modification (Use the fetched code as it is.)\n- Ol Using Modified Source Code\n- Ol Use the retrieved binaries (Use the fetched binary as it is.)\n- Ol Use binaries generated from modified source code\n\nConditions:\nOl RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n","actions":[{"contents":{"description":"Use the fetched code as it is.","name":"Use the obtained source code without modification"},"tag":"Ol"},{"contents":{"name":"Using Modified Source Code"},"tag":"Ol"},{"contents":{"description":"Use the fetched binary as it is.","name":"Use the retrieved binaries"},"tag":"Ol"},{"contents":{"name":"Use binaries generated from modified source code"},"tag":"Ol"}],"conditions":{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},"description":"Related documents should be treated in the same way as software."},{"_str":"Description: Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version.\nActions:\n- Ol Sublicense the acquired source code. (Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.)\n- Ol Sublicensing Modified Source Code (Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.)\n- Ol Sublicense the acquired binaries (Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.)\n- Ol Sublicense the generated binaries from modified source code (Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.)\n- Ol Display the obtained source code\n- Ol Execute the obtained source code.\n- Ol Display the modified source code\n- Ol Executing Modified Source Code\n- Ol Display the retrieved binary\n- Ol Display the generated binary from the modified source code\n- Ol Execute the generated binary from the modified source code\n- Ol Execute the obtained binary\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Acknowledgements\n\n","actions":[{"contents":{"description":"Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.","name":"Sublicense the acquired source code."},"tag":"Ol"},{"contents":{"description":"Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.","name":"Sublicensing Modified Source Code"},"tag":"Ol"},{"contents":{"description":"Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.","name":"Sublicense the acquired binaries"},"tag":"Ol"},{"contents":{"description":"Sublicensing means that the person to whom the license was granted re-grants the license granted to a third party.","name":"Sublicense the generated binaries from modified source code"},"tag":"Ol"},{"contents":{"name":"Display the obtained source code"},"tag":"Ol"},{"contents":{"name":"Execute the obtained source code."},"tag":"Ol"},{"contents":{"name":"Display the modified source code"},"tag":"Ol"},{"contents":{"name":"Executing Modified Source Code"},"tag":"Ol"},{"contents":{"name":"Display the retrieved binary"},"tag":"Ol"},{"contents":{"name":"Display the generated binary from the modified source code"},"tag":"Ol"},{"contents":{"name":"Execute the generated binary from the modified source code"},"tag":"Ol"},{"contents":{"name":"Execute the obtained binary"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Acknowledgements","type":"OBLIGATION"},"tag":"Ol"}]},"description":"Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version."},{"_str":"Description: Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version.\nActions:\n- Ol Distribute the obtained source code without modification (Redistribute the code as it was obtained)\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Give you a copy of the relevant license.\n  Ol OBLIGATION: Include the copyright notice contained in the software\n  Ol OBLIGATION: Acknowledgements\n\n","actions":[{"contents":{"description":"Redistribute the code as it was obtained","name":"Distribute the obtained source code without modification"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Give you a copy of the relevant license.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Include the copyright notice contained in the software","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Acknowledgements","type":"OBLIGATION"},"tag":"Ol"}]},"description":"Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version."},{"_str":"Description: Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version.\nActions:\n- Ol Modify the obtained source code.\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Indicate your changes in the materials that accompany the distribution.\n  Ol OBLIGATION: Include the copyright notice contained in the software\n  Ol OBLIGATION: Acknowledgements\n\n","actions":[{"contents":{"name":"Modify the obtained source code."},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Indicate your changes in the materials that accompany the distribution.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Include the copyright notice contained in the software","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Acknowledgements","type":"OBLIGATION"},"tag":"Ol"}]},"description":"Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version."},{"_str":"Description: Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version.\nActions:\n- Ol Distribution of Modified Source Code\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Give you a copy of the relevant license.\n  Ol OBLIGATION: Indicate your changes in the materials that accompany the distribution.\n  Ol OBLIGATION: Include the copyright notice contained in the software\n  Ol OBLIGATION: Acknowledgements\n\n","actions":[{"contents":{"name":"Distribution of Modified Source Code"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Give you a copy of the relevant license.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Indicate your changes in the materials that accompany the distribution.","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Include the copyright notice contained in the software","type":"OBLIGATION"},"tag":"Ol"},{"contents":{"name":"Acknowledgements","type":"OBLIGATION"},"tag":"Ol"}]},"description":"Related documentation should be treated in the same way as the software. Acknowledgments should include the following text: \"Portions of this software are copyrighted by The FreeType Project. \"Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version."},{"_str":"Description: The related documents should be treated in the same way as the software. It is recommended to include the URL to the FreeType web page [http://www.freetype.org] in the related documentation. It is recommended to include the following text in the acknowledgements.\" Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version.\nActions:\n- Ol Distribute the fetched binaries (Redistribute the fetched binaries as they are)\n- Ol Distribute the generated binaries from modified source code\n\nConditions:\nAND\n  Ol RESTRICTION: An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license. (Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.)\n  Ol OBLIGATION: Acknowledgements\n\n","actions":[{"contents":{"description":"Redistribute the fetched binaries as they are","name":"Distribute the fetched binaries"},"tag":"Ol"},{"contents":{"name":"Distribute the generated binaries from modified source code"},"tag":"Ol"}],"conditions":{"AND":[{"contents":{"description":"Sublicensing means that a person who has been granted this license re-grants the license granted to a third party.","name":"An unrestricted, royalty-free, worldwide supplyable copyright license is granted in accordance with this license.","type":"RESTRICTION"},"tag":"Ol"},{"contents":{"name":"Acknowledgements","type":"OBLIGATION"},"tag":"Ol"}]},"description":"The related documents should be treated in the same way as the software. It is recommended to include the URL to the FreeType web page [http://www.freetype.org] in the related documentation. It is recommended to include the following text in the acknowledgements.\" Portions of this software are copyright <year> The FreeType Project (www.freetype.org). Replace <year> with the year in effect for the actual version."},{"_str":"Description: You must treat the documentation in the same way as the software. It is recommended that you use one or more of the following phrases to identify the software in any material or advertisement accompanying the distribution: \"FreeType Project\", \"FreeType Engine\", \"FreeType library\", or \"FreeType Distribution\".\nActions:\n- Ol Use the names of authors and contributors in publicity and advertising.\n\nConditions:\nOl REQUISITE: Get special permission in writing.\n","actions":[{"contents":{"name":"Use the names of authors and contributors in publicity and advertising."},"tag":"Ol"}],"conditions":{"contents":{"name":"Get special permission in writing.","type":"REQUISITE"},"tag":"Ol"},"description":"You must treat the documentation in the same way as the software. It is recommended that you use one or more of the following phrases to identify the software in any material or advertisement accompanying the distribution: \"FreeType Project\", \"FreeType Engine\", \"FreeType library\", or \"FreeType Distribution\"."}],"summary":"http://www.freetype.org/license.html[http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT]"},"type":"HitachiOpenLicense"},{"applicableLNs":{"contents":[{"contents":"eclipse:FTL","tag":"LN"},[{"contents":"FreeType License","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["EclipseLicense","399b12ebf1bcef387760de8d81cdbab0"],"impliedStmts":[{"contents":{"contents":{"contents":["EclipseLicense","Approved",{"contents":"This approved license list enumerates the licenses that the Eclipse Foundation has approved for third-party content used by its projects. Inclusion in this list does not imply that the Eclipse Foundation has determined that every one of these licenses can be used by your Eclipse Foundation project. That is, the licenses on this list are not necessarily compatible with every Eclipse Foundation project license, or with each other. ","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"contents":["eclipse:FTL","FreeType License"],"tag":"ApprovedLicense"},"type":"EclipseLicense"},{"applicableLNs":{"contents":[{"contents":"ifrOSS:FreeType Project License","tag":"LN"},[{"contents":"FreeType Project License","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["ifrOSS License","aad554d86f574624ba2a6910933a0a30"],"impliedStmts":[{"contents":[null,"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"],"tag":"LicenseUrl"},{"contents":[{"contents":[{"contents":{"contents":{"contents":["ifrOSS Classification","Lizenzen ohne Copyleft-Effekt (\"Permissive Licenses\")",{"contents":"Lizenzen ohne Copyleft-Effekt zeichnen sich dadurch aus, dass sie dem Lizenznehmer alle Freiheiten einer Open Source Lizenz einräumen und für Veränderungen der Software keine Bedingungen hinsichtlich des zu verwendenden Lizenztyps enthalten. Damit kann der Lizenznehmer veränderte Versionen der Software unter beliebigen Lizenzbedingungen weiterverbreiten, also auch in proprietäre Software überführen.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}]],"tag":"SubStatements"},[{"contents":{"contents":{"contents":["ifrOSS Classification","Open Source Lizenzen",{"contents":"Die hier aufgeführten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschränktem Copyleft-Effekt](#lizenzen-mit-beschränktem-copyleft-effekt)\n* [Lizenzen mit Wahlmöglichkeiten](#lizenzen-mit-wahlmöglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgeführten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfüllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"}],"raw":{"ifrossCategoriesWithDescription":[["Open Source Lizenzen","Die hier aufgeführten Lizenzen entsprechen den Voraussetzungen der Free Software Definition und Open Source Definition. Sie\nwerden nach ihren lizenzrechtlichen Charakteristika in folgende Kategorien unterteilt:\n\n* [Lizenzen ohne Copyleft-Effekt](#lizenzen-ohne-copyleft-effekt-permissive-licenses)\n* [Lizenzen mit strengem Copyleft-Effekt](#lizenzen-mit-strengem-copyleft-effekt)\n* [Lizenzen mit beschränktem Copyleft-Effekt](#lizenzen-mit-beschränktem-copyleft-effekt)\n* [Lizenzen mit Wahlmöglichkeiten](#lizenzen-mit-wahlmöglichkeiten)\n* [Lizenzen mit Sonderrechten](#lizenzen-mit-sonderrechten)\n\nSoftware unter solchen Lizenzen kann als Freie oder Open Source Software bezeichnet werden. Bei einigen der aufgeführten Lizenzen ist umstritten oder unklar, ob diese Anforderungen erfüllt sind, da die relevanten Definitionen, die Free Software Definition und die Open Source Definition nicht identisch sind und zudem Lizenztexte nicht immer eindeutig formuliert sind. Diese Lizenzen sind mit \"Einordnung unklar\" gekennzeichnet.\n"],["Lizenzen ohne Copyleft-Effekt (\"Permissive Licenses\")","Lizenzen ohne Copyleft-Effekt zeichnen sich dadurch aus, dass sie dem Lizenznehmer alle Freiheiten einer Open Source Lizenz einräumen und für Veränderungen der Software keine Bedingungen hinsichtlich des zu verwendenden Lizenztyps enthalten. Damit kann der Lizenznehmer veränderte Versionen der Software unter beliebigen Lizenzbedingungen weiterverbreiten, also auch in proprietäre Software überführen."]],"ifrossLicenseName":"ifrOSS:FreeType Project License","ifrossLicenseNameShortened":"FreeType Project License","ifrossLicenseUrl":"http://git.savannah.gnu.org/cgit/freetype/freetype2.git/tree/docs/FTL.TXT"},"type":"ifrOSS License"}]