[{"applicableLNs":{"contents":[{"contents":"spdx:NASA-1.3","tag":"LN"},[{"contents":"NASA Open Source Agreement 1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","25d627b6c7f16ea1ef36ac42e36545d2"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Not-Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":null,"tag":"MaybeStatement"},{"contents":[{"contents":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency: _____ Government Agency Original Software Designation: __ Government Agency Original Software Title: _____ User Registration Requested. Please Visit http://___ Government Agency Point of Contact for Original Software: _____\n\nDEFINITIONS\n\nA. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification. B. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software. C. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device. D. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another. E. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement. F. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification. G. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation __ and entitled _________, including source code, object code and accompanying documentation, if any. H. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors. I. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made. J. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software. K. \"Sale\" means the exchange of the Subject Software for money or equivalent value. L. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof. M. \"Use\" means the application or employment of the Subject Software for any purpose.\n\nGRANT OF RIGHTS\n\nA. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n     1. Use\n     2. Distribution\n     3. Reproduction\n     4. Modification\n     5. Redistribution\n     6. Display\n\nB. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n     1. Use\n     2. Distribution\n     3. Reproduction\n     4. Sale\n     5. Offer for Sale\n\nC. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\nD. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\nOBLIGATIONS OF RECIPIENT\n\nA. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n     1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n     2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\nB. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n[Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n[The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by ___ ____. All Rights Reserved.\n\n[The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by ____ ____. No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\nC. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\nD. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\nE. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\nF. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website: ______. Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n[Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information: ______. Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\nG. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\nH. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\nI. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\nJ. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\nDISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\nA. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\nB. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\nGENERAL TERMS\n\nA. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\nB. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\nC. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\nD. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties.\n\nE. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\nF. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows: ___________.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>NASA OPEN SOURCE AGREEMENT VERSION 1.3</p>\n\n      </div>\n      <p>THIS OPEN SOURCE AGREEMENT (&quot;AGREEMENT&quot;) DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION,\n         MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES\n         GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (&quot;GOVERNMENT AGENCY&quot;). THE\n         UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY\n         OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES,\n         REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY\n         PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN\n         THIS AGREEMENT.</p>\n\n      <p>Government Agency: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>Government Agency Original Software Designation: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>Government Agency Original Software Title: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>User Registration Requested. Please Visit <var class=\"replaceable-license-text\"> http://_______________</var></p>\n\n      <p>Government Agency Point of Contact for Original Software: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n<ul style=\"list-style:none\">\n\n<li>\n            <p>DEFINITIONS</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> A.</var>\n              &quot;Contributor&quot; means Government Agency, as the developer of the Original Software, and\n                 any entity that makes a Modification.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> B.</var>\n                &quot;Covered Patents&quot; mean patent claims licensable by a Contributor that are necessarily\n                 infringed by the use or sale of its Modification alone or when combined with the Subject Software.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> C.</var>\n                 &quot;Display&quot; means the showing of a copy of the Subject Software, either directly or by means of an\n                 image, or any other device.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> D.</var>\n                &quot;Distribution&quot; means conveyance or transfer of the Subject Software, regardless of means,\n                 to another.\n            </li>\n               \n<li>\n                 <var class=\"replaceable-license-text\"> E.</var>\n                 &quot;Larger Work&quot; means computer software that combines Subject Software, or portions thereof,\n                 with software separate from the Subject Software that is not governed by the terms of this Agreement.\n\n            </li>\n               \n<li>\n                 <var class=\"replaceable-license-text\"> F.</var>\n\n                     &quot;Modification&quot; means any alteration of, including addition to or deletion from, the substance\n                     or structure of either the Original Software or Subject Software, and includes derivative works,\n                     as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including\n                     Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> G.</var>\n\n                    &quot;Original Software&quot; means the computer software first released under this Agreement\n                    by Government Agency with Government Agency designation <var class=\"replaceable-license-text\"> _______________</var> and entitled <var class=\"replaceable-license-text\"> _______________</var>, including\n                    source code, object code and accompanying documentation, if any.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> H.</var>\n\n                    &quot;Recipient&quot; means anyone who acquires the Subject Software under this Agreement, including all\n                    Contributors.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> I.</var>\n                &quot;Redistribution&quot; means Distribution of the Subject Software after a\n                    Modification has been made.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> J.</var>\n\n                      &quot;Reproduction&quot; means the making of a counterpart, image or copy of the Subject Software.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> K.</var>\n\n                     &quot;Sale&quot; means the exchange of the Subject Software for money or equivalent value.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> L.</var>\n                &quot;Subject Software&quot; means the Original Software, Modifications, or any respective parts thereof.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> M.</var>\n                &quot;Use&quot; means the application or employment of the Subject Software for any purpose.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>GRANT OF RIGHTS</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor,\n                    with respect to its own contribution to the Subject Software, hereby grants to each Recipient\n                    a non-exclusive, world-wide, royalty-free license to engage in the following activities\n                    pertaining to the Subject Software:\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Use\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            Distribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 3.</var>\n                            Reproduction\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 4.</var>\n                            Modification\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 5.</var>\n                            Redistribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 6.</var>\n                            Display\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor,\n                    with respect to its own contribution to the Subject Software, hereby grants to each Recipient\n                    under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the\n                    following activities pertaining to the Subject Software:\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Use\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            Distribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 3.</var>\n                            Reproduction\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 4.</var>\n                            Sale\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 5.</var>\n                            Offer for Sale\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    The rights granted under Paragraph B. also apply to the combination of a Contributor&apos;s\n                     Modification and the Subject Software if, at the time the Modification is added by the\n                     Contributor, the addition of such Modification causes the combination to be covered by the\n                     Covered Patents. It does not apply to any other combinations that include a Modification.\n                </li>\n                \n<li>\n                  <var class=\"replaceable-license-text\"> D.</var>\n                  The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights.\n                     Such sublicense must be under the same terms and conditions of this Agreement.\n\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>OBLIGATIONS OF RECIPIENT</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Distribution or Redistribution of the Subject Software must be made under this Agreement except\n                     for additions covered under paragraph 3H.\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Whenever a Recipient distributes or redistributes the Subject Software, a copy of this\n                             Agreement must be included with each copy of the Subject Software; and\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            If Recipient distributes or redistributes the Subject Software in any form other than source\n                               code, Recipient must also make the source code freely available, and must provide with\n                               each copy of the Subject Software information on how to obtain the source code in a\n                               reasonable manner on or through a medium customarily used for software exchange.\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Each Recipient must ensure that the following copyright notice appears prominently in the Subject\n                     Software:\n                    <p>[Government Agency will insert the applicable copyright notice in each agreement accompanying the\n                     initial distribution of original software and remove this bracketed language.]</p>\n\n                    <p>[The following copyright notice will be used if created by a contractor pursuant to Government\n                     Agency contract and rights obtained from creator by assignment. Government Agency will insert\n                     the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR}\n                     United States Government as represented by <var class=\"replaceable-license-text\"> _______________</var>. All Rights Reserved.</p>\n\n                    <p>[The following copyright notice will be used if created by civil servants only. Government Agency\n                     will insert the year and its Agency designation and remove the bracketed language.] Copyright\n                     (c) {YEAR} United States Government as represented by <var class=\"replaceable-license-text\"> _______________</var>. No copyright is claimed in\n                     the United States under Title 17, U.S.Code. All Other Rights Reserved.</p>\n\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    Each Contributor must characterize its alteration of the Subject Software as a Modification and\n                     must identify itself as the originator of its Modification in a manner that reasonably allows\n                     subsequent Recipients to identify the originator of the Modification. In fulfillment of these\n                     requirements, Contributor must include a file (e.g., a change log file) that describes the\n                     alterations made and the date of the alterations, identifies Contributor as originator of the\n                     alterations, and consents to characterization of the alterations as a Modification, for\n                     example, by including a statement that the Modification is derived, directly or indirectly,\n                     from Original Software provided by Government Agency. Once consent is granted, it may not\n                     thereafter be revoked.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> D.</var>\n                    A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice\n                     has been added to the Subject Software, a Recipient may not remove it without the express\n                     permission of the Contributor who added the notice.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> E.</var>\n                    A Recipient may not make any representation in the Subject Software or in any promotional,\n                     advertising or other material that may be construed as an endorsement by Government Agency or\n                     by any prior Recipient of any product or service provided by Recipient, or that may seek to\n                     obtain commercial advantage by the fact of Government Agency&apos;s or a prior\n                     Recipient&apos;s participation in this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> F.</var>\n                    In an effort to track usage and maintain accurate records of the Subject Software, each\n                     Recipient, upon receipt of the Subject Software, is requested to register with Government\n                     Agency by visiting the following website: <var class=\"replaceable-license-text\"> _______________</var>. Recipient&apos;s name and personal\n                     information shall be used for statistical purposes only. Once a Recipient makes a Modification\n                     available, it is requested that the Recipient inform Government Agency at the web site\n                     provided above how to access the Modification.\n                    <p>[Alternative paragraph for use when a web site for release and monitoring of subject software\n                     will not be supported by releasing Government Agency] In an effort to track usage and maintain\n                     accurate records of the Subject Software, each Recipient, upon receipt of the Subject\n                     Software, is requested to provide Government Agency, by e-mail to the Government Agency Point\n                     of Contact listed in clause 5.F., the following information: <var class=\"replaceable-license-text\"> _______________</var>. Recipient&apos;s name and\n                     personal information shall be used for statistical purposes only. Once a Recipient makes a\n                     Modification available, it is requested that the Recipient inform Government Agency, by e-mail\n                     to the Government Agency Point of Contact listed in clause 5.F., how to access the\n                     Modification.</p>\n\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> G.</var>\n                    Each Contributor represents that that its Modification is believed to be Contributor&apos;s\n                     original creation and does not violate any existing agreements, regulations, statutes or\n                     rules, and further that Contributor has sufficient rights to grant the rights conveyed by this\n                     Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> H.</var>\n                    A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or\n                     liability obligations to one or more other Recipients of the Subject Software. A Recipient may\n                     do so, however, only on its own behalf and not on behalf of Government Agency or any other\n                     Recipient. Such a Recipient must make it absolutely clear that any such warranty, support,\n                     indemnity and/or liability obligation is offered by that Recipient alone. Further, such\n                     Recipient agrees to indemnify Government Agency and every other Recipient for any liability\n                     incurred by them as a result of warranty, support, indemnity and/or liability offered by such\n                     Recipient.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> I.</var>\n                    A Recipient may create a Larger Work by combining Subject Software with separate software not\n                     governed by the terms of this agreement and distribute the Larger Work as a single product. In\n                     such case, the Recipient must make sure Subject Software, or portions thereof, included in the\n                     Larger Work is subject to this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> J.</var>\n                    Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of\n                     any goods or technical data from the United States may require some form of export license\n                     from the U.S. Government. Failure to obtain necessary export licenses may result in criminal\n                     liability under U.S. laws. Government Agency neither represents that a license shall not be\n                     required nor that, if required, it shall be issued. Nothing granted herein provides any such\n                     export license.\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    No Warranty: THE SUBJECT SOFTWARE IS PROVIDED &quot;AS IS&quot; WITHOUT ANY WARRANTY OF ANY KIND,\n                     EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE\n                     SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY,\n                     FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT\n                     SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO\n                     THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY\n                     GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE\n                     PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER,\n                     GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF\n                     PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT &quot;AS IS.&quot;\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES\n                     GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF\n                     RECIPIENT&apos;S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES,\n                     EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR\n                     RESULTING FROM, RECIPIENT&apos;S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND\n                     HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY\n                     PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT&apos;S SOLE REMEDY FOR ANY SUCH\n                     MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>GENERAL TERMS</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Termination: This Agreement and the rights granted hereunder will terminate automatically if a\n                     Recipient fails to comply with these terms and conditions, and fails to cure such\n                     noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon\n                     termination, a Recipient agrees to immediately cease use and distribution of the Subject\n                     Software. All sublicenses to the Subject Software properly granted by the breaching Recipient\n                     shall survive any such termination of this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Severability: If any provision of this Agreement is invalid or unenforceable under applicable\n                     law, it shall not affect the validity or enforceability of the remainder of the terms of this\n                     Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    Applicable Law: This Agreement shall be subject to United States federal law only for all\n                     purposes, including, but not limited to, determining the validity of this Agreement, the\n                     meaning of its provisions and the rights, obligations and remedies of the parties.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> D.</var>\n                    Entire Understanding: This Agreement constitutes the entire understanding and agreement of the\n                     parties relating to release of the Subject Software and may not be superseded, modified or\n                     amended except by further written agreement duly executed by the parties.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> E.</var>\n                    Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient\n                     affirms its authority to bind the Recipient to all terms and conditions of this Agreement and\n                     that that Recipient hereby agrees to all terms and conditions herein.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> F.</var>\n                    Point of Contact: Any Recipient contact with Government Agency is to be directed to the\n                     designated representative as follows: <var class=\"replaceable-license-text\"> _______________</var>.\n                </li>\n            \n</ul>\n        </li>\n      \n</ul>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"https://opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"},{"contents":[null,"http://ti.arc.nasa.gov/opensource/nosa/"],"tag":"LicenseUrl"},{"contents":[null,"http://ti.arc.nasa.gov/opensource/nosa/"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"N/A","order":1,"timestamp":"2024-04-17T05:01:28Z","url":"https://opensource.org/licenses/NASA-1.3"},{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:01:28Z","url":"http://ti.arc.nasa.gov/opensource/nosa/"}],"isDeprecatedLicenseId":false,"isFsfLibre":false,"isOsiApproved":true,"licenseComments":null,"licenseId":"spdx:NASA-1.3","licenseText":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency: _____ Government Agency Original Software Designation: __ Government Agency Original Software Title: _____ User Registration Requested. Please Visit http://___ Government Agency Point of Contact for Original Software: _____\n\nDEFINITIONS\n\nA. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification. B. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software. C. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device. D. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another. E. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement. F. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification. G. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation __ and entitled _________, including source code, object code and accompanying documentation, if any. H. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors. I. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made. J. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software. K. \"Sale\" means the exchange of the Subject Software for money or equivalent value. L. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof. M. \"Use\" means the application or employment of the Subject Software for any purpose.\n\nGRANT OF RIGHTS\n\nA. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n     1. Use\n     2. Distribution\n     3. Reproduction\n     4. Modification\n     5. Redistribution\n     6. Display\n\nB. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n     1. Use\n     2. Distribution\n     3. Reproduction\n     4. Sale\n     5. Offer for Sale\n\nC. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\nD. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\nOBLIGATIONS OF RECIPIENT\n\nA. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n     1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n     2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\nB. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n[Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n[The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by ___ ____. All Rights Reserved.\n\n[The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by ____ ____. No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\nC. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\nD. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\nE. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\nF. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website: ______. Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n[Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information: ______. Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\nG. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\nH. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\nI. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\nJ. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\nDISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\nA. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\nB. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\nGENERAL TERMS\n\nA. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\nB. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\nC. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\nD. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties.\n\nE. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\nF. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows: ___________.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>NASA OPEN SOURCE AGREEMENT VERSION 1.3</p>\n\n      </div>\n      <p>THIS OPEN SOURCE AGREEMENT (&quot;AGREEMENT&quot;) DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION,\n         MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES\n         GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (&quot;GOVERNMENT AGENCY&quot;). THE\n         UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY\n         OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES,\n         REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY\n         PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN\n         THIS AGREEMENT.</p>\n\n      <p>Government Agency: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>Government Agency Original Software Designation: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>Government Agency Original Software Title: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n      <p>User Registration Requested. Please Visit <var class=\"replaceable-license-text\"> http://_______________</var></p>\n\n      <p>Government Agency Point of Contact for Original Software: <var class=\"replaceable-license-text\"> _______________</var></p>\n\n<ul style=\"list-style:none\">\n\n<li>\n            <p>DEFINITIONS</p>\n\n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> A.</var>\n              &quot;Contributor&quot; means Government Agency, as the developer of the Original Software, and\n                 any entity that makes a Modification.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> B.</var>\n                &quot;Covered Patents&quot; mean patent claims licensable by a Contributor that are necessarily\n                 infringed by the use or sale of its Modification alone or when combined with the Subject Software.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> C.</var>\n                 &quot;Display&quot; means the showing of a copy of the Subject Software, either directly or by means of an\n                 image, or any other device.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> D.</var>\n                &quot;Distribution&quot; means conveyance or transfer of the Subject Software, regardless of means,\n                 to another.\n            </li>\n               \n<li>\n                 <var class=\"replaceable-license-text\"> E.</var>\n                 &quot;Larger Work&quot; means computer software that combines Subject Software, or portions thereof,\n                 with software separate from the Subject Software that is not governed by the terms of this Agreement.\n\n            </li>\n               \n<li>\n                 <var class=\"replaceable-license-text\"> F.</var>\n\n                     &quot;Modification&quot; means any alteration of, including addition to or deletion from, the substance\n                     or structure of either the Original Software or Subject Software, and includes derivative works,\n                     as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including\n                     Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> G.</var>\n\n                    &quot;Original Software&quot; means the computer software first released under this Agreement\n                    by Government Agency with Government Agency designation <var class=\"replaceable-license-text\"> _______________</var> and entitled <var class=\"replaceable-license-text\"> _______________</var>, including\n                    source code, object code and accompanying documentation, if any.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> H.</var>\n\n                    &quot;Recipient&quot; means anyone who acquires the Subject Software under this Agreement, including all\n                    Contributors.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> I.</var>\n                &quot;Redistribution&quot; means Distribution of the Subject Software after a\n                    Modification has been made.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> J.</var>\n\n                      &quot;Reproduction&quot; means the making of a counterpart, image or copy of the Subject Software.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> K.</var>\n\n                     &quot;Sale&quot; means the exchange of the Subject Software for money or equivalent value.\n\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> L.</var>\n                &quot;Subject Software&quot; means the Original Software, Modifications, or any respective parts thereof.\n            </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> M.</var>\n                &quot;Use&quot; means the application or employment of the Subject Software for any purpose.\n            </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>GRANT OF RIGHTS</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor,\n                    with respect to its own contribution to the Subject Software, hereby grants to each Recipient\n                    a non-exclusive, world-wide, royalty-free license to engage in the following activities\n                    pertaining to the Subject Software:\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Use\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            Distribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 3.</var>\n                            Reproduction\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 4.</var>\n                            Modification\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 5.</var>\n                            Redistribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 6.</var>\n                            Display\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor,\n                    with respect to its own contribution to the Subject Software, hereby grants to each Recipient\n                    under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the\n                    following activities pertaining to the Subject Software:\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Use\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            Distribution\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 3.</var>\n                            Reproduction\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 4.</var>\n                            Sale\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 5.</var>\n                            Offer for Sale\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    The rights granted under Paragraph B. also apply to the combination of a Contributor&apos;s\n                     Modification and the Subject Software if, at the time the Modification is added by the\n                     Contributor, the addition of such Modification causes the combination to be covered by the\n                     Covered Patents. It does not apply to any other combinations that include a Modification.\n                </li>\n                \n<li>\n                  <var class=\"replaceable-license-text\"> D.</var>\n                  The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights.\n                     Such sublicense must be under the same terms and conditions of this Agreement.\n\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>OBLIGATIONS OF RECIPIENT</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Distribution or Redistribution of the Subject Software must be made under this Agreement except\n                     for additions covered under paragraph 3H.\n                    \n<ul style=\"list-style:none\">\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 1.</var>\n                            Whenever a Recipient distributes or redistributes the Subject Software, a copy of this\n                             Agreement must be included with each copy of the Subject Software; and\n                        </li>\n                        \n<li>\n                            <var class=\"replaceable-license-text\"> 2.</var>\n                            If Recipient distributes or redistributes the Subject Software in any form other than source\n                               code, Recipient must also make the source code freely available, and must provide with\n                               each copy of the Subject Software information on how to obtain the source code in a\n                               reasonable manner on or through a medium customarily used for software exchange.\n                        </li>\n                    \n</ul>\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Each Recipient must ensure that the following copyright notice appears prominently in the Subject\n                     Software:\n                    <p>[Government Agency will insert the applicable copyright notice in each agreement accompanying the\n                     initial distribution of original software and remove this bracketed language.]</p>\n\n                    <p>[The following copyright notice will be used if created by a contractor pursuant to Government\n                     Agency contract and rights obtained from creator by assignment. Government Agency will insert\n                     the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR}\n                     United States Government as represented by <var class=\"replaceable-license-text\"> _______________</var>. All Rights Reserved.</p>\n\n                    <p>[The following copyright notice will be used if created by civil servants only. Government Agency\n                     will insert the year and its Agency designation and remove the bracketed language.] Copyright\n                     (c) {YEAR} United States Government as represented by <var class=\"replaceable-license-text\"> _______________</var>. No copyright is claimed in\n                     the United States under Title 17, U.S.Code. All Other Rights Reserved.</p>\n\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    Each Contributor must characterize its alteration of the Subject Software as a Modification and\n                     must identify itself as the originator of its Modification in a manner that reasonably allows\n                     subsequent Recipients to identify the originator of the Modification. In fulfillment of these\n                     requirements, Contributor must include a file (e.g., a change log file) that describes the\n                     alterations made and the date of the alterations, identifies Contributor as originator of the\n                     alterations, and consents to characterization of the alterations as a Modification, for\n                     example, by including a statement that the Modification is derived, directly or indirectly,\n                     from Original Software provided by Government Agency. Once consent is granted, it may not\n                     thereafter be revoked.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> D.</var>\n                    A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice\n                     has been added to the Subject Software, a Recipient may not remove it without the express\n                     permission of the Contributor who added the notice.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> E.</var>\n                    A Recipient may not make any representation in the Subject Software or in any promotional,\n                     advertising or other material that may be construed as an endorsement by Government Agency or\n                     by any prior Recipient of any product or service provided by Recipient, or that may seek to\n                     obtain commercial advantage by the fact of Government Agency&apos;s or a prior\n                     Recipient&apos;s participation in this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> F.</var>\n                    In an effort to track usage and maintain accurate records of the Subject Software, each\n                     Recipient, upon receipt of the Subject Software, is requested to register with Government\n                     Agency by visiting the following website: <var class=\"replaceable-license-text\"> _______________</var>. Recipient&apos;s name and personal\n                     information shall be used for statistical purposes only. Once a Recipient makes a Modification\n                     available, it is requested that the Recipient inform Government Agency at the web site\n                     provided above how to access the Modification.\n                    <p>[Alternative paragraph for use when a web site for release and monitoring of subject software\n                     will not be supported by releasing Government Agency] In an effort to track usage and maintain\n                     accurate records of the Subject Software, each Recipient, upon receipt of the Subject\n                     Software, is requested to provide Government Agency, by e-mail to the Government Agency Point\n                     of Contact listed in clause 5.F., the following information: <var class=\"replaceable-license-text\"> _______________</var>. Recipient&apos;s name and\n                     personal information shall be used for statistical purposes only. Once a Recipient makes a\n                     Modification available, it is requested that the Recipient inform Government Agency, by e-mail\n                     to the Government Agency Point of Contact listed in clause 5.F., how to access the\n                     Modification.</p>\n\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> G.</var>\n                    Each Contributor represents that that its Modification is believed to be Contributor&apos;s\n                     original creation and does not violate any existing agreements, regulations, statutes or\n                     rules, and further that Contributor has sufficient rights to grant the rights conveyed by this\n                     Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> H.</var>\n                    A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or\n                     liability obligations to one or more other Recipients of the Subject Software. A Recipient may\n                     do so, however, only on its own behalf and not on behalf of Government Agency or any other\n                     Recipient. Such a Recipient must make it absolutely clear that any such warranty, support,\n                     indemnity and/or liability obligation is offered by that Recipient alone. Further, such\n                     Recipient agrees to indemnify Government Agency and every other Recipient for any liability\n                     incurred by them as a result of warranty, support, indemnity and/or liability offered by such\n                     Recipient.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> I.</var>\n                    A Recipient may create a Larger Work by combining Subject Software with separate software not\n                     governed by the terms of this agreement and distribute the Larger Work as a single product. In\n                     such case, the Recipient must make sure Subject Software, or portions thereof, included in the\n                     Larger Work is subject to this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> J.</var>\n                    Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of\n                     any goods or technical data from the United States may require some form of export license\n                     from the U.S. Government. Failure to obtain necessary export licenses may result in criminal\n                     liability under U.S. laws. Government Agency neither represents that a license shall not be\n                     required nor that, if required, it shall be issued. Nothing granted herein provides any such\n                     export license.\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    No Warranty: THE SUBJECT SOFTWARE IS PROVIDED &quot;AS IS&quot; WITHOUT ANY WARRANTY OF ANY KIND,\n                     EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE\n                     SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY,\n                     FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT\n                     SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO\n                     THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY\n                     GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE\n                     PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER,\n                     GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF\n                     PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT &quot;AS IS.&quot;\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES\n                     GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF\n                     RECIPIENT&apos;S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES,\n                     EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR\n                     RESULTING FROM, RECIPIENT&apos;S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND\n                     HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY\n                     PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT&apos;S SOLE REMEDY FOR ANY SUCH\n                     MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n                </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <p>GENERAL TERMS</p>\n\n<ul style=\"list-style:none\">\n                \n<li>\n                    <var class=\"replaceable-license-text\"> A.</var>\n                    Termination: This Agreement and the rights granted hereunder will terminate automatically if a\n                     Recipient fails to comply with these terms and conditions, and fails to cure such\n                     noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon\n                     termination, a Recipient agrees to immediately cease use and distribution of the Subject\n                     Software. All sublicenses to the Subject Software properly granted by the breaching Recipient\n                     shall survive any such termination of this Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> B.</var>\n                    Severability: If any provision of this Agreement is invalid or unenforceable under applicable\n                     law, it shall not affect the validity or enforceability of the remainder of the terms of this\n                     Agreement.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> C.</var>\n                    Applicable Law: This Agreement shall be subject to United States federal law only for all\n                     purposes, including, but not limited to, determining the validity of this Agreement, the\n                     meaning of its provisions and the rights, obligations and remedies of the parties.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> D.</var>\n                    Entire Understanding: This Agreement constitutes the entire understanding and agreement of the\n                     parties relating to release of the Subject Software and may not be superseded, modified or\n                     amended except by further written agreement duly executed by the parties.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> E.</var>\n                    Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient\n                     affirms its authority to bind the Recipient to all terms and conditions of this Agreement and\n                     that that Recipient hereby agrees to all terms and conditions herein.\n                </li>\n                \n<li>\n                    <var class=\"replaceable-license-text\"> F.</var>\n                    Point of Contact: Any Recipient contact with Government Agency is to be directed to the\n                     designated representative as follows: <var class=\"replaceable-license-text\"> _______________</var>.\n                </li>\n            \n</ul>\n        </li>\n      \n</ul>\n    ","name":"NASA Open Source Agreement 1.3","seeAlso":["http://ti.arc.nasa.gov/opensource/nosa/","https://opensource.org/licenses/NASA-1.3"],"standardLicenseTemplate":"<<beginOptional>>NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\n<<endOptional>>\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency: <<var;name=\"governmentAgency\";original=\"_______________\";match=\".+\">>\n\nGovernment Agency Original Software Designation: <<var;name=\"governmentAgencyOriginalSoftwareDesignation\";original=\"_______________\";match=\".+\">>\n\nGovernment Agency Original Software Title: <<var;name=\"governmentAgencyOriginalSoftwareTitle\";original=\"_______________\";match=\".+\">>\n\nUser Registration Requested. Please Visit <<var;name=\"userRegistrationWebsite1\";original=\"http://_______________\";match=\".+\">>\n\nGovernment Agency Point of Contact for Original Software: <<var;name=\"governmentAgencyPointOfContact1\";original=\"_______________\";match=\".+\">>\n\n   DEFINITIONS\n\n      <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification.\n\n      <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software.\n\n      <<var;name=\"bullet\";original=\"C.\";match=\".{0,20}\">> \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device.\n\n      <<var;name=\"bullet\";original=\"D.\";match=\".{0,20}\">> \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another.\n\n      <<var;name=\"bullet\";original=\"E.\";match=\".{0,20}\">> \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement.\n\n      <<var;name=\"bullet\";original=\"F.\";match=\".{0,20}\">> \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\n\n      <<var;name=\"bullet\";original=\"G.\";match=\".{0,20}\">> \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation <<var;name=\"governmentAgencyDesignation\";original=\"_______________\";match=\".+\">> and entitled <<var;name=\"governmentAgencyTitle\";original=\"_______________\";match=\".+\">> , including source code, object code and accompanying documentation, if any.\n\n      <<var;name=\"bullet\";original=\"H.\";match=\".{0,20}\">> \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors.\n\n      <<var;name=\"bullet\";original=\"I.\";match=\".{0,20}\">> \"Redistribution\" means Distribution of the Subject Software after a Modification has been made.\n\n      <<var;name=\"bullet\";original=\"J.\";match=\".{0,20}\">> \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software.\n\n      <<var;name=\"bullet\";original=\"K.\";match=\".{0,20}\">> \"Sale\" means the exchange of the Subject Software for money or equivalent value.\n\n      <<var;name=\"bullet\";original=\"L.\";match=\".{0,20}\">> \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof.\n\n      <<var;name=\"bullet\";original=\"M.\";match=\".{0,20}\">> \"Use\" means the application or employment of the Subject Software for any purpose.\n\n   GRANT OF RIGHTS\n\n      <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Use\n\n         <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Distribution\n\n         <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Reproduction\n\n         <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Modification\n\n         <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> Redistribution\n\n         <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> Display\n\n      <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Use\n\n         <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Distribution\n\n         <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Reproduction\n\n         <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Sale\n\n         <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> Offer for Sale\n\n      <<var;name=\"bullet\";original=\"C.\";match=\".{0,20}\">> The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\n      <<var;name=\"bullet\";original=\"D.\";match=\".{0,20}\">> The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\n   OBLIGATIONS OF RECIPIENT\n\n      <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n         <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n\n         <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\n      <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n      [Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n      [The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by <<var;name=\"governmentRepresentedBy1\";original=\"_______________\";match=\".+\">> . All Rights Reserved.\n\n      [The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by <<var;name=\"governmentRepresentedBy2\";original=\"_______________\";match=\".+\">> . No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\n      <<var;name=\"bullet\";original=\"C.\";match=\".{0,20}\">> Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\n      <<var;name=\"bullet\";original=\"D.\";match=\".{0,20}\">> A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\n      <<var;name=\"bullet\";original=\"E.\";match=\".{0,20}\">> A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\n      <<var;name=\"bullet\";original=\"F.\";match=\".{0,20}\">> In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website: <<var;name=\"userRegistrationWebsite2\";original=\"_______________\";match=\".+\">> . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n      [Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information: <<var;name=\"governmentAgencyPointOfContact2\";original=\"_______________\";match=\".+\">> . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\n      <<var;name=\"bullet\";original=\"G.\";match=\".{0,20}\">> Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\n      <<var;name=\"bullet\";original=\"H.\";match=\".{0,20}\">> A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\n      <<var;name=\"bullet\";original=\"I.\";match=\".{0,20}\">> A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\n      <<var;name=\"bullet\";original=\"J.\";match=\".{0,20}\">> Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\n   DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\n      <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\n      <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\n   GENERAL TERMS\n\n      <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\n      <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\n      <<var;name=\"bullet\";original=\"C.\";match=\".{0,20}\">> Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\n      <<var;name=\"bullet\";original=\"D.\";match=\".{0,20}\">> Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties.\n\n      <<var;name=\"bullet\";original=\"E.\";match=\".{0,20}\">> Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\n      <<var;name=\"bullet\";original=\"F.\";match=\".{0,20}\">> Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows: <<var;name=\"governmentAgencyPointOfContact3\";original=\"_______________\";match=\".+\">> ."},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"osi:NASA-1.3","tag":"LN"},[{"contents":"NASA Open Source Agreement, Version 1.3","tag":"LN"},{"contents":"SPDX:NASA-1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["OSILicense","4aa8f240270837f8e6f096285a6711c2"],"impliedStmts":[{"contents":["OSI Page","https://opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI-keyword","special-purpose",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"}],"raw":{"id":"NASA-1.3","identifiers":[{"identifier":"NASA-1.3","scheme":"SPDX"}],"keywords":["osi-approved","special-purpose"],"links":[{"note":"OSI Page","url":"https://opensource.org/licenses/NASA-1.3"}],"name":"NASA Open Source Agreement, Version 1.3","other_names":[],"superseded_by":null,"text":[{"media_type":"text/html","title":"HTML","url":"https://opensource.org/licenses/NASA-1.3"}]},"type":"OSILicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:NASA-1.3","tag":"LN"},[{"contents":"spdx:NASA-1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"NASA Open Source Agreement v1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","49b4e03428d426fc1ffaa7efa47803b9"],"impliedStmts":[{"contents":[{"contents":"[\"not-allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","not-allowed",{"contents":"Any license that does not meet the criteria above for allowed licenses (including allowed for a specific category) is not-allowed.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/NASA_Open_Source_Agreement"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":[],"_legacy_names":["NASA Open Source Agreement v1.3"],"_notes":null},"_id":"NASA-1.3","_license":{"_expression":"spdx:NASA-1.3","_scancode_key":null,"_status":["not-allowed"],"_text":null,"_urls":["https://fedoraproject.org/wiki/Licensing/NASA_Open_Source_Agreement"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"BlueOak:NASA-1.3","tag":"LN"},[{"contents":"NASA Open Source Agreement 1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","f03a274e3e4e537f794437c28a4ce74d"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Lead",{"contents":"These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/NASA-1.3.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Lead","These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.",{"_id":"NASA-1.3","_name":"NASA Open Source Agreement 1.3","_url":"https://spdx.org/licenses/NASA-1.3.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"scancode:nasa-1.3","tag":"LN"},[{"contents":"NASA 1.3","tag":"LN"},{"contents":"NASA Open Source License v1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","307ae7b911a11617f6d11f139f179594"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://opensource.arc.nasa.gov/static/html/NASA_Open_Source_Agreement_1.3.txt","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license is OSI certified."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[null,"http://opensource.arc.nasa.gov/static/html/NASA_Open_Source_Agreement_1.3.txt"],"tag":"LicenseUrl"},{"contents":[null,"http://ti.arc.nasa.gov/opensource/nosa/"],"tag":"LicenseUrl"},{"contents":[null,"http://www.gnu.org/licenses/license-list.html#NASA"],"tag":"LicenseUrl"},{"contents":[null,"http://www.opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"},{"contents":[null,"https://opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"},{"contents":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency:  \nGovernment Agency Original Software Designation:  \nGovernment Agency Original Software Title:  \nUser Registration Requested. Please Visit http:// \nGovernment Agency Point of Contact for Original Software:    \n\n1. DEFINITIONS\n\nA. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification.\nB. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software.\nC. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device.\nD. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another.\nE. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement.\nF. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\nG. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation   and entitled  , including source code, object code and accompanying documentation, if any.\nH. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors.\nI. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made.\nJ. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software.\nK. \"Sale\" means the exchange of the Subject Software for money or equivalent value.\nL. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof.\nM. \"Use\" means the application or employment of the Subject Software for any purpose.\n\n2. GRANT OF RIGHTS\n\nA. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n1. Use\n2. Distribution\n3. Reproduction\n4. Modification\n5. Redistribution\n6. Display\n\nB. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software: \n\n1. Use\n2. Distribution\n3. Reproduction\n4. Sale\n5. Offer for Sale\n\nC. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\nD. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\n3. OBLIGATIONS OF RECIPIENT\n\nA. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\nB. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n[Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n[The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright \" {YEAR} United States Government as represented by    . All Rights Reserved.\n\n[The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright \" {YEAR} United States Government as represented by    . No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\n\nC. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\nD. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\nE. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\nF. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website:  . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n[Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information:  . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\nG. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\nH. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\nI. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\n\nJ. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\n4. DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\nA. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\nB. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\n5. GENERAL TERMS\n\nA. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\nB. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\nC. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\nD. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties. \n\n\nE. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\nF. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows:  .","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://opensource.arc.nasa.gov/static/html/NASA_Open_Source_Agreement_1.3.txt","_key":"nasa-1.3","_name":"NASA Open Source License v1.3","_notes":"Per SPDX.org, this license is OSI certified.","_osiUrl":null,"_otherUrls":["http://ti.arc.nasa.gov/opensource/nosa/","http://www.gnu.org/licenses/license-list.html#NASA","http://www.opensource.org/licenses/NASA-1.3","https://opensource.org/licenses/NASA-1.3"],"_owner":"OSI - Open Source Initiative","_shortName":"NASA 1.3","_spdxId":"NASA-1.3","_text":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency:  \nGovernment Agency Original Software Designation:  \nGovernment Agency Original Software Title:  \nUser Registration Requested. Please Visit http:// \nGovernment Agency Point of Contact for Original Software:    \n\n1. DEFINITIONS\n\nA. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification.\nB. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software.\nC. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device.\nD. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another.\nE. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement.\nF. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\nG. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation   and entitled  , including source code, object code and accompanying documentation, if any.\nH. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors.\nI. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made.\nJ. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software.\nK. \"Sale\" means the exchange of the Subject Software for money or equivalent value.\nL. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof.\nM. \"Use\" means the application or employment of the Subject Software for any purpose.\n\n2. GRANT OF RIGHTS\n\nA. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n1. Use\n2. Distribution\n3. Reproduction\n4. Modification\n5. Redistribution\n6. Display\n\nB. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software: \n\n1. Use\n2. Distribution\n3. Reproduction\n4. Sale\n5. Offer for Sale\n\nC. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\nD. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\n3. OBLIGATIONS OF RECIPIENT\n\nA. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\nB. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n[Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n[The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright \" {YEAR} United States Government as represented by    . All Rights Reserved.\n\n[The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright \" {YEAR} United States Government as represented by    . No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\n\nC. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\nD. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\nE. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\nF. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website:  . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n[Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information:  . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\nG. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\nH. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\nI. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\n\nJ. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\n4. DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\nA. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\nB. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\n5. GENERAL TERMS\n\nA. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\nB. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\nC. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\nD. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties. \n\n\nE. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\nF. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows:  .","_textUrls":["http://opensource.arc.nasa.gov/static/html/NASA_Open_Source_Agreement_1.3.txt"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:NASA-1.3","tag":"LN"},[{"contents":"NASA Open Source Agreement 1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","f5067f32cbb3d72b571c830479cb9af8"],"impliedStmts":[{"contents":{"contents":[null,"http://ti.arc.nasa.gov/opensource/nosa/"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency: _______________\n\nGovernment Agency Original Software Designation: _______________\n\nGovernment Agency Original Software Title: _______________\n\nUser Registration Requested. Please Visit http://_______________\n\nGovernment Agency Point of Contact for Original Software: _______________\n\n   \n\n   DEFINITIONS\n\n      A. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification.\n\n      B. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software.\n\n      C. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device.\n\n      D. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another.\n\n      E. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement.\n\n      F. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\n\n      G. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation _______________ and entitled _______________ , including source code, object code and accompanying documentation, if any.\n\n      H. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors.\n\n      I. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made.\n\n      J. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software.\n\n      K. \"Sale\" means the exchange of the Subject Software for money or equivalent value.\n\n      L. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof.\n\n      M. \"Use\" means the application or employment of the Subject Software for any purpose.\n\n   \n\n   GRANT OF RIGHTS\n\n      A. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         1. Use\n\n         2. Distribution\n\n         3. Reproduction\n\n         4. Modification\n\n         5. Redistribution\n\n         6. Display\n\n      B. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         1. Use\n\n         2. Distribution\n\n         3. Reproduction\n\n         4. Sale\n\n         5. Offer for Sale\n\n      C. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\n      D. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\n   \n\n   OBLIGATIONS OF RECIPIENT\n\n      A. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n         1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n\n         2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\n      B. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n      [Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n      [The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by _______________ . All Rights Reserved.\n\n      [The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by _______________ . No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\n      C. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\n      D. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\n      E. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\n      F. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website: _______________ . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n      [Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information: _______________ . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\n      G. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\n      H. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\n      I. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\n      J. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\n   \n\n   DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\n      A. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\n      B. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\n   \n\n   GENERAL TERMS\n\n      A. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\n      B. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\n      C. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\n      D. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties.\n\n      E. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\n      F. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows: _______________ .","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"NASA Open Source Agreement 1.3","_rf_notes":"","_rf_risk":null,"_rf_shortname":"fossology:NASA-1.3","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"NASA OPEN SOURCE AGREEMENT VERSION 1.3\n\nTHIS OPEN SOURCE AGREEMENT (\"AGREEMENT\") DEFINES THE RIGHTS OF USE, REPRODUCTION, DISTRIBUTION, MODIFICATION AND REDISTRIBUTION OF CERTAIN COMPUTER SOFTWARE ORIGINALLY RELEASED BY THE UNITED STATES GOVERNMENT AS REPRESENTED BY THE GOVERNMENT AGENCY LISTED BELOW (\"GOVERNMENT AGENCY\"). THE UNITED STATES GOVERNMENT, AS REPRESENTED BY GOVERNMENT AGENCY, IS AN INTENDED THIRD-PARTY BENEFICIARY OF ALL SUBSEQUENT DISTRIBUTIONS OR REDISTRIBUTIONS OF THE SUBJECT SOFTWARE. ANYONE WHO USES, REPRODUCES, DISTRIBUTES, MODIFIES OR REDISTRIBUTES THE SUBJECT SOFTWARE, AS DEFINED HEREIN, OR ANY PART THEREOF, IS, BY THAT ACTION, ACCEPTING IN FULL THE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS AGREEMENT.\n\nGovernment Agency: _______________\n\nGovernment Agency Original Software Designation: _______________\n\nGovernment Agency Original Software Title: _______________\n\nUser Registration Requested. Please Visit http://_______________\n\nGovernment Agency Point of Contact for Original Software: _______________\n\n   \n\n   DEFINITIONS\n\n      A. \"Contributor\" means Government Agency, as the developer of the Original Software, and any entity that makes a Modification.\n\n      B. \"Covered Patents\" mean patent claims licensable by a Contributor that are necessarily infringed by the use or sale of its Modification alone or when combined with the Subject Software.\n\n      C. \"Display\" means the showing of a copy of the Subject Software, either directly or by means of an image, or any other device.\n\n      D. \"Distribution\" means conveyance or transfer of the Subject Software, regardless of means, to another.\n\n      E. \"Larger Work\" means computer software that combines Subject Software, or portions thereof, with software separate from the Subject Software that is not governed by the terms of this Agreement.\n\n      F. \"Modification\" means any alteration of, including addition to or deletion from, the substance or structure of either the Original Software or Subject Software, and includes derivative works, as that term is defined in the Copyright Statute, 17 USC 101. However, the act of including Subject Software as part of a Larger Work does not in and of itself constitute a Modification.\n\n      G. \"Original Software\" means the computer software first released under this Agreement by Government Agency with Government Agency designation _______________ and entitled _______________ , including source code, object code and accompanying documentation, if any.\n\n      H. \"Recipient\" means anyone who acquires the Subject Software under this Agreement, including all Contributors.\n\n      I. \"Redistribution\" means Distribution of the Subject Software after a Modification has been made.\n\n      J. \"Reproduction\" means the making of a counterpart, image or copy of the Subject Software.\n\n      K. \"Sale\" means the exchange of the Subject Software for money or equivalent value.\n\n      L. \"Subject Software\" means the Original Software, Modifications, or any respective parts thereof.\n\n      M. \"Use\" means the application or employment of the Subject Software for any purpose.\n\n   \n\n   GRANT OF RIGHTS\n\n      A. Under Non-Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         1. Use\n\n         2. Distribution\n\n         3. Reproduction\n\n         4. Modification\n\n         5. Redistribution\n\n         6. Display\n\n      B. Under Patent Rights: Subject to the terms and conditions of this Agreement, each Contributor, with respect to its own contribution to the Subject Software, hereby grants to each Recipient under Covered Patents a non-exclusive, world-wide, royalty-free license to engage in the following activities pertaining to the Subject Software:\n\n         1. Use\n\n         2. Distribution\n\n         3. Reproduction\n\n         4. Sale\n\n         5. Offer for Sale\n\n      C. The rights granted under Paragraph B. also apply to the combination of a Contributor's Modification and the Subject Software if, at the time the Modification is added by the Contributor, the addition of such Modification causes the combination to be covered by the Covered Patents. It does not apply to any other combinations that include a Modification.\n\n      D. The rights granted in Paragraphs A. and B. allow the Recipient to sublicense those same rights. Such sublicense must be under the same terms and conditions of this Agreement.\n\n   \n\n   OBLIGATIONS OF RECIPIENT\n\n      A. Distribution or Redistribution of the Subject Software must be made under this Agreement except for additions covered under paragraph 3H.\n\n         1. Whenever a Recipient distributes or redistributes the Subject Software, a copy of this Agreement must be included with each copy of the Subject Software; and\n\n         2. If Recipient distributes or redistributes the Subject Software in any form other than source code, Recipient must also make the source code freely available, and must provide with each copy of the Subject Software information on how to obtain the source code in a reasonable manner on or through a medium customarily used for software exchange.\n\n      B. Each Recipient must ensure that the following copyright notice appears prominently in the Subject Software:\n\n      [Government Agency will insert the applicable copyright notice in each agreement accompanying the initial distribution of original software and remove this bracketed language.]\n\n      [The following copyright notice will be used if created by a contractor pursuant to Government Agency contract and rights obtained from creator by assignment. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by _______________ . All Rights Reserved.\n\n      [The following copyright notice will be used if created by civil servants only. Government Agency will insert the year and its Agency designation and remove the bracketed language.] Copyright (c) {YEAR} United States Government as represented by _______________ . No copyright is claimed in the United States under Title 17, U.S.Code. All Other Rights Reserved.\n\n      C. Each Contributor must characterize its alteration of the Subject Software as a Modification and must identify itself as the originator of its Modification in a manner that reasonably allows subsequent Recipients to identify the originator of the Modification. In fulfillment of these requirements, Contributor must include a file (e.g., a change log file) that describes the alterations made and the date of the alterations, identifies Contributor as originator of the alterations, and consents to characterization of the alterations as a Modification, for example, by including a statement that the Modification is derived, directly or indirectly, from Original Software provided by Government Agency. Once consent is granted, it may not thereafter be revoked.\n\n      D. A Contributor may add its own copyright notice to the Subject Software. Once a copyright notice has been added to the Subject Software, a Recipient may not remove it without the express permission of the Contributor who added the notice.\n\n      E. A Recipient may not make any representation in the Subject Software or in any promotional, advertising or other material that may be construed as an endorsement by Government Agency or by any prior Recipient of any product or service provided by Recipient, or that may seek to obtain commercial advantage by the fact of Government Agency's or a prior Recipient's participation in this Agreement.\n\n      F. In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to register with Government Agency by visiting the following website: _______________ . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency at the web site provided above how to access the Modification.\n\n      [Alternative paragraph for use when a web site for release and monitoring of subject software will not be supported by releasing Government Agency] In an effort to track usage and maintain accurate records of the Subject Software, each Recipient, upon receipt of the Subject Software, is requested to provide Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., the following information: _______________ . Recipient's name and personal information shall be used for statistical purposes only. Once a Recipient makes a Modification available, it is requested that the Recipient inform Government Agency, by e-mail to the Government Agency Point of Contact listed in clause 5.F., how to access the Modification.\n\n      G. Each Contributor represents that that its Modification is believed to be Contributor's original creation and does not violate any existing agreements, regulations, statutes or rules, and further that Contributor has sufficient rights to grant the rights conveyed by this Agreement.\n\n      H. A Recipient may choose to offer, and to charge a fee for, warranty, support, indemnity and/or liability obligations to one or more other Recipients of the Subject Software. A Recipient may do so, however, only on its own behalf and not on behalf of Government Agency or any other Recipient. Such a Recipient must make it absolutely clear that any such warranty, support, indemnity and/or liability obligation is offered by that Recipient alone. Further, such Recipient agrees to indemnify Government Agency and every other Recipient for any liability incurred by them as a result of warranty, support, indemnity and/or liability offered by such Recipient.\n\n      I. A Recipient may create a Larger Work by combining Subject Software with separate software not governed by the terms of this agreement and distribute the Larger Work as a single product. In such case, the Recipient must make sure Subject Software, or portions thereof, included in the Larger Work is subject to this Agreement.\n\n      J. Notwithstanding any provisions contained herein, Recipient is hereby put on notice that export of any goods or technical data from the United States may require some form of export license from the U.S. Government. Failure to obtain necessary export licenses may result in criminal liability under U.S. laws. Government Agency neither represents that a license shall not be required nor that, if required, it shall be issued. Nothing granted herein provides any such export license.\n\n   \n\n   DISCLAIMER OF WARRANTIES AND LIABILITIES; WAIVER AND INDEMNIFICATION\n\n      A. No Warranty: THE SUBJECT SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS, RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS RESULTING FROM USE OF THE SUBJECT SOFTWARE. FURTHER, GOVERNMENT AGENCY DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE, IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT \"AS IS.\"\n\n      B. Waiver and Indemnity: RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT. IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM, RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW. RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE, UNILATERAL TERMINATION OF THIS AGREEMENT.\n\n   \n\n   GENERAL TERMS\n\n      A. Termination: This Agreement and the rights granted hereunder will terminate automatically if a Recipient fails to comply with these terms and conditions, and fails to cure such noncompliance within thirty (30) days of becoming aware of such noncompliance. Upon termination, a Recipient agrees to immediately cease use and distribution of the Subject Software. All sublicenses to the Subject Software properly granted by the breaching Recipient shall survive any such termination of this Agreement.\n\n      B. Severability: If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement.\n\n      C. Applicable Law: This Agreement shall be subject to United States federal law only for all purposes, including, but not limited to, determining the validity of this Agreement, the meaning of its provisions and the rights, obligations and remedies of the parties.\n\n      D. Entire Understanding: This Agreement constitutes the entire understanding and agreement of the parties relating to release of the Subject Software and may not be superseded, modified or amended except by further written agreement duly executed by the parties.\n\n      E. Binding Authority: By accepting and using the Subject Software under this Agreement, a Recipient affirms its authority to bind the Recipient to all terms and conditions of this Agreement and that that Recipient hereby agrees to all terms and conditions herein.\n\n      F. Point of Contact: Any Recipient contact with Government Agency is to be directed to the designated representative as follows: _______________ .","_rf_text_updatable":false,"_rf_url":"http://ti.arc.nasa.gov/opensource/nosa/"},"type":"Fossology"},{"applicableLNs":{"contents":[{"contents":[{"contents":"NASA-1.3","tag":"LN"},[{"contents":"NASA Open Source Agreement 1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"nasa1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["OKFN","d4912b9d7c1390cf7b3c6b9e830163ae"],"impliedStmts":[{"contents":[null,"https://opensource.org/licenses/NASA-1.3"],"tag":"LicenseUrl"},{"contents":{"contents":{"contents":["OKFN status","active",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["Open Definition","not reviewed",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NeutralLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Approved",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"}],"raw":{"_domain_content":false,"_domain_data":false,"_domain_software":true,"_family":null,"_id":"NASA-1.3","_legacy_ids":["nasa1.3"],"_maintainer":null,"_od_conformance":"not reviewed","_osd_conformance":"approved","_status":"active","_title":"NASA Open Source Agreement 1.3","_url":"https://opensource.org/licenses/NASA-1.3"},"type":"OKFN"},{"applicableLNs":{"contents":"SPDX:NASA-1.3","tag":"LN"},"id":["OrtLicenseCategorization","8232cf314aec8e235bab20063cbb6cb7"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:NASA-1.3"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:NASA-1.3","tag":"LN"},[{"contents":"NASA-1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","5e2e30416628e92292d1e84b2c5e2f09"],"impliedStmts":[],"raw":{"_clcAlias":["NASA-1.3"],"_clcName":"cavil:NASA-1.3"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:NASA License 1.3","tag":"LN"},[{"contents":"spdx:NASA-1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"NASA","tag":"LN"},{"contents":"NASA, Version 1.3","tag":"LN"},{"contents":"NASA, 1.3","tag":"LN"},{"contents":"NASA License, Version 1.3","tag":"LN"},{"contents":"NASA License, 1.3","tag":"LN"},{"contents":"NASA OPEN SOURCE AGREEMENT VERSION 1.3","tag":"LN"},{"contents":"scancode:nasa-1.3","tag":"LN"},{"contents":"osi:NASA-1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","7a71d06a6bb7d783b4e6af9fc9067d33"],"impliedStmts":[],"raw":{"_alternativeNames":["NASA, Version 1.3","NASA, 1.3","NASA License, Version 1.3","NASA License, 1.3","NASA OPEN SOURCE AGREEMENT VERSION 1.3"],"_canonicalName":"metaeffekt:NASA License 1.3","_category":"NASA","_openCoDEStatus":null,"_otherIds":["scancode:nasa-1.3","osi:NASA-1.3"],"_shortName":null,"_spdxIdentifier":"spdx:NASA-1.3"},"type":"MetaeffektLicense"}]