[{"applicableLNs":{"contents":[{"contents":"spdx:OLDAP-1.3","tag":"LN"},[{"contents":"Open LDAP Public License v1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","cd525c8dafb8e55004aaeb3d81b548eb"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["SPDXLicense","This license was released 17 January 1999. This license was issued twice in the same day with a minor correction. This is the corrected (second) version."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[{"contents":"The OpenLDAP Public License\nVersion 1.3, 17 January 1999\n\nCopyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.\n\nNote: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n     \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n     \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n     \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n     \"You\" is you, if you're thinking about copying or distributing this Package.\n\n     \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n     \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n     b) use the modified Package only within your corporation or organization.\n\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n     c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n7. C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n8. Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>The OpenLDAP Public License\n        <br />\n\nVersion 1.3, 17 January 1999\n      </p>\n\n      </div>\n      <div class=\"replaceable-license-text\"> \n         <p>Copyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Note: This license is derived from the &quot;Artistic License&quot; as distributed with the Perl\n         Programming Language. As significant differences exist, the complete license should be read.</p>\n\n         <p>PREAMBLE</p>\n\n         <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      </div>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Reasonable copying fee&quot; is whatever you can justify on the basis of media cost, duplication\n         charges, time of people involved, and so on. (You will not be required to justify it to the Copyright\n         Holder, but only to the computing community at large as a market that must bear the fee.)</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the item itself, though there may be fees\n         involved in handling the item. It also means that recipients of the item may redistribute it under the\n         same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public Domain\n             or from the Copyright Holder. A Package modified in such a way shall still be considered the\n             Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            place your modifications in the Public Domain or otherwise make them Freely Available, such\n               as by posting said modifications to Usenet or an equivalent medium, or placing the\n               modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright\n               Holder to include your modifications in the Standard Version of the Package.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            use the modified Package only within your corporation or organization.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            rename any non-standard executables so the names do not conflict with standard executables,\n               which must also be provided, and provide a separate manual page for each non-standard\n               executable that clearly documents how it differs from the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            distribute a Standard Version of the executables and library files, together with\n               instructions (in the manual page or equivalent) on where to get the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            accompany the distribution with the machine-readable source of the Package with your modifications.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            accompany any non-standard executables with their corresponding Standard Version executables,\n               giving the non-standard executables non-standard names, and clearly documenting the\n               differences in manual pages (or equivalent), together with instructions on where to get\n               the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a reasonable copying fee for any distribution of this Package. You may charge any\n             fee you choose for support of this Package. You may not charge a fee for this Package itself.\n             However, you may distribute this Package in aggregate with other (possibly commercial)\n             programs as part of a larger (possibly commercial) software distribution provided that you do\n             not advertise this Package as a product of your own.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whomever generated them, and may be sold commercially, and may be aggregated with this\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C subroutines supplied by you and linked into this Package in order to emulate subroutines and\n             variables defined by this Package shall not be considered part of this Package, but are the\n             equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior\n             of the Package in any way that would cause it to fail the regression tests for the\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Software supplied by you and linked with this Package in order to use subroutines and variables\n             defined by this Package shall not be considered part of this Package and do not automatically\n             fall under the copyright of this Package, and the executables produced by linking your\n             software with this Package may be used and redistributed without restriction and may be sold\n             commercially.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>The End</p>\n\n      </div>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"tag":"LicenseUrl"},{"contents":[null,"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:01:36Z","url":"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"}],"isDeprecatedLicenseId":false,"isFsfLibre":null,"isOsiApproved":false,"licenseComments":"This license was released 17 January 1999. This license was issued twice in the same day with a minor correction. This is the corrected (second) version.","licenseId":"spdx:OLDAP-1.3","licenseText":"The OpenLDAP Public License\nVersion 1.3, 17 January 1999\n\nCopyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.\n\nNote: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n     \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n     \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n     \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n     \"You\" is you, if you're thinking about copying or distributing this Package.\n\n     \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n     \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n     b) use the modified Package only within your corporation or organization.\n\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n     c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n7. C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n8. Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>The OpenLDAP Public License\n        <br />\n\nVersion 1.3, 17 January 1999\n      </p>\n\n      </div>\n      <div class=\"replaceable-license-text\"> \n         <p>Copyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.</p>\n\n      </div>\n      <div class=\"optional-license-text\"> \n         <p>Note: This license is derived from the &quot;Artistic License&quot; as distributed with the Perl\n         Programming Language. As significant differences exist, the complete license should be read.</p>\n\n         <p>PREAMBLE</p>\n\n         <p>The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.</p>\n\n      </div>\n\n      <p>Definitions:</p>\n\n      <p>&quot;Package&quot; refers to the collection of files distributed by the Copyright Holder, and\n         derivatives of that collection of files created through textual modification.</p>\n\n      <p>&quot;Standard Version&quot; refers to such a Package if it has not been modified, or has been modified\n         in accordance with the wishes of the Copyright Holder.</p>\n\n      <p>&quot;Copyright Holder&quot; is whoever is named in the copyright or copyrights for the package.</p>\n\n      <p>&quot;You&quot; is you, if you&apos;re thinking about copying or distributing this Package.</p>\n\n      <p>&quot;Reasonable copying fee&quot; is whatever you can justify on the basis of media cost, duplication\n         charges, time of people involved, and so on. (You will not be required to justify it to the Copyright\n         Holder, but only to the computing community at large as a market that must bear the fee.)</p>\n\n      <p>&quot;Freely Available&quot; means that no fee is charged for the item itself, though there may be fees\n         involved in handling the item. It also means that recipients of the item may redistribute it under the\n         same conditions they received it.</p>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          You may apply bug fixes, portability fixes and other modifications derived from the Public Domain\n             or from the Copyright Holder. A Package modified in such a way shall still be considered the\n             Standard Version.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least ONE of the following:\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            place your modifications in the Public Domain or otherwise make them Freely Available, such\n               as by posting said modifications to Usenet or an equivalent medium, or placing the\n               modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright\n               Holder to include your modifications in the Standard Version of the Package.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            use the modified Package only within your corporation or organization.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            rename any non-standard executables so the names do not conflict with standard executables,\n               which must also be provided, and provide a separate manual page for each non-standard\n               executable that clearly documents how it differs from the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least ONE of the following:\n        </li>\n\t\n<li>\n\t\n<ul style=\"list-style:none\">\n            \n<li>\n               <var class=\"replaceable-license-text\"> a)</var>\n            distribute a Standard Version of the executables and library files, together with\n               instructions (in the manual page or equivalent) on where to get the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> b)</var>\n            accompany the distribution with the machine-readable source of the Package with your modifications.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> c)</var>\n            accompany any non-standard executables with their corresponding Standard Version executables,\n               giving the non-standard executables non-standard names, and clearly documenting the\n               differences in manual pages (or equivalent), together with instructions on where to get\n               the Standard Version.\n          </li>\n            \n<li>\n               <var class=\"replaceable-license-text\"> d)</var>\n            make other distribution arrangements with the Copyright Holder.\n          </li>\n        \n</ul>\n\t</li>\n\t\n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          You may charge a reasonable copying fee for any distribution of this Package. You may charge any\n             fee you choose for support of this Package. You may not charge a fee for this Package itself.\n             However, you may distribute this Package in aggregate with other (possibly commercial)\n             programs as part of a larger (possibly commercial) software distribution provided that you do\n             not advertise this Package as a product of your own.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whomever generated them, and may be sold commercially, and may be aggregated with this\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          C subroutines supplied by you and linked into this Package in order to emulate subroutines and\n             variables defined by this Package shall not be considered part of this Package, but are the\n             equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior\n             of the Package in any way that would cause it to fail the regression tests for the\n             Package.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          Software supplied by you and linked with this Package in order to use subroutines and variables\n             defined by this Package shall not be considered part of this Package and do not automatically\n             fall under the copyright of this Package, and the executables produced by linking your\n             software with this Package may be used and redistributed without restriction and may be sold\n             commercially.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          THIS PACKAGE IS PROVIDED &quot;AS IS&quot; AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\n             INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\n             PARTICULAR PURPOSE.\n        </li>\n      \n</ul>\n\n      <div class=\"optional-license-text\"> \n         <p>The End</p>\n\n      </div>\n    ","name":"Open LDAP Public License v1.3","seeAlso":["http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"standardLicenseTemplate":"<<beginOptional>>The OpenLDAP Public License\n\nVersion 1.3, 17 January 1999\n\n<<endOptional>> <<var;name=\"copyright\";original=\"Copyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.  \";match=\".{0,5000}\">><<beginOptional>> Note: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\n<<endOptional>>\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> use the modified Package only within your corporation or organization.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      <<var;name=\"bullet\";original=\"a)\";match=\".{0,20}\">> distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"b)\";match=\".{0,20}\">> accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      <<var;name=\"bullet\";original=\"c)\";match=\".{0,20}\">> accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      <<var;name=\"bullet\";original=\"d)\";match=\".{0,20}\">> make other distribution arrangements with the Copyright Holder.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n   <<var;name=\"bullet\";original=\"8.\";match=\".{0,20}\">> Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n   <<var;name=\"bullet\";original=\"9.\";match=\".{0,20}\">> The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   <<var;name=\"bullet\";original=\"10.\";match=\".{0,20}\">> THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.<<beginOptional>> The End\n\n<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":"BlueOak:OLDAP-1.3","tag":"LN"},[{"contents":"Open LDAP Public License v1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["BlueOakCouncil","555daf929d9f6867a6b920762cd7ff0e"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["BlueOakCouncil","Lead",{"contents":"These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":[null,"https://spdx.org/licenses/OLDAP-1.3.html"],"tag":"LicenseUrl"}],"raw":{"contents":["Lead","These licenses lack one or more essential elements of permissive open software licenses or impose unusually burdensome requirements.  Many use unclear, jocular, or incomplete language.",{"_id":"OLDAP-1.3","_name":"Open LDAP Public License v1.3","_url":"https://spdx.org/licenses/OLDAP-1.3.html"}],"tag":"BOCPermissive"},"type":"BlueOakCouncil"},{"applicableLNs":{"contents":[{"contents":"scancode:openldap-1.3","tag":"LN"},[{"contents":"OpenLDAP Public License 1.3","tag":"LN"},{"contents":"OpenLDAP Public License 1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","20ea396b771d195dae88f69a21c7cfae"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["ScancodeData","Per SPDX.org, this license was released 17 January 1999. This license was\nissued twice in the same day with a minor correction. This is the corrected\n(second) version.\n"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":[null,"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"tag":"LicenseUrl"},{"contents":"The OpenLDAP Public License \n\nVersion 1.3, 17 January 1999 \nCopyright 1998-1999, The OpenLDAP Foundation. \nAll Rights Reserved. \n\nNote: \nThis license is derived from the \"Artistic License\" as distributed \nwith the Perl Programming Language. As significant differences \nexist, the complete license should be read. \n\nPREAMBLE \n\nThe intent of this document is to state the conditions under which \na Package may be copied, such that the Copyright Holder maintains \nsome semblance of artistic control over the development of the \npackage, while giving the users of the package the right to use \nand distribute the Package in a more-or-less customary fashion, \nplus the right to make reasonable modifications. \n\nDefinitions: \n\n\"Package\" refers to the collection of files distributed by the \nCopyright Holder, and derivatives of that collection of files \ncreated through textual modification. \n\n\"Standard Version\" refers to such a Package if it has not been \nmodified, or has been modified in accordance with the wishes \nof the Copyright Holder. \n\n\"Copyright Holder\" is whoever is named in the copyright or \ncopyrights for the package. \n\n\"You\" is you, if you're thinking about copying or distributing \nthis Package. \n\n\"Reasonable copying fee\" is whatever you can justify on the \nbasis of media cost, duplication charges, time of people \ninvolved, and so on. (You will not be required to justify it \nto the Copyright Holder, but only to the computing community \nat large as a market that must bear the fee.) \n\n\"Freely Available\" means that no fee is charged for the item \nitself, though there may be fees involved in handling the item. \nIt also means that recipients of the item may redistribute it \nunder the same conditions they received it. \n\n1. You may make and give away verbatim copies of the source form \nof the Standard Version of this Package without restriction, provided \nthat you duplicate all of the original copyright notices and \nassociated disclaimers. \n\n2. You may apply bug fixes, portability fixes and other modifications \nderived from the Public Domain or from the Copyright Holder. A \nPackage modified in such a way shall still be considered the Standard \nVersion. \n\n3. You may otherwise modify your copy of this Package in any way, \nprovided that you insert a prominent notice in each changed file \nstating how and when you changed that file, and provided that you \ndo at least ONE of the following: \n\na) place your modifications in the Public Domain or otherwise \nmake them Freely Available, such as by posting said modifications \nto Usenet or an equivalent medium, or placing the modifications \non a major archive site such as uunet.uu.net, or by allowing \nthe Copyright Holder to include your modifications in the \nStandard Version of the Package. \n\nb) use the modified Package only within your corporation or \norganization. \n\nc) rename any non-standard executables so the names do not \nconflict with standard executables, which must also be provided, \nand provide a separate manual page for each non-standard \nexecutable that clearly documents how it differs from the \nStandard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n4. You may distribute the programs of this Package in object code \nor executable form, provided that you do at least ONE of the \nfollowing: \n\na) distribute a Standard Version of the executables and library \nfiles, together with instructions (in the manual page or \nequivalent) on where to get the Standard Version. \n\nb) accompany the distribution with the machine-readable source \nof the Package with your modifications. \n\nc) accompany any non-standard executables with their corresponding \nStandard Version executables, giving the non-standard executables \nnon-standard names, and clearly documenting the differences in \nmanual pages (or equivalent), together with instructions on \nwhere to get the Standard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n5. You may charge a reasonable copying fee for any distribution of \nthis Package. You may charge any fee you choose for support of \nthis Package. You may not charge a fee for this Package itself. \nHowever, you may distribute this Package in aggregate with other \n(possibly commercial) programs as part of a larger (possibly \ncommercial) software distribution provided that you do not advertise \nthis Package as a product of your own. \n\n6. The scripts and library files supplied as input to or produced \nas output from the programs of this Package do not automatically \nfall under the copyright of this Package, but belong to whomever \ngenerated them, and may be sold commercially, and may be aggregated \nwith this Package. \n\n7. C subroutines supplied by you and linked into this Package in \norder to emulate subroutines and variables defined by this Package \nshall not be considered part of this Package, but are the equivalent \nof input as in Paragraph 6, provided these subroutines do not change \nthe behavior of the Package in any way that would cause it to fail \nthe regression tests for the Package. \n\n8. Software supplied by you and linked with this Package in order \nto use subroutines and variables defined by this Package shall not \nbe considered part of this Package and do not automatically fall \nunder the copyright of this Package, and the executables produced \nby linking your software with this Package may be used and \nredistributed without restriction and may be sold commercially. \n\n9. The name of the Copyright Holder may not be used to endorse or \npromote products derived from this software without specific prior \nwritten permission. \n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR \nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED \nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. \n\nThe End","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1","_key":"openldap-1.3","_name":"OpenLDAP Public License 1.3","_notes":"Per SPDX.org, this license was released 17 January 1999. This license was\nissued twice in the same day with a minor correction. This is the corrected\n(second) version.\n","_osiUrl":null,"_otherUrls":[],"_owner":"OpenLDAP Foundation","_shortName":"OpenLDAP Public License 1.3","_spdxId":"OLDAP-1.3","_text":"The OpenLDAP Public License \n\nVersion 1.3, 17 January 1999 \nCopyright 1998-1999, The OpenLDAP Foundation. \nAll Rights Reserved. \n\nNote: \nThis license is derived from the \"Artistic License\" as distributed \nwith the Perl Programming Language. As significant differences \nexist, the complete license should be read. \n\nPREAMBLE \n\nThe intent of this document is to state the conditions under which \na Package may be copied, such that the Copyright Holder maintains \nsome semblance of artistic control over the development of the \npackage, while giving the users of the package the right to use \nand distribute the Package in a more-or-less customary fashion, \nplus the right to make reasonable modifications. \n\nDefinitions: \n\n\"Package\" refers to the collection of files distributed by the \nCopyright Holder, and derivatives of that collection of files \ncreated through textual modification. \n\n\"Standard Version\" refers to such a Package if it has not been \nmodified, or has been modified in accordance with the wishes \nof the Copyright Holder. \n\n\"Copyright Holder\" is whoever is named in the copyright or \ncopyrights for the package. \n\n\"You\" is you, if you're thinking about copying or distributing \nthis Package. \n\n\"Reasonable copying fee\" is whatever you can justify on the \nbasis of media cost, duplication charges, time of people \ninvolved, and so on. (You will not be required to justify it \nto the Copyright Holder, but only to the computing community \nat large as a market that must bear the fee.) \n\n\"Freely Available\" means that no fee is charged for the item \nitself, though there may be fees involved in handling the item. \nIt also means that recipients of the item may redistribute it \nunder the same conditions they received it. \n\n1. You may make and give away verbatim copies of the source form \nof the Standard Version of this Package without restriction, provided \nthat you duplicate all of the original copyright notices and \nassociated disclaimers. \n\n2. You may apply bug fixes, portability fixes and other modifications \nderived from the Public Domain or from the Copyright Holder. A \nPackage modified in such a way shall still be considered the Standard \nVersion. \n\n3. You may otherwise modify your copy of this Package in any way, \nprovided that you insert a prominent notice in each changed file \nstating how and when you changed that file, and provided that you \ndo at least ONE of the following: \n\na) place your modifications in the Public Domain or otherwise \nmake them Freely Available, such as by posting said modifications \nto Usenet or an equivalent medium, or placing the modifications \non a major archive site such as uunet.uu.net, or by allowing \nthe Copyright Holder to include your modifications in the \nStandard Version of the Package. \n\nb) use the modified Package only within your corporation or \norganization. \n\nc) rename any non-standard executables so the names do not \nconflict with standard executables, which must also be provided, \nand provide a separate manual page for each non-standard \nexecutable that clearly documents how it differs from the \nStandard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n4. You may distribute the programs of this Package in object code \nor executable form, provided that you do at least ONE of the \nfollowing: \n\na) distribute a Standard Version of the executables and library \nfiles, together with instructions (in the manual page or \nequivalent) on where to get the Standard Version. \n\nb) accompany the distribution with the machine-readable source \nof the Package with your modifications. \n\nc) accompany any non-standard executables with their corresponding \nStandard Version executables, giving the non-standard executables \nnon-standard names, and clearly documenting the differences in \nmanual pages (or equivalent), together with instructions on \nwhere to get the Standard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n5. You may charge a reasonable copying fee for any distribution of \nthis Package. You may charge any fee you choose for support of \nthis Package. You may not charge a fee for this Package itself. \nHowever, you may distribute this Package in aggregate with other \n(possibly commercial) programs as part of a larger (possibly \ncommercial) software distribution provided that you do not advertise \nthis Package as a product of your own. \n\n6. The scripts and library files supplied as input to or produced \nas output from the programs of this Package do not automatically \nfall under the copyright of this Package, but belong to whomever \ngenerated them, and may be sold commercially, and may be aggregated \nwith this Package. \n\n7. C subroutines supplied by you and linked into this Package in \norder to emulate subroutines and variables defined by this Package \nshall not be considered part of this Package, but are the equivalent \nof input as in Paragraph 6, provided these subroutines do not change \nthe behavior of the Package in any way that would cause it to fail \nthe regression tests for the Package. \n\n8. Software supplied by you and linked with this Package in order \nto use subroutines and variables defined by this Package shall not \nbe considered part of this Package and do not automatically fall \nunder the copyright of this Package, and the executables produced \nby linking your software with this Package may be used and \nredistributed without restriction and may be sold commercially. \n\n9. The name of the Copyright Holder may not be used to endorse or \npromote products derived from this software without specific prior \nwritten permission. \n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR \nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED \nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. \n\nThe End","_textUrls":["http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:OLDAP-1.3","tag":"LN"},[{"contents":"Open LDAP Public License v1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","8ae569372fca6ea1ee4ec4adc15328f0"],"impliedStmts":[{"contents":{"contents":[null,"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology","This license was released 17 January 1999. This license was issued twice in the same day with a minor correction. This is the corrected (second) version."],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"The OpenLDAP Public License\n\nVersion 1.3, 17 January 1999 Copyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved. Note: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   7. C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n   8. Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Open LDAP Public License v1.3","_rf_notes":"This license was released 17 January 1999. This license was issued twice in the same day with a minor correction. This is the corrected (second) version.","_rf_risk":null,"_rf_shortname":"fossology:OLDAP-1.3","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"The OpenLDAP Public License\n\nVersion 1.3, 17 January 1999 Copyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved. Note: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n   1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n   2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n   3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n      a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n      b) use the modified Package only within your corporation or organization.\n\n      c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n      a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n      b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n      c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n      d) make other distribution arrangements with the Copyright Holder.\n\n   5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n   6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n   7. C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n   8. Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n   9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n   10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. The End","_rf_text_updatable":false,"_rf_url":"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:OLDAP-1.3","tag":"LN"},"id":["OrtLicenseCategorization","ca2d2720d8916b2ae68b4b14dffefec9"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:OLDAP-1.3"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:OLDAP-1.3","tag":"LN"},[{"contents":"OLDAP-1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","49640195a91418d897c887a31d713010"],"impliedStmts":[],"raw":{"_clcAlias":["OLDAP-1.3"],"_clcName":"cavil:OLDAP-1.3"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:OpenLDAP Public License 1.3","tag":"LN"},[{"contents":"spdx:OLDAP-1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"OLDAP","tag":"LN"},{"contents":"OLDAP, Version 1.3","tag":"LN"},{"contents":"OLDAP, 1.3","tag":"LN"},{"contents":"OLDAP License, Version 1.3","tag":"LN"},{"contents":"OLDAP License, 1.3","tag":"LN"},{"contents":"The OpenLDAP Public License Version 1.3, 17 January 1999","tag":"LN"},{"contents":"THIS WORK IS SUBJECT TO VERSION 1.3 OF THE OPENLDAP PUBLIC LICENSE","tag":"LN"},{"contents":"scancode:openldap-1.3","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","7406d57e5681f89e53afbc2856f4dbf4"],"impliedStmts":[],"raw":{"_alternativeNames":["OLDAP, Version 1.3","OLDAP, 1.3","OLDAP License, Version 1.3","OLDAP License, 1.3","The OpenLDAP Public License Version 1.3, 17 January 1999","THIS WORK IS SUBJECT TO VERSION 1.3 OF THE OPENLDAP PUBLIC LICENSE"],"_canonicalName":"metaeffekt:OpenLDAP Public License 1.3","_category":"OLDAP","_openCoDEStatus":null,"_otherIds":["scancode:openldap-1.3"],"_shortName":null,"_spdxIdentifier":"spdx:OLDAP-1.3"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"spdx:OLDAP-1.3","tag":"LN"},[{"contents":"Open LDAP Public License v1.3","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["HermineLicense","efd478d84d8b92c17061d56051974ae8"],"impliedStmts":[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"},{"contents":{"contents":{"contents":["HermineLicense","We consider it is FOSS",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"PositiveLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":["HermineLicense",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":"","tag":"LicenseText"},{"contents":[null,"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1"],"tag":"LicenseUrl"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense","\"OLDAP-1.3\" is of radical: OLDAP"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"autoupgrade":null,"comment":"","copyleft":"Weak","ethical_clause":false,"foss":"Yes","fsf_approved":null,"inspiration_spdx":"","law_choice":"","license_version":"1.3","long_name":"Open LDAP Public License v1.3","non_commercial":false,"non_tivoisation":false,"obligations":[{"generic":[{"description":"Make the corresponding source code available (including modifications):\r\n-at the time of distribution of the software and on the same medium;\r\n-by including a written offer allowing others to obtain it;\r\n-by making it available online.","metacategory":"ProvidingSourceCode","name":"Providing CSC to end user","passivity":"Active"}],"license":["OLDAP-1.3"],"name":"Providing CSC to end user or specific actions","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\r\n\r\n    a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\r\n    b) accompany the distribution with the machine-readable source of the Package with your modifications.\r\n    c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\r\n    d) make other distribution arrangements with the Copyright Holder."},{"generic":[{"description":"Document all your modifications made in the source code of third-party Open Source components in order to clearly attribute each contribution.","metacategory":"Mentions","name":"Track and mention modifications in the source code","passivity":"Active"}],"license":["OLDAP-1.3"],"name":"Marking modifications","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file"},{"generic":[{"description":"Keep all legal notices and license texts intact in the Source Code, including in the headers.","metacategory":"Mentions","name":"Preserve legal mentions in source code","passivity":"Active"}],"license":["OLDAP-1.3"],"name":"Preserve License and notices in source code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers."},{"generic":[{"description":"Some categories of derivative works or of works based on the Open Source Software must be distributed under the initial license or another license approved by the initial license.","metacategory":"IPManagement","name":"Weak Copyleft","passivity":"Active"}],"license":["OLDAP-1.3"],"name":"Weak Copyleft or renaming","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"provided that you do at least ONE of the following:\r\n\r\n    a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\r\n    b) use the modified Package only within your corporation or organization.\r\n    c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\r\n    d) make other distribution arrangements with the Copyright Holder."},{"generic":[{"description":"Names of the project or associated persons (authors, contributors, etc.) are not to be used for commercial or promotional purposes.","metacategory":"Communication","name":"Do not use project or contributor names for endorsement or promotion.","passivity":"Passive"}],"license":["OLDAP-1.3"],"name":"No use of names for endorsement","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission."}],"osi_approved":false,"patent_grant":false,"radical":"OLDAP","spdx_id":"OLDAP-1.3","steward":"","url":"http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=e5f8117f0ce088d0bd7a8e18ddf37eaa40eb09b1","verbatim":""},"type":"HermineLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"fosslight:Open LDAP Public License v1.3","tag":"LN"},[{"contents":"OLDAP-1.3","tag":"LN"}]],"tag":"AlternativeLNs"},[]],"tag":"ImpreciseLNs"},"id":["FOSSLight","5e43d0d84b913ab5046abb4da9301d06"],"impliedStmts":[{"contents":{"tag":"Permissive"},"tag":"LicenseType"}],"raw":{"_FOSSLightFact_License":{"_fossLight_ATTRIBUTION":"","_fossLight_CREATED_DATE":[],"_fossLight_CREATOR":[],"_fossLight_DESCRIPTION":"","_fossLight_LICENSE_TEXT":"The OpenLDAP Public License\nVersion 1.3, 17 January 1999 \n\nCopyright 1998-1999, The OpenLDAP Foundation. All Rights Reserved.\n\nNote: This license is derived from the \"Artistic License\" as distributed with the Perl Programming Language. As significant differences exist, the complete license should be read.\n\nPREAMBLE\n\nThe intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.\n\nDefinitions:\n\n     \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n\n     \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n\n     \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\n     \"You\" is you, if you're thinking about copying or distributing this Package.\n\n     \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n\n     \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n\n1. You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.\n\n2. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n\n3. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n\n     a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n\n     b) use the modified Package only within your corporation or organization.\n\n     c) rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n4. You may distribute the programs of this Package in object code or executable form, provided that you do at least ONE of the following:\n\n     a) distribute a Standard Version of the executables and library files, together with instructions (in the manual page or equivalent) on where to get the Standard Version.\n\n     b) accompany the distribution with the machine-readable source of the Package with your modifications.\n\n     c) accompany any non-standard executables with their corresponding Standard Version executables, giving the non-standard executables non-standard names, and clearly documenting the differences in manual pages (or equivalent), together with instructions on where to get the Standard Version.\n\n     d) make other distribution arrangements with the Copyright Holder.\n\n5. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you do not advertise this Package as a product of your own.\n\n6. The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n\n7. C subroutines supplied by you and linked into this Package in order to emulate subroutines and variables defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the behavior of the Package in any way that would cause it to fail the regression tests for the Package.\n\n8. Software supplied by you and linked with this Package in order to use subroutines and variables defined by this Package shall not be considered part of this Package and do not automatically fall under the copyright of this Package, and the executables produced by linking your software with this Package may be used and redistributed without restriction and may be sold commercially.\n\n9. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n\n10. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThe End\n","_fossLight_MODIFIED_DATE":[],"_fossLight_MODIFIER":[],"_fossLight_OBLIGATION_DISCLOSING_SRC":false,"_fossLight_OBLIGATION_NEEDS_CHECK":false,"_fossLight_OBLIGATION_NOTIFICATION":true,"_fossLight_REQ_LICENSE_TEXT":false,"_fossLight_RESTRICTION":null,"_fossLight_SHORT_IDENTIFIER":"OLDAP-1.3","_fossLight_USE":true,"_fossLight_WEBPAGE":"https://spdx.org/licenses/OLDAP-1.3.html","_fossLight_id":110,"_fossLight_name":"fosslight:Open LDAP Public License v1.3","_fossLight_type":"FOSSLight_License_Type_Permissive"},"_FOSSLightFact_Nicks":[]},"type":"FOSSLight"}]