[{"applicableLNs":{"contents":[{"contents":"spdx:OPL-1.0","tag":"LN"},[{"contents":"Open Public License v1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["SPDXLicense","a8d5d965dec3612afbc69d6b352700ad"],"impliedStmts":[{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["FSF","Not-Libre",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":null,"tag":"MaybeStatement"},{"contents":[{"contents":"OPEN PUBLIC LICENSE\nVersion 1.0\n\n1. Definitions.\n\n     1.1. \"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n\n     1.2. \"Contributor Version\" means the combination of the Original Code, prior Modifications used by a Contributor, and the Modifications made by that particular Contributor.\n\n     1.3. \"Covered Code\" means the Original Code or Modifications or the combination of the Original Code and Modifications, in each case including portions thereof.\n\n     1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software development community for the electronic transfer of data.\n\n     1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n     1.6. \"Initial Developer\" means the individual or entity identified as the Initial Developer in the Source Code notice required by Exhibit A.\n\n     1.7. \"Larger Work\" means a work, which combines Covered Code or portions thereof with code not governed by the terms of this License.\n\n     1.8. \"License\" means this document and the corresponding addendum described in section 6.4 below.\n\n     1.9. \"Modifications\" means any addition to or deletion from the substance or structure of either the Original Code or any previous Modifications. When Covered Code is released as a series of files, a Modification is:\n\n          A. Any addition to or deletion from the contents of a file containing Original Code or previous Modifications.\n\n          B. Any new file that contains any part of the Original Code or previous Modifications.\n\n     1.10. \"Original Code\" means Source Code of computer software code which is described in the Source Code notice required by Exhibit A as Original Code, and which, at the time of its release under this License is not already Covered Code governed by this License.\n\n     1.11. \"Source Code\" means the preferred form of the Covered Code for making modifications to it, including all modules it contains, plus any associated interface definition files, scripts used to control compilation and installation of an Executable, or a list of source code differential comparisons against either the Original Code or another well known, available Covered Code of the Contributor's choice. The Source Code can be in a compressed or archival form, provided the appropriate decompression or de-archiving software is widely available for no charge.\n\n     1.12. \"You\" means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License or a future version of this License issued under Section 6.1. For legal entities, \"You'' includes any entity which controls, is controlled by, or is under common control with You. For purposes of this definition, \"control'' means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of such entity.\n\n     1.13 \"License Author\" means Lutris Technologies, Inc.\n\n2. Source Code License.\n\n     2.1. The Initial Developer Grant. The Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n          (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Original Code (or portions thereof) with or without Modifications, or as part of a Larger Work; and\n\n          (b) under patents now or hereafter owned or controlled by Initial Developer, to make, have made, use and sell (``offer to sell and import'') the Original Code (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Original Code (or portions thereof) and not to any greater extent that may be necessary to Utilize further Modifications or combinations.\n\n     2.2. Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n          (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Modifications created by such Contributor (or portions thereof) either on an unmodified basis, with other Modifications, as Covered Code or as part of a Larger Work; and\n\n          (b) under patents now or hereafter owned or controlled by Contributor, to to make, have made, use and sell (``offer to sell and import'') the Contributor Version (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Contributor Version (or portions thereof), and not to any greater extent that may be necessary to Utilize further Modifications or combinations\n\n3. Distribution Obligations.\n\n     3.1. Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1, and You must include a copy of this License with every copy of the Source Code You distribute. You may not offer or impose any terms on any Source Code version that alters or restricts the applicable version of this License or the recipients' rights hereunder. However, You may include an additional document offering the additional rights described in Section 3.5.\n\n     3.2. Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients. You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available.\n\n     3.3. Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change. You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an Executable version or related documentation in which You describe the origin or ownership of the Covered Code.\n\n     3.4. Intellectual Property Matters\n\n          (a) Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained.\n\n          (b) Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a) above, Contributor believes that Contributor's Modifications are Contributor's original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this License.\n\n     3.5. Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice. You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone, and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer.\n\n     3.6. Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code. You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License. If You distribute the Executable version under a different license You must make it absolutely clear that any terms which differ from this License are offered by You alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of any such terms You offer. If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product.\n\n     3.7. Larger Works. You may create a Larger Work by combining Covered Code with other code not governed by the terms of this License and distribute the Larger Work as a single product. In such a case, You must make sure the requirements of this License are fulfilled for the Covered Code.\n\n4. Inability to Comply Due to Statute or Regulation.\n\nIf it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n5. Application of this License.\n\nThis License applies to code to which the Initial Developer has attached the notice in Exhibit A, and to related Covered Code.\n\n6. Versions of the License.\n\n     6.1. New Versions. License Author may publish revised and/or new versions of the License from time to time. Each version will be given a distinguishing version number and shall be submitted to opensource.org for certification.\n\n     6.2. Effect of New Versions. Once Covered Code has been published under a particular version of the License, You may always continue to use it under the terms of that version. You may also choose to use such Covered Code under the terms of any subsequent version of the License published by Initial Developer. No one other than Initial Developer has the right to modify the terms applicable to Covered Code created under this License.\n\n     6.3. Derivative Works. If you create or use a modified version of this License, except in association with the required Developer Specific License described in section 6.4, (which you may only do in order to apply it to code which is not already Covered Code governed by this License), you must (a) rename Your license so that the phrases ``Open'', ``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear anywhere in your license and (b) otherwise make it clear that your version of the license contains terms which differ from the Open Public License. (Filling in the name of the Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall not of themselves be deemed to be modifications of this License.)\n\n     6.4. Required Additional Developer Specific License\nThis license is a union of the following two parts that should be found as text files in the same place (directory), in the order of preeminence:\n\n          [1] A Developer specific license.\n\n          [2] The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n\nIn case of conflicting dispositions in the parts of this license, the terms of the lower-numbered part will always be superseded by the terms of the higher numbered part.\n\n7. DISCLAIMER OF WARRANTY.\n\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n8. TERMINATION.\n\n     8.1 Termination upon Breach\nThis License and the rights granted hereunder will terminate automatically if You fail to comply with terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses to the Covered Code, which are properly granted, shall survive any termination of this License. Provisions that, by their nature, must remain in effect beyond the termination of this License shall survive.\n\n     8.2. Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\n\n          (a) such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\n\n          (b) any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant.\n\n     8.3. If You assert a patent infringement claim against Participant alleging that such Participant's Contributor Version directly or indirectly infringes any patent where such claim is resolved (such as by license or settlement) prior to the initiation of patent infringement litigation, then the reasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of any payment or license.\n\n     8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or any distributor hereunder prior to termination shall survive termination.\n\n9. LIMITATION OF LIABILITY.\n\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n10. U.S. GOVERNMENT END USERS.\n\nThe Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of ``commercial computer software'' and ``commercial computer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only those rights set forth herein.\n\n11. MISCELLANEOUS.\n\n his section was intentionally left blank. The contents of this section are found in the corresponding addendum described above.\n\n12. RESPONSIBILITY FOR CLAIMS.\n\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for damages arising, directly or indirectly, out of Your utilization of rights under this License, based on the number of copies of Covered Code you made available, the revenues you received from utilizing such rights, and other relevant factors. You agree to work with affected parties to distribute with Initial Developer responsibility on an equitable basis.\n\nEXHIBIT A.\n\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\nEXHIBIT B.\n\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n","tag":"LicenseText"},[{"contents":"\n      <div class=\"optional-license-text\"> \n         <p>OPEN PUBLIC LICENSE\n        <br />\n\nVersion 1.0\n      </p>\n\n      </div>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          Definitions.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.1.</var>\n            &quot;Contributor&quot; means each entity that creates or contributes to the creation of\n               Modifications.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.2.</var>\n            &quot;Contributor Version&quot; means the combination of the Original Code, prior\n               Modifications used by a Contributor, and the Modifications made by that particular\n               Contributor.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.3.</var>\n            &quot;Covered Code&quot; means the Original Code or Modifications or the combination of the\n               Original Code and Modifications, in each case including portions thereof.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.4.</var>\n            &quot;Electronic Distribution Mechanism&quot; means a mechanism generally accepted in the\n               software development community for the electronic transfer of data.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.5.</var>\n            &quot;Executable&quot; means Covered Code in any form other than Source Code.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.6.</var>\n            &quot;Initial Developer&quot; means the individual or entity identified as the Initial\n               Developer in the Source Code notice required by Exhibit A.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.7.</var>\n            &quot;Larger Work&quot; means a work, which combines Covered Code or portions thereof with\n               code not governed by the terms of this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.8.</var>\n            &quot;License&quot; means this document and the corresponding addendum described in section\n               6.4 below.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.9.</var>\n            &quot;Modifications&quot; means any addition to or deletion from the substance or structure\n               of either the Original Code or any previous Modifications. When Covered Code is released\n               as a series of files, a Modification is:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> A.</var>\n              Any addition to or deletion from the contents of a file containing Original Code or\n                 previous Modifications.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> B.</var>\n              Any new file that contains any part of the Original Code or previous Modifications.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.10.</var>\n            &quot;Original Code&quot; means Source Code of computer software code which is described in\n               the Source Code notice required by Exhibit A as Original Code, and which, at the time of\n               its release under this License is not already Covered Code governed by this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.11.</var>\n            &quot;Source Code&quot; means the preferred form of the Covered Code for making modifications\n               to it, including all modules it contains, plus any associated interface definition files,\n               scripts used to control compilation and installation of an Executable, or a list of source\n               code differential comparisons against either the Original Code or another well known,\n               available Covered Code of the Contributor&apos;s choice. The Source Code can be in a\n               compressed or archival form, provided the appropriate decompression or de-archiving\n               software is widely available for no charge.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.12.</var>\n            &quot;You&quot; means an individual or a legal entity exercising rights under, and complying\n               with all of the terms of, this License or a future version of this License issued under\n               Section 6.1. For legal entities, &quot;You&apos;&apos; includes any entity which controls,\n               is controlled by, or is under common control with You. For purposes of this definition,\n               &quot;control&apos;&apos; means (a) the power, direct or indirect, to cause the direction\n               or management of such entity, whether by contract or otherwise, or (b) ownership of fifty\n               percent (50%) or more of the outstanding shares or beneficial ownership of such\n               entity.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.13</var>\n            &quot;License Author&quot; means Lutris Technologies, Inc.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Source Code License.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 2.1.</var>\n            The Initial Developer Grant. The Initial Developer hereby grants You a worldwide,\n               royalty-free, non-exclusive license, subject to third party intellectual property\n               claims:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              under intellectual property rights (other than patent or trademark) to use, reproduce,\n                 modify, display, perform, sublicense and distribute the Original Code (or portions\n                 thereof) with or without Modifications, or as part of a Larger Work; and\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              under patents now or hereafter owned or controlled by Initial Developer, to make, have\n                 made, use and sell (``offer to sell and import&apos;&apos;) the Original Code (or\n                 portions thereof), but solely to the extent that any such patent is reasonably\n                 necessary to enable You to Utilize the Original Code (or portions thereof) and not to\n                 any greater extent that may be necessary to Utilize further Modifications or\n                 combinations.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 2.2.</var>\n            Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free,\n               non-exclusive license, subject to third party intellectual property claims:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              under intellectual property rights (other than patent or trademark) to use, reproduce,\n                 modify, display, perform, sublicense and distribute the Modifications created by such\n                 Contributor (or portions thereof) either on an unmodified basis, with other\n                 Modifications, as Covered Code or as part of a Larger Work; and\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              under patents now or hereafter owned or controlled by Contributor, to to make, have made,\n                 use and sell (``offer to sell and import&apos;&apos;) the Contributor Version (or\n                 portions thereof), but solely to the extent that any such patent is reasonably\n                 necessary to enable You to Utilize the Contributor Version (or portions thereof), and\n                 not to any greater extent that may be necessary to Utilize further Modifications or\n                 combinations\n            </li>\n                  \n</ul>\n               </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Distribution Obligations.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.1.</var>\n            Application of License. The Modifications which You create or to which You contribute are\n               governed by the terms of this License, including without limitation Section 2.2. The\n               Source Code version of Covered Code may be distributed only under the terms of this\n               License or a future version of this License released under Section 6.1, and You must\n               include a copy of this License with every copy of the Source Code You distribute. You may\n               not offer or impose any terms on any Source Code version that alters or restricts the\n               applicable version of this License or the recipients&apos; rights hereunder. However, You\n               may include an additional document offering the additional rights described in Section\n               3.5.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.2.</var>\n            Availability of Source Code. Any Modification which You create or to which You contribute\n               must be made available, prior to any use, except for internal development and practice, in\n               Source Code form under the terms of this License either on the same media as an Executable\n               version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an\n               Executable version available; and if made available via Electronic Distribution Mechanism,\n               must remain available for at least twelve (12) months after the date it initially became\n               available, or at least six (6) months after a subsequent version of that particular\n               Modification has been made available to such recipients. You shall notify the Initial\n               Developer of the Modification and the location of the Source Code via the contact means\n               provided for in the Developer Specific license. Initial Developer will be acting as\n               maintainer of the Source Code and may provide an Electronic Distribution mechanism for the\n               Modification to be made available.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.3.</var>\n            Description of Modifications. You must cause all Covered Code to which you contribute to\n               contain a file documenting the changes You made to create that Covered Code and the date\n               of any change. You must include a prominent statement that the Modification is derived,\n               directly or indirectly, from Original Code provided by the Initial Developer and including\n               the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an\n               Executable version or related documentation in which You describe the origin or ownership\n               of the Covered Code.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.4.</var>\n            Intellectual Property Matters\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              Third Party Claims. If You have knowledge that a party claims an intellectual property\n                 right in particular functionality or code (or its utilization under this License), you\n                 must include a text file with the source code distribution titled &quot;LEGAL&quot;\n                 which describes the claim and the party making the claim in sufficient detail that a\n                 recipient will know whom to contact. If you obtain such knowledge after You make Your\n                 Modification available as described in Section 3.2, You shall promptly modify the\n                 LEGAL file in all copies You make available thereafter and shall take other steps\n                 (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to\n                 inform those who received the Covered Code that new knowledge has been obtained.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              Representations. Contributor represents that, except as disclosed pursuant to Section\n                 3.4(a) above, Contributor believes that Contributor&apos;s Modifications are\n                 Contributor&apos;s original creation(s) and/or Contributor has sufficient rights to\n                 grant the rights conveyed by this License.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.5.</var>\n            Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code,\n               and this License in any documentation for the Source Code, where You describe\n               recipients&apos; rights relating to Covered Code. If You created one or more\n               Modification(s), You may add your name as a Contributor to the notice described in Exhibit\n               A. If it is not possible to put such notice in a particular Source Code file due to its\n               structure, then you must include such notice in a location (such as a relevant directory\n               file) where a user would be likely to look for such a notice. You may choose to offer, and\n               to charge a fee for, warranty, support, indemnity or liability obligations to one or more\n               recipients of Covered Code. However, You may do so only on Your own behalf, and not on\n               behalf of the Initial Developer or any Contributor. You must make it absolutely clear that\n               any such warranty, support, indemnity or liability obligation is offered by You alone, and\n               You hereby agree to indemnify the Initial Developer and every Contributor for any\n               liability incurred by the Initial Developer or such Contributor as a result of warranty,\n               support, indemnity or liability terms You offer.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.6.</var>\n            Distribution of Executable Versions. You may distribute Covered Code in Executable form only\n               if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You\n               include a notice stating that the Source Code version of the Covered Code is available\n               under the terms of this License, including a description of how and where You have\n               fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any\n               notice in an Executable version, related documentation or collateral in which You describe\n               recipients&apos; rights relating to the Covered Code. You may distribute the Executable\n               version of Covered Code under a license of Your choice, which may contain terms different\n               from this License, provided that You are in compliance with the terms of this License and\n               that the license for the Executable version does not attempt to limit or alter the\n               recipient&apos;s rights in the Source Code version from the rights set forth in this\n               License. If You distribute the Executable version under a different license You must make\n               it absolutely clear that any terms which differ from this License are offered by You\n               alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the\n               Initial Developer and every Contributor for any liability incurred by the Initial\n               Developer or such Contributor as a result of any such terms You offer. If you distribute\n               executable versions containing Covered Code, you must reproduce the notice in Exhibit B in\n               the documentation and/or other materials provided with the product.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.7.</var>\n            Larger Works. You may create a Larger Work by combining Covered Code with other code not\n               governed by the terms of this License and distribute the Larger Work as a single product.\n               In such a case, You must make sure the requirements of this License are fulfilled for the\n               Covered Code.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Inability to Comply Due to Statute or Regulation.\n          <p>If it is impossible for You to comply with any of the terms of this License with respect to some\n             or all of the Covered Code due to statute or regulation then You must: (a) comply with the\n             terms of this License to the maximum extent possible; and (b) Cite all of the statutes or\n             regulations that prohibit you from complying fully with this license. (c) describe the\n             limitations and the code they affect. Such description must be included in the LEGAL file\n             described in Section 3.4 and must be included with all distributions of the Source Code.\n             Except to the extent prohibited by statute or regulation, such description must be\n             sufficiently detailed for a recipient of ordinary skill to be able to understand it.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          Application of this License.\n          <p>This License applies to code to which the Initial Developer has attached the notice in Exhibit A,\n             and to related Covered Code.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          Versions of the License.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.1.</var>\n            New Versions. License Author may publish revised and/or new versions of the License from time\n               to time. Each version will be given a distinguishing version number and shall be submitted\n               to opensource.org for certification.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.2.</var>\n            Effect of New Versions. Once Covered Code has been published under a particular version of\n               the License, You may always continue to use it under the terms of that version. You may\n               also choose to use such Covered Code under the terms of any subsequent version of the\n               License published by Initial Developer. No one other than Initial Developer has the right\n               to modify the terms applicable to Covered Code created under this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.3.</var>\n            Derivative Works. If you create or use a modified version of this License, except in\n               association with the required Developer Specific License described in section 6.4, (which\n               you may only do in order to apply it to code which is not already Covered Code governed by\n               this License), you must (a) rename Your license so that the phrases ``Open&apos;&apos;,\n               ``OpenPL&apos;&apos;, ``OPL&apos;&apos; or any confusingly similar phrase do not appear\n               anywhere in your license and (b) otherwise make it clear that your version of the license\n               contains terms which differ from the Open Public License. (Filling in the name of the\n               Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall\n               not of themselves be deemed to be modifications of this License.)\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.4.</var>\n            Required Additional Developer Specific License\n              <br />\n\n      This license is a union of the following two parts that should be found as text files\n                   in the same place (directory), in the order of preeminence:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> [1]</var>\n              A Developer specific license.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> [2]</var>\n              The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n            </li>\n                  \n</ul>\n                  <p>In case of conflicting dispositions in the parts of this license, the terms of the\n                 lower-numbered part will always be superseded by the terms of the higher numbered\n                 part.</p>\n\n               </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          DISCLAIMER OF WARRANTY.\n          <p>COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN &quot;AS IS&quot; BASIS, WITHOUT WARRANTY OF\n             ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\n             COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING.\n             THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY\n             COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER\n             CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER\n             OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS\n             AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          TERMINATION.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.1</var>\n            Termination upon Breach\n              <br />\n\n      This License and the rights granted hereunder will terminate automatically if You fail\n                   to comply with terms herein and fail to cure such breach within 30 days of\n                   becoming aware of the breach. All sublicenses to the Covered Code, which are\n                   properly granted, shall survive any termination of this License. Provisions that,\n                   by their nature, must remain in effect beyond the termination of this License\n                   shall survive.\n\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.2.</var>\n            Termination Upon Litigation. If You initiate litigation by asserting a patent infringement\n               claim (excluding declatory judgment actions) against Initial Developer or a Contributor\n               (the Initial Developer or Contributor against whom You file such action is referred to as\n               &quot;Participant&quot;) alleging that:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              such Participant&apos;s Contributor Version directly or indirectly infringes any patent,\n                 then any and all rights granted by such Participant to You under Sections 2.1 and/or\n                 2.2 of this License shall, upon 60 days notice from Participant terminate\n                 prospectively, unless if within 60 days after receipt of notice You either: (i) agree\n                 in writing to pay Participant a mutually agreeable reasonable royalty for Your past\n                 and future use of Modifications made by such Participant, or (ii) withdraw Your\n                 litigation claim with respect to the Contributor Version against such Participant. If\n                 within 60 days of notice, a reasonable royalty and payment arrangement are not\n                 mutually agreed upon in writing by the parties or the litigation claim is not\n                 withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2\n                 automatically terminate at the expiration of the 60 day notice period specified\n                 above.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              any software, hardware, or device, other than such Participant&apos;s Contributor\n                 Version, directly or indirectly infringes any patent, then any rights granted to You\n                 by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the\n                 date You first made, used, sold, distributed, or had made, Modifications made by that\n                 Participant.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.3.</var>\n            If You assert a patent infringement claim against Participant alleging that such\n               Participant&apos;s Contributor Version directly or indirectly infringes any patent where\n               such claim is resolved (such as by license or settlement) prior to the initiation of\n               patent infringement litigation, then the reasonable value of the licenses granted by such\n               Participant under Sections 2.1 or 2.2 shall be taken into account in determining the\n               amount or value of any payment or license.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.4.</var>\n            In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n               (excluding distributors and resellers) which have been validly granted by You or any\n               distributor hereunder prior to termination shall survive termination.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          LIMITATION OF LIABILITY.\n          <p>UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT,\n             OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\n             COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR\n             ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING,\n             WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR\n             MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE\n             BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY\n             TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY&apos;S NEGLIGENCE TO THE\n             EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\n             OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT\n             APPLY TO YOU.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          U.S. GOVERNMENT END USERS.\n          <p>The Covered Code is a ``commercial item,&apos;&apos; as that term is defined in 48 C.F.R. 2.101\n             (Oct. 1995), consisting of ``commercial computer software&apos;&apos; and ``commercial\n             computer software documentation,&apos;&apos; as such terms are used in 48 C.F.R. 12.212 (Sept.\n             1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June\n             1995), all U.S. Government End Users acquire Covered Code with only those rights set forth\n             herein.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 11.</var>\n          MISCELLANEOUS.\n          <p>his section was intentionally left blank. The contents of this section are found in the\n             corresponding addendum described above.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 12.</var>\n          RESPONSIBILITY FOR CLAIMS.\n        </li>\n      \n</ul>\n      <p>Except in cases where another Contributor has failed to comply with Section 3.4, You are responsible for\n         damages arising, directly or indirectly, out of Your utilization of rights under this License, based\n         on the number of copies of Covered Code you made available, the revenues you received from utilizing\n         such rights, and other relevant factors. You agree to work with affected parties to distribute with\n         Initial Developer responsibility on an equitable basis.</p>\n\n      <div class=\"optional-license-text\"> \n         <p>EXHIBIT A.</p>\n\n         <p>Text for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file\n         provided by the Initial Developer. This license is not valid or complete with out that file.</p>\n\n         <p>EXHIBIT B.</p>\n\n         <p>Text for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file\n         provided by the Initial Developer. This license is not valid or complete with out that file.</p>\n\n      </div>\n    ","tag":"LicenseText"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"tag":"LicenseUrl"},{"contents":[null,"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"tag":"LicenseUrl"},{"contents":[null,"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"tag":"LicenseUrl"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"tag":"LicenseUrl"}],"raw":{"crossRef":[{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":1,"timestamp":"2024-04-17T05:08:33Z","url":"https://fedoraproject.org/wiki/Licensing/Open_Public_License"},{"isLive":true,"isValid":true,"isWayBackLink":false,"match":"false","order":0,"timestamp":"2024-04-17T05:08:33Z","url":"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"}],"isDeprecatedLicenseId":false,"isFsfLibre":false,"isOsiApproved":false,"licenseComments":null,"licenseId":"spdx:OPL-1.0","licenseText":"OPEN PUBLIC LICENSE\nVersion 1.0\n\n1. Definitions.\n\n     1.1. \"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n\n     1.2. \"Contributor Version\" means the combination of the Original Code, prior Modifications used by a Contributor, and the Modifications made by that particular Contributor.\n\n     1.3. \"Covered Code\" means the Original Code or Modifications or the combination of the Original Code and Modifications, in each case including portions thereof.\n\n     1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software development community for the electronic transfer of data.\n\n     1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n     1.6. \"Initial Developer\" means the individual or entity identified as the Initial Developer in the Source Code notice required by Exhibit A.\n\n     1.7. \"Larger Work\" means a work, which combines Covered Code or portions thereof with code not governed by the terms of this License.\n\n     1.8. \"License\" means this document and the corresponding addendum described in section 6.4 below.\n\n     1.9. \"Modifications\" means any addition to or deletion from the substance or structure of either the Original Code or any previous Modifications. When Covered Code is released as a series of files, a Modification is:\n\n          A. Any addition to or deletion from the contents of a file containing Original Code or previous Modifications.\n\n          B. Any new file that contains any part of the Original Code or previous Modifications.\n\n     1.10. \"Original Code\" means Source Code of computer software code which is described in the Source Code notice required by Exhibit A as Original Code, and which, at the time of its release under this License is not already Covered Code governed by this License.\n\n     1.11. \"Source Code\" means the preferred form of the Covered Code for making modifications to it, including all modules it contains, plus any associated interface definition files, scripts used to control compilation and installation of an Executable, or a list of source code differential comparisons against either the Original Code or another well known, available Covered Code of the Contributor's choice. The Source Code can be in a compressed or archival form, provided the appropriate decompression or de-archiving software is widely available for no charge.\n\n     1.12. \"You\" means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License or a future version of this License issued under Section 6.1. For legal entities, \"You'' includes any entity which controls, is controlled by, or is under common control with You. For purposes of this definition, \"control'' means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of such entity.\n\n     1.13 \"License Author\" means Lutris Technologies, Inc.\n\n2. Source Code License.\n\n     2.1. The Initial Developer Grant. The Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n          (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Original Code (or portions thereof) with or without Modifications, or as part of a Larger Work; and\n\n          (b) under patents now or hereafter owned or controlled by Initial Developer, to make, have made, use and sell (``offer to sell and import'') the Original Code (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Original Code (or portions thereof) and not to any greater extent that may be necessary to Utilize further Modifications or combinations.\n\n     2.2. Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n          (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Modifications created by such Contributor (or portions thereof) either on an unmodified basis, with other Modifications, as Covered Code or as part of a Larger Work; and\n\n          (b) under patents now or hereafter owned or controlled by Contributor, to to make, have made, use and sell (``offer to sell and import'') the Contributor Version (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Contributor Version (or portions thereof), and not to any greater extent that may be necessary to Utilize further Modifications or combinations\n\n3. Distribution Obligations.\n\n     3.1. Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1, and You must include a copy of this License with every copy of the Source Code You distribute. You may not offer or impose any terms on any Source Code version that alters or restricts the applicable version of this License or the recipients' rights hereunder. However, You may include an additional document offering the additional rights described in Section 3.5.\n\n     3.2. Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients. You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available.\n\n     3.3. Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change. You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an Executable version or related documentation in which You describe the origin or ownership of the Covered Code.\n\n     3.4. Intellectual Property Matters\n\n          (a) Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained.\n\n          (b) Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a) above, Contributor believes that Contributor's Modifications are Contributor's original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this License.\n\n     3.5. Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice. You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone, and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer.\n\n     3.6. Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code. You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License. If You distribute the Executable version under a different license You must make it absolutely clear that any terms which differ from this License are offered by You alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of any such terms You offer. If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product.\n\n     3.7. Larger Works. You may create a Larger Work by combining Covered Code with other code not governed by the terms of this License and distribute the Larger Work as a single product. In such a case, You must make sure the requirements of this License are fulfilled for the Covered Code.\n\n4. Inability to Comply Due to Statute or Regulation.\n\nIf it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n5. Application of this License.\n\nThis License applies to code to which the Initial Developer has attached the notice in Exhibit A, and to related Covered Code.\n\n6. Versions of the License.\n\n     6.1. New Versions. License Author may publish revised and/or new versions of the License from time to time. Each version will be given a distinguishing version number and shall be submitted to opensource.org for certification.\n\n     6.2. Effect of New Versions. Once Covered Code has been published under a particular version of the License, You may always continue to use it under the terms of that version. You may also choose to use such Covered Code under the terms of any subsequent version of the License published by Initial Developer. No one other than Initial Developer has the right to modify the terms applicable to Covered Code created under this License.\n\n     6.3. Derivative Works. If you create or use a modified version of this License, except in association with the required Developer Specific License described in section 6.4, (which you may only do in order to apply it to code which is not already Covered Code governed by this License), you must (a) rename Your license so that the phrases ``Open'', ``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear anywhere in your license and (b) otherwise make it clear that your version of the license contains terms which differ from the Open Public License. (Filling in the name of the Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall not of themselves be deemed to be modifications of this License.)\n\n     6.4. Required Additional Developer Specific License\nThis license is a union of the following two parts that should be found as text files in the same place (directory), in the order of preeminence:\n\n          [1] A Developer specific license.\n\n          [2] The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n\nIn case of conflicting dispositions in the parts of this license, the terms of the lower-numbered part will always be superseded by the terms of the higher numbered part.\n\n7. DISCLAIMER OF WARRANTY.\n\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n8. TERMINATION.\n\n     8.1 Termination upon Breach\nThis License and the rights granted hereunder will terminate automatically if You fail to comply with terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses to the Covered Code, which are properly granted, shall survive any termination of this License. Provisions that, by their nature, must remain in effect beyond the termination of this License shall survive.\n\n     8.2. Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\n\n          (a) such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\n\n          (b) any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant.\n\n     8.3. If You assert a patent infringement claim against Participant alleging that such Participant's Contributor Version directly or indirectly infringes any patent where such claim is resolved (such as by license or settlement) prior to the initiation of patent infringement litigation, then the reasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of any payment or license.\n\n     8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or any distributor hereunder prior to termination shall survive termination.\n\n9. LIMITATION OF LIABILITY.\n\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n10. U.S. GOVERNMENT END USERS.\n\nThe Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of ``commercial computer software'' and ``commercial computer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only those rights set forth herein.\n\n11. MISCELLANEOUS.\n\n his section was intentionally left blank. The contents of this section are found in the corresponding addendum described above.\n\n12. RESPONSIBILITY FOR CLAIMS.\n\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for damages arising, directly or indirectly, out of Your utilization of rights under this License, based on the number of copies of Covered Code you made available, the revenues you received from utilizing such rights, and other relevant factors. You agree to work with affected parties to distribute with Initial Developer responsibility on an equitable basis.\n\nEXHIBIT A.\n\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\nEXHIBIT B.\n\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n","licenseTextHtml":"\n      <div class=\"optional-license-text\"> \n         <p>OPEN PUBLIC LICENSE\n        <br />\n\nVersion 1.0\n      </p>\n\n      </div>\n\n<ul style=\"list-style:none\">\n        \n<li>\n            <var class=\"replaceable-license-text\"> 1.</var>\n          Definitions.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.1.</var>\n            &quot;Contributor&quot; means each entity that creates or contributes to the creation of\n               Modifications.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.2.</var>\n            &quot;Contributor Version&quot; means the combination of the Original Code, prior\n               Modifications used by a Contributor, and the Modifications made by that particular\n               Contributor.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.3.</var>\n            &quot;Covered Code&quot; means the Original Code or Modifications or the combination of the\n               Original Code and Modifications, in each case including portions thereof.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.4.</var>\n            &quot;Electronic Distribution Mechanism&quot; means a mechanism generally accepted in the\n               software development community for the electronic transfer of data.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.5.</var>\n            &quot;Executable&quot; means Covered Code in any form other than Source Code.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.6.</var>\n            &quot;Initial Developer&quot; means the individual or entity identified as the Initial\n               Developer in the Source Code notice required by Exhibit A.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.7.</var>\n            &quot;Larger Work&quot; means a work, which combines Covered Code or portions thereof with\n               code not governed by the terms of this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.8.</var>\n            &quot;License&quot; means this document and the corresponding addendum described in section\n               6.4 below.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.9.</var>\n            &quot;Modifications&quot; means any addition to or deletion from the substance or structure\n               of either the Original Code or any previous Modifications. When Covered Code is released\n               as a series of files, a Modification is:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> A.</var>\n              Any addition to or deletion from the contents of a file containing Original Code or\n                 previous Modifications.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> B.</var>\n              Any new file that contains any part of the Original Code or previous Modifications.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.10.</var>\n            &quot;Original Code&quot; means Source Code of computer software code which is described in\n               the Source Code notice required by Exhibit A as Original Code, and which, at the time of\n               its release under this License is not already Covered Code governed by this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.11.</var>\n            &quot;Source Code&quot; means the preferred form of the Covered Code for making modifications\n               to it, including all modules it contains, plus any associated interface definition files,\n               scripts used to control compilation and installation of an Executable, or a list of source\n               code differential comparisons against either the Original Code or another well known,\n               available Covered Code of the Contributor&apos;s choice. The Source Code can be in a\n               compressed or archival form, provided the appropriate decompression or de-archiving\n               software is widely available for no charge.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.12.</var>\n            &quot;You&quot; means an individual or a legal entity exercising rights under, and complying\n               with all of the terms of, this License or a future version of this License issued under\n               Section 6.1. For legal entities, &quot;You&apos;&apos; includes any entity which controls,\n               is controlled by, or is under common control with You. For purposes of this definition,\n               &quot;control&apos;&apos; means (a) the power, direct or indirect, to cause the direction\n               or management of such entity, whether by contract or otherwise, or (b) ownership of fifty\n               percent (50%) or more of the outstanding shares or beneficial ownership of such\n               entity.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 1.13</var>\n            &quot;License Author&quot; means Lutris Technologies, Inc.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 2.</var>\n          Source Code License.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 2.1.</var>\n            The Initial Developer Grant. The Initial Developer hereby grants You a worldwide,\n               royalty-free, non-exclusive license, subject to third party intellectual property\n               claims:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              under intellectual property rights (other than patent or trademark) to use, reproduce,\n                 modify, display, perform, sublicense and distribute the Original Code (or portions\n                 thereof) with or without Modifications, or as part of a Larger Work; and\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              under patents now or hereafter owned or controlled by Initial Developer, to make, have\n                 made, use and sell (``offer to sell and import&apos;&apos;) the Original Code (or\n                 portions thereof), but solely to the extent that any such patent is reasonably\n                 necessary to enable You to Utilize the Original Code (or portions thereof) and not to\n                 any greater extent that may be necessary to Utilize further Modifications or\n                 combinations.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 2.2.</var>\n            Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free,\n               non-exclusive license, subject to third party intellectual property claims:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              under intellectual property rights (other than patent or trademark) to use, reproduce,\n                 modify, display, perform, sublicense and distribute the Modifications created by such\n                 Contributor (or portions thereof) either on an unmodified basis, with other\n                 Modifications, as Covered Code or as part of a Larger Work; and\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              under patents now or hereafter owned or controlled by Contributor, to to make, have made,\n                 use and sell (``offer to sell and import&apos;&apos;) the Contributor Version (or\n                 portions thereof), but solely to the extent that any such patent is reasonably\n                 necessary to enable You to Utilize the Contributor Version (or portions thereof), and\n                 not to any greater extent that may be necessary to Utilize further Modifications or\n                 combinations\n            </li>\n                  \n</ul>\n               </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 3.</var>\n          Distribution Obligations.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.1.</var>\n            Application of License. The Modifications which You create or to which You contribute are\n               governed by the terms of this License, including without limitation Section 2.2. The\n               Source Code version of Covered Code may be distributed only under the terms of this\n               License or a future version of this License released under Section 6.1, and You must\n               include a copy of this License with every copy of the Source Code You distribute. You may\n               not offer or impose any terms on any Source Code version that alters or restricts the\n               applicable version of this License or the recipients&apos; rights hereunder. However, You\n               may include an additional document offering the additional rights described in Section\n               3.5.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.2.</var>\n            Availability of Source Code. Any Modification which You create or to which You contribute\n               must be made available, prior to any use, except for internal development and practice, in\n               Source Code form under the terms of this License either on the same media as an Executable\n               version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an\n               Executable version available; and if made available via Electronic Distribution Mechanism,\n               must remain available for at least twelve (12) months after the date it initially became\n               available, or at least six (6) months after a subsequent version of that particular\n               Modification has been made available to such recipients. You shall notify the Initial\n               Developer of the Modification and the location of the Source Code via the contact means\n               provided for in the Developer Specific license. Initial Developer will be acting as\n               maintainer of the Source Code and may provide an Electronic Distribution mechanism for the\n               Modification to be made available.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.3.</var>\n            Description of Modifications. You must cause all Covered Code to which you contribute to\n               contain a file documenting the changes You made to create that Covered Code and the date\n               of any change. You must include a prominent statement that the Modification is derived,\n               directly or indirectly, from Original Code provided by the Initial Developer and including\n               the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an\n               Executable version or related documentation in which You describe the origin or ownership\n               of the Covered Code.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.4.</var>\n            Intellectual Property Matters\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              Third Party Claims. If You have knowledge that a party claims an intellectual property\n                 right in particular functionality or code (or its utilization under this License), you\n                 must include a text file with the source code distribution titled &quot;LEGAL&quot;\n                 which describes the claim and the party making the claim in sufficient detail that a\n                 recipient will know whom to contact. If you obtain such knowledge after You make Your\n                 Modification available as described in Section 3.2, You shall promptly modify the\n                 LEGAL file in all copies You make available thereafter and shall take other steps\n                 (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to\n                 inform those who received the Covered Code that new knowledge has been obtained.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              Representations. Contributor represents that, except as disclosed pursuant to Section\n                 3.4(a) above, Contributor believes that Contributor&apos;s Modifications are\n                 Contributor&apos;s original creation(s) and/or Contributor has sufficient rights to\n                 grant the rights conveyed by this License.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.5.</var>\n            Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code,\n               and this License in any documentation for the Source Code, where You describe\n               recipients&apos; rights relating to Covered Code. If You created one or more\n               Modification(s), You may add your name as a Contributor to the notice described in Exhibit\n               A. If it is not possible to put such notice in a particular Source Code file due to its\n               structure, then you must include such notice in a location (such as a relevant directory\n               file) where a user would be likely to look for such a notice. You may choose to offer, and\n               to charge a fee for, warranty, support, indemnity or liability obligations to one or more\n               recipients of Covered Code. However, You may do so only on Your own behalf, and not on\n               behalf of the Initial Developer or any Contributor. You must make it absolutely clear that\n               any such warranty, support, indemnity or liability obligation is offered by You alone, and\n               You hereby agree to indemnify the Initial Developer and every Contributor for any\n               liability incurred by the Initial Developer or such Contributor as a result of warranty,\n               support, indemnity or liability terms You offer.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.6.</var>\n            Distribution of Executable Versions. You may distribute Covered Code in Executable form only\n               if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You\n               include a notice stating that the Source Code version of the Covered Code is available\n               under the terms of this License, including a description of how and where You have\n               fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any\n               notice in an Executable version, related documentation or collateral in which You describe\n               recipients&apos; rights relating to the Covered Code. You may distribute the Executable\n               version of Covered Code under a license of Your choice, which may contain terms different\n               from this License, provided that You are in compliance with the terms of this License and\n               that the license for the Executable version does not attempt to limit or alter the\n               recipient&apos;s rights in the Source Code version from the rights set forth in this\n               License. If You distribute the Executable version under a different license You must make\n               it absolutely clear that any terms which differ from this License are offered by You\n               alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the\n               Initial Developer and every Contributor for any liability incurred by the Initial\n               Developer or such Contributor as a result of any such terms You offer. If you distribute\n               executable versions containing Covered Code, you must reproduce the notice in Exhibit B in\n               the documentation and/or other materials provided with the product.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 3.7.</var>\n            Larger Works. You may create a Larger Work by combining Covered Code with other code not\n               governed by the terms of this License and distribute the Larger Work as a single product.\n               In such a case, You must make sure the requirements of this License are fulfilled for the\n               Covered Code.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 4.</var>\n          Inability to Comply Due to Statute or Regulation.\n          <p>If it is impossible for You to comply with any of the terms of this License with respect to some\n             or all of the Covered Code due to statute or regulation then You must: (a) comply with the\n             terms of this License to the maximum extent possible; and (b) Cite all of the statutes or\n             regulations that prohibit you from complying fully with this license. (c) describe the\n             limitations and the code they affect. Such description must be included in the LEGAL file\n             described in Section 3.4 and must be included with all distributions of the Source Code.\n             Except to the extent prohibited by statute or regulation, such description must be\n             sufficiently detailed for a recipient of ordinary skill to be able to understand it.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 5.</var>\n          Application of this License.\n          <p>This License applies to code to which the Initial Developer has attached the notice in Exhibit A,\n             and to related Covered Code.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 6.</var>\n          Versions of the License.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.1.</var>\n            New Versions. License Author may publish revised and/or new versions of the License from time\n               to time. Each version will be given a distinguishing version number and shall be submitted\n               to opensource.org for certification.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.2.</var>\n            Effect of New Versions. Once Covered Code has been published under a particular version of\n               the License, You may always continue to use it under the terms of that version. You may\n               also choose to use such Covered Code under the terms of any subsequent version of the\n               License published by Initial Developer. No one other than Initial Developer has the right\n               to modify the terms applicable to Covered Code created under this License.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.3.</var>\n            Derivative Works. If you create or use a modified version of this License, except in\n               association with the required Developer Specific License described in section 6.4, (which\n               you may only do in order to apply it to code which is not already Covered Code governed by\n               this License), you must (a) rename Your license so that the phrases ``Open&apos;&apos;,\n               ``OpenPL&apos;&apos;, ``OPL&apos;&apos; or any confusingly similar phrase do not appear\n               anywhere in your license and (b) otherwise make it clear that your version of the license\n               contains terms which differ from the Open Public License. (Filling in the name of the\n               Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall\n               not of themselves be deemed to be modifications of this License.)\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 6.4.</var>\n            Required Additional Developer Specific License\n              <br />\n\n      This license is a union of the following two parts that should be found as text files\n                   in the same place (directory), in the order of preeminence:\n\n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> [1]</var>\n              A Developer specific license.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> [2]</var>\n              The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n            </li>\n                  \n</ul>\n                  <p>In case of conflicting dispositions in the parts of this license, the terms of the\n                 lower-numbered part will always be superseded by the terms of the higher numbered\n                 part.</p>\n\n               </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 7.</var>\n          DISCLAIMER OF WARRANTY.\n          <p>COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN &quot;AS IS&quot; BASIS, WITHOUT WARRANTY OF\n             ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\n             COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING.\n             THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY\n             COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER\n             CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER\n             OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS\n             AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 8.</var>\n          TERMINATION.\n        \n<ul style=\"list-style:none\">\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.1</var>\n            Termination upon Breach\n              <br />\n\n      This License and the rights granted hereunder will terminate automatically if You fail\n                   to comply with terms herein and fail to cure such breach within 30 days of\n                   becoming aware of the breach. All sublicenses to the Covered Code, which are\n                   properly granted, shall survive any termination of this License. Provisions that,\n                   by their nature, must remain in effect beyond the termination of this License\n                   shall survive.\n\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.2.</var>\n            Termination Upon Litigation. If You initiate litigation by asserting a patent infringement\n               claim (excluding declatory judgment actions) against Initial Developer or a Contributor\n               (the Initial Developer or Contributor against whom You file such action is referred to as\n               &quot;Participant&quot;) alleging that:\n          \n<ul style=\"list-style:none\">\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (a)</var>\n              such Participant&apos;s Contributor Version directly or indirectly infringes any patent,\n                 then any and all rights granted by such Participant to You under Sections 2.1 and/or\n                 2.2 of this License shall, upon 60 days notice from Participant terminate\n                 prospectively, unless if within 60 days after receipt of notice You either: (i) agree\n                 in writing to pay Participant a mutually agreeable reasonable royalty for Your past\n                 and future use of Modifications made by such Participant, or (ii) withdraw Your\n                 litigation claim with respect to the Contributor Version against such Participant. If\n                 within 60 days of notice, a reasonable royalty and payment arrangement are not\n                 mutually agreed upon in writing by the parties or the litigation claim is not\n                 withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2\n                 automatically terminate at the expiration of the 60 day notice period specified\n                 above.\n            </li>\n                     \n<li>\n                        <var class=\"replaceable-license-text\"> (b)</var>\n              any software, hardware, or device, other than such Participant&apos;s Contributor\n                 Version, directly or indirectly infringes any patent, then any rights granted to You\n                 by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the\n                 date You first made, used, sold, distributed, or had made, Modifications made by that\n                 Participant.\n            </li>\n                  \n</ul>\n               </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.3.</var>\n            If You assert a patent infringement claim against Participant alleging that such\n               Participant&apos;s Contributor Version directly or indirectly infringes any patent where\n               such claim is resolved (such as by license or settlement) prior to the initiation of\n               patent infringement litigation, then the reasonable value of the licenses granted by such\n               Participant under Sections 2.1 or 2.2 shall be taken into account in determining the\n               amount or value of any payment or license.\n          </li>\n               \n<li>\n                  <var class=\"replaceable-license-text\"> 8.4.</var>\n            In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n               (excluding distributors and resellers) which have been validly granted by You or any\n               distributor hereunder prior to termination shall survive termination.\n          </li>\n            \n</ul>\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 9.</var>\n          LIMITATION OF LIABILITY.\n          <p>UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT,\n             OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\n             COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR\n             ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING,\n             WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR\n             MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE\n             BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY\n             TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY&apos;S NEGLIGENCE TO THE\n             EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\n             OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT\n             APPLY TO YOU.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 10.</var>\n          U.S. GOVERNMENT END USERS.\n          <p>The Covered Code is a ``commercial item,&apos;&apos; as that term is defined in 48 C.F.R. 2.101\n             (Oct. 1995), consisting of ``commercial computer software&apos;&apos; and ``commercial\n             computer software documentation,&apos;&apos; as such terms are used in 48 C.F.R. 12.212 (Sept.\n             1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June\n             1995), all U.S. Government End Users acquire Covered Code with only those rights set forth\n             herein.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 11.</var>\n          MISCELLANEOUS.\n          <p>his section was intentionally left blank. The contents of this section are found in the\n             corresponding addendum described above.</p>\n\n        </li>\n        \n<li>\n            <var class=\"replaceable-license-text\"> 12.</var>\n          RESPONSIBILITY FOR CLAIMS.\n        </li>\n      \n</ul>\n      <p>Except in cases where another Contributor has failed to comply with Section 3.4, You are responsible for\n         damages arising, directly or indirectly, out of Your utilization of rights under this License, based\n         on the number of copies of Covered Code you made available, the revenues you received from utilizing\n         such rights, and other relevant factors. You agree to work with affected parties to distribute with\n         Initial Developer responsibility on an equitable basis.</p>\n\n      <div class=\"optional-license-text\"> \n         <p>EXHIBIT A.</p>\n\n         <p>Text for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file\n         provided by the Initial Developer. This license is not valid or complete with out that file.</p>\n\n         <p>EXHIBIT B.</p>\n\n         <p>Text for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file\n         provided by the Initial Developer. This license is not valid or complete with out that file.</p>\n\n      </div>\n    ","name":"Open Public License v1.0","seeAlso":["http://old.koalateam.com/jackaroo/OPL_1_0.TXT","https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"standardLicenseTemplate":"<<beginOptional>>OPEN PUBLIC LICENSE\n\nVersion 1.0\n\n<<endOptional>>\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Definitions.\n\n      <<var;name=\"bullet\";original=\"1.1.\";match=\".{0,20}\">> \"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n\n      <<var;name=\"bullet\";original=\"1.2.\";match=\".{0,20}\">> \"Contributor Version\" means the combination of the Original Code, prior Modifications used by a Contributor, and the Modifications made by that particular Contributor.\n\n      <<var;name=\"bullet\";original=\"1.3.\";match=\".{0,20}\">> \"Covered Code\" means the Original Code or Modifications or the combination of the Original Code and Modifications, in each case including portions thereof.\n\n      <<var;name=\"bullet\";original=\"1.4.\";match=\".{0,20}\">> \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software development community for the electronic transfer of data.\n\n      <<var;name=\"bullet\";original=\"1.5.\";match=\".{0,20}\">> \"Executable\" means Covered Code in any form other than Source Code.\n\n      <<var;name=\"bullet\";original=\"1.6.\";match=\".{0,20}\">> \"Initial Developer\" means the individual or entity identified as the Initial Developer in the Source Code notice required by Exhibit A.\n\n      <<var;name=\"bullet\";original=\"1.7.\";match=\".{0,20}\">> \"Larger Work\" means a work, which combines Covered Code or portions thereof with code not governed by the terms of this License.\n\n      <<var;name=\"bullet\";original=\"1.8.\";match=\".{0,20}\">> \"License\" means this document and the corresponding addendum described in section 6.4 below.\n\n      <<var;name=\"bullet\";original=\"1.9.\";match=\".{0,20}\">> \"Modifications\" means any addition to or deletion from the substance or structure of either the Original Code or any previous Modifications. When Covered Code is released as a series of files, a Modification is:\n\n         <<var;name=\"bullet\";original=\"A.\";match=\".{0,20}\">> Any addition to or deletion from the contents of a file containing Original Code or previous Modifications.\n\n         <<var;name=\"bullet\";original=\"B.\";match=\".{0,20}\">> Any new file that contains any part of the Original Code or previous Modifications.\n\n      <<var;name=\"bullet\";original=\"1.10.\";match=\".{0,20}\">> \"Original Code\" means Source Code of computer software code which is described in the Source Code notice required by Exhibit A as Original Code, and which, at the time of its release under this License is not already Covered Code governed by this License.\n\n      <<var;name=\"bullet\";original=\"1.11.\";match=\".{0,20}\">> \"Source Code\" means the preferred form of the Covered Code for making modifications to it, including all modules it contains, plus any associated interface definition files, scripts used to control compilation and installation of an Executable, or a list of source code differential comparisons against either the Original Code or another well known, available Covered Code of the Contributor's choice. The Source Code can be in a compressed or archival form, provided the appropriate decompression or de-archiving software is widely available for no charge.\n\n      <<var;name=\"bullet\";original=\"1.12.\";match=\".{0,20}\">> \"You\" means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License or a future version of this License issued under Section 6.1. For legal entities, \"You'' includes any entity which controls, is controlled by, or is under common control with You. For purposes of this definition, \"control'' means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of such entity.\n\n      <<var;name=\"bullet\";original=\"1.13\";match=\".{0,20}\">> \"License Author\" means Lutris Technologies, Inc.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Source Code License.\n\n      <<var;name=\"bullet\";original=\"2.1.\";match=\".{0,20}\">> The Initial Developer Grant. The Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         <<var;name=\"bullet\";original=\"(a)\";match=\".{0,20}\">> under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Original Code (or portions thereof) with or without Modifications, or as part of a Larger Work; and\n\n         <<var;name=\"bullet\";original=\"(b)\";match=\".{0,20}\">> under patents now or hereafter owned or controlled by Initial Developer, to make, have made, use and sell (``offer to sell and import'') the Original Code (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Original Code (or portions thereof) and not to any greater extent that may be necessary to Utilize further Modifications or combinations.\n\n      <<var;name=\"bullet\";original=\"2.2.\";match=\".{0,20}\">> Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         <<var;name=\"bullet\";original=\"(a)\";match=\".{0,20}\">> under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Modifications created by such Contributor (or portions thereof) either on an unmodified basis, with other Modifications, as Covered Code or as part of a Larger Work; and\n\n         <<var;name=\"bullet\";original=\"(b)\";match=\".{0,20}\">> under patents now or hereafter owned or controlled by Contributor, to to make, have made, use and sell (``offer to sell and import'') the Contributor Version (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Contributor Version (or portions thereof), and not to any greater extent that may be necessary to Utilize further Modifications or combinations\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Distribution Obligations.\n\n      <<var;name=\"bullet\";original=\"3.1.\";match=\".{0,20}\">> Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1, and You must include a copy of this License with every copy of the Source Code You distribute. You may not offer or impose any terms on any Source Code version that alters or restricts the applicable version of this License or the recipients' rights hereunder. However, You may include an additional document offering the additional rights described in Section 3.5.\n\n      <<var;name=\"bullet\";original=\"3.2.\";match=\".{0,20}\">> Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients. You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available.\n\n      <<var;name=\"bullet\";original=\"3.3.\";match=\".{0,20}\">> Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change. You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an Executable version or related documentation in which You describe the origin or ownership of the Covered Code.\n\n      <<var;name=\"bullet\";original=\"3.4.\";match=\".{0,20}\">> Intellectual Property Matters\n\n         <<var;name=\"bullet\";original=\"(a)\";match=\".{0,20}\">> Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained.\n\n         <<var;name=\"bullet\";original=\"(b)\";match=\".{0,20}\">> Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a) above, Contributor believes that Contributor's Modifications are Contributor's original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this License.\n\n      <<var;name=\"bullet\";original=\"3.5.\";match=\".{0,20}\">> Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice. You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone, and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer.\n\n      <<var;name=\"bullet\";original=\"3.6.\";match=\".{0,20}\">> Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code. You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License. If You distribute the Executable version under a different license You must make it absolutely clear that any terms which differ from this License are offered by You alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of any such terms You offer. If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product.\n\n      <<var;name=\"bullet\";original=\"3.7.\";match=\".{0,20}\">> Larger Works. You may create a Larger Work by combining Covered Code with other code not governed by the terms of this License and distribute the Larger Work as a single product. In such a case, You must make sure the requirements of this License are fulfilled for the Covered Code.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Inability to Comply Due to Statute or Regulation.\n\n   If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> Application of this License.\n\n   This License applies to code to which the Initial Developer has attached the notice in Exhibit A, and to related Covered Code.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> Versions of the License.\n\n      <<var;name=\"bullet\";original=\"6.1.\";match=\".{0,20}\">> New Versions. License Author may publish revised and/or new versions of the License from time to time. Each version will be given a distinguishing version number and shall be submitted to opensource.org for certification.\n\n      <<var;name=\"bullet\";original=\"6.2.\";match=\".{0,20}\">> Effect of New Versions. Once Covered Code has been published under a particular version of the License, You may always continue to use it under the terms of that version. You may also choose to use such Covered Code under the terms of any subsequent version of the License published by Initial Developer. No one other than Initial Developer has the right to modify the terms applicable to Covered Code created under this License.\n\n      <<var;name=\"bullet\";original=\"6.3.\";match=\".{0,20}\">> Derivative Works. If you create or use a modified version of this License, except in association with the required Developer Specific License described in section 6.4, (which you may only do in order to apply it to code which is not already Covered Code governed by this License), you must (a) rename Your license so that the phrases ``Open'', ``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear anywhere in your license and (b) otherwise make it clear that your version of the license contains terms which differ from the Open Public License. (Filling in the name of the Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall not of themselves be deemed to be modifications of this License.)\n\n      <<var;name=\"bullet\";original=\"6.4.\";match=\".{0,20}\">> Required Additional Developer Specific License\n\n      This license is a union of the following two parts that should be found as text files in the same place (directory), in the order of preeminence:\n\n         <<var;name=\"bullet\";original=\"[1]\";match=\".{0,20}\">> A Developer specific license.\n\n         <<var;name=\"bullet\";original=\"[2]\";match=\".{0,20}\">> The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n\n      In case of conflicting dispositions in the parts of this license, the terms of the lower-numbered part will always be superseded by the terms of the higher numbered part.\n\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> DISCLAIMER OF WARRANTY.\n\n   COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n   <<var;name=\"bullet\";original=\"8.\";match=\".{0,20}\">> TERMINATION.\n\n      <<var;name=\"bullet\";original=\"8.1\";match=\".{0,20}\">> Termination upon Breach\n\n      This License and the rights granted hereunder will terminate automatically if You fail to comply with terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses to the Covered Code, which are properly granted, shall survive any termination of this License. Provisions that, by their nature, must remain in effect beyond the termination of this License shall survive.\n\n      <<var;name=\"bullet\";original=\"8.2.\";match=\".{0,20}\">> Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\n\n         <<var;name=\"bullet\";original=\"(a)\";match=\".{0,20}\">> such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\n\n         <<var;name=\"bullet\";original=\"(b)\";match=\".{0,20}\">> any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant.\n\n      <<var;name=\"bullet\";original=\"8.3.\";match=\".{0,20}\">> If You assert a patent infringement claim against Participant alleging that such Participant's Contributor Version directly or indirectly infringes any patent where such claim is resolved (such as by license or settlement) prior to the initiation of patent infringement litigation, then the reasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of any payment or license.\n\n      <<var;name=\"bullet\";original=\"8.4.\";match=\".{0,20}\">> In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or any distributor hereunder prior to termination shall survive termination.\n\n   <<var;name=\"bullet\";original=\"9.\";match=\".{0,20}\">> LIMITATION OF LIABILITY.\n\n   UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n   <<var;name=\"bullet\";original=\"10.\";match=\".{0,20}\">> U.S. GOVERNMENT END USERS.\n\n   The Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of ``commercial computer software'' and ``commercial computer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only those rights set forth herein.\n\n   <<var;name=\"bullet\";original=\"11.\";match=\".{0,20}\">> MISCELLANEOUS.\n\n   his section was intentionally left blank. The contents of this section are found in the corresponding addendum described above.\n\n   <<var;name=\"bullet\";original=\"12.\";match=\".{0,20}\">> RESPONSIBILITY FOR CLAIMS.\n\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for damages arising, directly or indirectly, out of Your utilization of rights under this License, based on the number of copies of Covered Code you made available, the revenues you received from utilizing such rights, and other relevant factors. You agree to work with affected parties to distribute with Initial Developer responsibility on an equitable basis.\n\n<<beginOptional>>EXHIBIT A.\n\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\nEXHIBIT B.\n\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\n<<endOptional>>"},"type":"SPDXLicense"},{"applicableLNs":{"contents":[{"contents":[{"contents":"Fedora:OPL-1.0","tag":"LN"},[{"contents":"spdx:OPL-1.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"Open Public License","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["FedoraEntry","014b9117d90a58b8d12550420093dcac"],"impliedStmts":[{"contents":[{"contents":"[\"not-allowed\"]","tag":"LicenseStatement"},[{"contents":{"contents":{"contents":["Fedora","not-allowed",{"contents":"Any license that does not meet the criteria above for allowed licenses (including allowed for a specific category) is not-allowed.","tag":"LicenseTagDescription"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"}]],"tag":"SubStatements"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"tag":"LicenseUrl"}],"raw":{"_fedora":{"_legacy_abbreviation":[],"_legacy_names":["Open Public License"],"_notes":null},"_id":"OPL-1.0","_license":{"_expression":"spdx:OPL-1.0","_scancode_key":null,"_status":["not-allowed"],"_text":null,"_urls":["https://fedoraproject.org/wiki/Licensing/Open_Public_License"]}},"type":"FedoraEntry"},{"applicableLNs":{"contents":[{"contents":"scancode:open-public","tag":"LN"},[{"contents":"Open Public License 1.0","tag":"LN"},{"contents":"Open Public License v1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","416ccfac3524461cd5351f784e388ee5"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://ksoap.objectweb.org/software/license/opl.html","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":[null,"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"tag":"LicenseUrl"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"tag":"LicenseUrl"},{"contents":"OPEN PUBLIC LICENSE\nVersion 1.0\n\n1. Definitions. \n1.1. \"Contributor\" means each entity that creates or contributes to the creation of \nModifications.\n\n1.2. \"Contributor Version\" means the combination of the Original Code, prior \nModifications used by a Contributor, and the Modifications made by that particular \nContributor.\n\n1.3. \"Covered Code\" means the Original Code or Modifications or the combination \nof the Original Code and Modifications, in each case including portions thereof.\n\n1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted \nin the software development community for the electronic transfer of data.\n\n1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n1.6. \"Initial Developer\" means the individual or entity identified as the Initial \nDeveloper in the Source Code notice required by Exhibit A.\n\n1.7. \"Larger Work\" means a work, which combines Covered Code or portions \nthereof with code not governed by the terms of this License.\n\n1.8. \"License\" means this document and the corresponding addendum describe in \nsection 6.4 below.\n\n1.9. \"Modifications\" means any addition to or deletion from the substance or \nstructure of either the Original Code or any previous Modifications. When Covered \nCode is released as a series of files, a Modification is:\n\nA. Any addition to or deletion from the contents of a file containing Original \nCode or previous Modifications.\nB. Any new file that contains any part of the Original Code or previous \nModifications.\n\n1.10. \"Original Code\" means Source Code of computer software code which is \ndescribed in the Source Code notice required by Exhibit A as Original Code, and \nwhich, at the time of its release under this License is not already Covered Code \ngoverned by this License.\n\n1.11. \"Source Code\" means the preferred form of the Covered Code for making \nmodifications to it, including all modules it contains, plus any associated interface \ndefinition files, scripts used to control compilation and installation of an Executable, \nor a list of source code differential comparisons against either the Original Code or \nanother well known, available Covered Code of the Contributor's choice. The Source \nCode can be in a compressed or archival form, provided the appropriate \ndecompression or de-archiving software is widely available for no charge.\n\n1.12. \"You\" means an individual or a legal entity exercising rights under, and \ncomplying with all of the terms of, this License or a future version of this License \nissued under Section 6.1. For legal entities, \"You\" includes any entity which controls, \nis controlled by, or is under common control with You. For purposes of this definition, \n\"control\" means (a) the power, direct or indirect, to cause the direction or \nmanagement of such entity, whether by contract or otherwise, or (b) ownership of \nfifty percent (50%) or more of the outstanding shares or beneficial ownership of such \nentity.\n\n1.13 \"License Author\" means Lutris Technologies, Inc.\n\n2. Source Code License.\n2.1. The Initial Developer Grant.\nThe Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive \nlicense, subject to third party intellectual property claims:\n(a) under intellectual property rights (other than patent or trademark) to use, \nreproduce, modify, display, perform, sublicense and distribute the Original \nCode (or portions thereof) with or without Modifications, or as part of a Larger \nWork; and\n(b) under patents now or hereafter owned or controlled by Initial Developer, \nto make, have made, use and sell (\"offer to sell and import\") the Original \nCode (or portions thereof), but solely to the extent that any such patent is \nreasonably necessary to enable You to Utilize the Original Code (or portions \nthereof) and not to any greater extent that may be necessary to Utilize further \nModifications or combinations.\n\n2.2. Contributor Grant.\nEach Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, \nsubject to third party intellectual property claims:\n\n(a) under intellectual property rights (other than patent or trademark) to use, \nreproduce, modify, display, perform, sublicense and distribute the \nModifications created by such Contributor (or portions thereof) either on an \nunmodified basis, with other Modifications, as Covered Code or as part of a \nLarger Work; and\n(b) under patents now or hereafter owned or controlled by Contributor, to to \nmake, have made, use and sell (\"offer to sell and import\") the Contributor \nVersion (or portions thereof), but solely to the extent that any such patent is \nreasonably necessary to enable You to Utilize the Contributor Version (or \nportions thereof), and not to any greater extent that may be necessary to \nUtilize further Modifications or combinations. \n\n3. Distribution Obligations. \n3.1. Application of License.\nThe Modifications which You create or to which You contribute are governed by the \nterms of this License, including without limitation Section 2.2. The Source Code \nversion of Covered Code may be distributed only under the terms of this License or a \nfuture version of this License released under Section 6.1, and You must include a \ncopy of this License with every copy of the Source Code You distribute. You may not \noffer or impose any terms on any Source Code version that alters or restricts the \napplicable version of this License or the recipients' rights hereunder. However, You \nmay include an additional document offering the additional rights described in \nSection 3.5.\n\n3.2. Availability of Source Code.\nAny Modification which You create or to which You contribute must be made \navailable, prior to any use, except for internal development and practice, in Source \nCode form under the terms of this License either on the same media as an \nExecutable version or via an accepted Electronic Distribution Mechanism to anyone \nto whom you made an Executable version available; and if made available via \nElectronic Distribution Mechanism, must remain available for at least twelve (12) \nmonths after the date it initially became available, or at least six (6) months after a \nsubsequent version of that particular Modification has been made available to such \nrecipients. You shall notify the Initial Developer of the Modification and the location of \nthe Source Code via the contact means provided for in the Developer Specific \nlicense. Initial Developer will be acting as maintainer of the Source Code and may \nprovide an Electronic Distribution mechanism for the Modification to be made \navailable.\n\n3.3. Description of Modifications.\nYou must cause all Covered Code to which you contribute to contain a file \ndocumenting the changes You made to create that Covered Code and the date of \nany change. You must include a prominent statement that the Modification is derived, \ndirectly or indirectly, from Original Code provided by the Initial Developer and \nincluding the name of the Initial Developer in (a) the Source Code, and (b) in any \nnotice in an Executable version or related documentation in which You describe the \norigin or ownership of the Covered Code.\n\n3.4. Intellectual Property Matters\n\n(a) Third Party Claims.\nIf You have knowledge that a party claims an intellectual property right in \nparticular functionality or code (or its utilization under this License), you must \ninclude a text file with the source code distribution titled \"LEGAL\" which \ndescribes the claim and the party making the claim in sufficient detail that a \nrecipient will know whom to contact. If you obtain such knowledge after You \nmake Your Modification available as described in Section 3.2, You shall \npromptly modify the LEGAL file in all copies You make available thereafter \nand shall take other steps (such as notifying appropriate mailing lists or \nnewsgroups) reasonably calculated to inform those who received the \nCovered Code that new knowledge has been obtained.\n(b) Representations. \nContributor represents that, except as disclosed pursuant to Section 3.4(a) \nabove, Contributor believes that Contributor's Modifications are Contributor's \noriginal creation(s) and/or Contributor has sufficient rights to grant the rights \nconveyed by this License.\n\n3.5. Required Notices.\nYou must duplicate the notice in Exhibit A in each file of the Source Code, and this \nLicense in any documentation for the Source Code, where You describe recipients' \nrights relating to Covered Code. If You created one or more Modification(s), You may \nadd your name as a Contributor to the notice described in Exhibit A. If it is not \npossible to put such notice in a particular Source Code file due to its structure, then \nyou must include such notice in a location (such as a relevant directory file) where a \nuser would be likely to look for such a notice. You may choose to offer, and to charge \na fee for, warranty, support, indemnity or liability obligations to one or more recipients \nof Covered Code. However, You may do so only on Your own behalf, and not on \nbehalf of the Initial Developer or any Contributor. You must make it absolutely clear \nthat any such warranty, support, indemnity or liability obligation is offered by You \nalone, and You hereby agree to indemnify the Initial Developer and every Contributor \nfor any liability incurred by the Initial Developer or such Contributor as a result of \nwarranty, support, indemnity or liability terms You offer.\n\n3.6. Distribution of Executable Versions.\nYou may distribute Covered Code in Executable form only if the requirements of \nSection 3.1-3.5 have been met for that Covered Code, and if You include a notice \nstating that the Source Code version of the Covered Code is available under the \nterms of this License, including a description of how and where You have fulfilled the \nobligations of Section 3.2. The notice must be conspicuously included in any notice \nin an Executable version, related documentation or collateral in which You describe \nrecipients' rights relating to the Covered Code. You may distribute the Executable \nversion of Covered Code under a license of Your choice, which may contain terms \ndifferent from this License, provided that You are in compliance with the terms of this \nLicense and that the license for the Executable version does not attempt to limit or \nalter the recipient's rights in the Source Code version from the rights set forth in this \nLicense. If You distribute the Executable version under a different license You must \nmake it absolutely clear that any terms which differ from this License are offered by \nYou alone, not by the Initial Developer or any Contributor. You hereby agree to \nindemnify the Initial Developer and every Contributor for any liability incurred by the \nInitial Developer or such Contributor as a result of any such terms You offer. If you \ndistribute executable versions containing Covered Code, you must reproduce the \nnotice in Exhibit B in the documentation and/or other materials provided with the \nproduct.\n\n3.7. Larger Works.\nYou may create a Larger Work by combining Covered Code with other code not \ngoverned by the terms of this License and distribute the Larger Work as a single \nproduct. In such a case, You must make sure the requirements of this License are \nfulfilled for the Covered Code. \n\n4. Inability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect \nto some or all of the Covered Code due to statute or regulation then You must: (a) \ncomply with the terms of this License to the maximum extent possible; and (b) Cite \nall of the statutes or regulations that prohibit you from complying fully with this \nlicense. (c) describe the limitations and the code they affect. Such description must \nbe included in the LEGAL file described in Section 3.4 and must be included with all \ndistributions of the Source Code. Except to the extent prohibited by statute or \nregulation, such description must be sufficiently detailed for a recipient of ordinary \nskill to be able to understand it. \n\n5. Application of this License.\nThis License applies to code to which the Initial Developer has attached the notice in \nExhibit A, and to related Covered Code.\n\n6. Versions of the License.\n6.1. New Versions.\nLicense Author may publish revised and/or new versions of the License from time to \ntime. Each version will be given a distinguishing version number and shall be \nsubmitted to opensource.org for certification.\n6.2. Effect of New Versions.\nOnce Covered Code has been published under a particular version of the License, \nYou may always continue to use it under the terms of that version. You may also \nchoose to use such Covered Code under the terms of any subsequent version of the \nLicense published by Initial Developer. No one other than Initial Developer has the \nright to modify the terms applicable to Covered Code created under this License.\n\n6.3. Derivative Works.\nIf you create or use a modified version of this License, except in association with the \nrequired Devloper Specific License described in section 6.4, (which you may only do \nin order to apply it to code which is not already Covered Code governed by this \nLicense), you must (a) rename Your license so that the phrases \"Open\", \"OpenPL\", \n\"OPL\" or any confusingly similar phrase do not appear anywhere in your license and \n(b) otherwise make it clear that your version of the license contains terms which differ \nfrom the Open Public License. (Filling in the name of the Initial Developer, Original \nCode or Contributor in the notice described in Exhibit A shall not of themselves be \ndeemed to be modifications of this License.)\n\n6.4. Required Additional Developer Specific License\nThis license is a union of the following two parts that should be found as text files in \nthe same place (directory), in the order of preeminence:\n\n[1] A Developer specific license.\n\n[2] The contents of this file OPL.html, stating the general licensing policy of \nthe software.\n\nIn case of conflicting dispositions in the parts of this license, the terms of the lower-\nnumbered part will always be superseded by the terms of the higher numbered part.\n\n7. DISCLAIMER OF WARRANTY. \nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, \nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, \nINCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE \nIS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE \nOR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND \nPERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY \nCOVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE \nINITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF \nANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER \nOF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO \nUSE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER \nTHIS DISCLAIMER. \n\n8. TERMINATION. \n8.1 Termination upon Breach\nThis License and the rights granted hereunder will terminate automatically if You fail \nto comply with terms herein and fail to cure such breach within 30 days of becoming \naware of the breach. All sublicenses to the Covered Code, which are properly \ngranted, shall survive any termination of this License. Provisions that, by their nature, \nmust remain in effect beyond the termination of this License shall survive. \n8.2. Termination Upon Litigation.\nIf You initiate litigation by asserting a patent \ninfringement claim (excluding declatory judgment actions) against Initial Developer or \na Contributor (the Initial Developer or Contributor against whom You file such action \nis referred to as \"Participant\") alleging that:\n\n(a) such Participant's Contributor Version directly or indirectly infringes any \npatent, then any and all rights granted by such Participant to You under \nSections 2.1 and/or 2.2 of this License shall, upon 60 days notice from \nParticipant terminate prospectively, unless if within 60 days after receipt of \nnotice You either: (i) agree in writing to pay Participant a mutually agreeable \nreasonable royalty for Your past and future use of Modifications made by \nsuch Participant, or (ii) withdraw Your litigation claim with respect to the \nContributor Version against such Participant. If within 60 days of notice, a \nreasonable royalty and payment arrangement are not mutually agreed upon \nin writing by the parties or the litigation claim is not withdrawn, the rights \ngranted by Participant to You under Sections 2.1 and/or 2.2 automatically \nterminate at the expiration of the 60 day notice period specified above.\n(b) any software, hardware, or device, other than such Participant's \nContributor Version, directly or indirectly infringes any patent, then any rights \ngranted to You by such Participant under Sections 2.1(b) and 2.2(b) are \nrevoked effective as of the date You first made, used, sold, distributed, or \nhad made, Modifications made by that Participant.\n\n8.3. If You assert a patent infringement claim against Participant alleging that such \nParticipant's Contributor Version directly or indirectly infringes any patent where such \nclaim is resolved (such as by license or settlement) prior to the initiation of patent \ninfringement litigation, then the reasonable value of the licenses granted by such \nParticipant under Sections 2.1 or 2.2 shall be taken into account in determining the \namount or value of any payment or license.\n\n8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license \nagreements (excluding distributors and resellers) which have been validly granted by \nYou or any distributor hereunder prior to termination shall survive termination.\n9. LIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER \nTORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE \nINITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF \nCOVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE \nTO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, \nOR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT \nLIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, \nCOMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER \nCOMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE \nBEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION \nOF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL \nINJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT \nAPPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO \nNOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR \nCONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY \nNOT APPLY TO YOU. \n10. U.S. GOVERNMENT END USERS. \nThe Covered Code is a \"commercial item,\" as that term is defined in 48 C.F.R. 2.101 \n(Oct. 1995), consisting of \"commercial computer software\" and \"commercial \ncomputer software documentation,\" as such terms are used in 48 C.F.R. 12.212 \n(Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through \n227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with \nonly those rights set forth herein. \n11. MISCELLANEOUS. \nThis section was intentionally left blank. The contents of this section are found in the \ncorresponding addendum described above.\n12. RESPONSIBILITY FOR CLAIMS. \nExcept in cases where another Contributor has failed to comply with Section 3.4, You \nare responsible for damages arising, directly or indirectly, out of Your utilization of \nrights under this License, based on the number of copies of Covered Code you made \navailable, the revenues you received from utilizing such rights, and other relevant \nfactors. You agree to work with affected parties to distribute with Initial Developer \nresponsibility on an equitable basis. \nExhibit A. \nText for this Exhibit A is found in the corresponding addendum, described in section \n6.4 above, text file provided by the Initial Developer. This license is not valid or \ncomplete with out that file. \nExhibit B. \nText for this Exhibit B is found in the corresponding addendum, described in section \n6.4 above, text file provided by the Initial Developer. This license is not valid or \ncomplete with out that file.","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://ksoap.objectweb.org/software/license/opl.html","_key":"open-public","_name":"Open Public License v1.0","_notes":null,"_osiUrl":null,"_otherUrls":["https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"_owner":"Lutris Technologies, Inc.","_shortName":"Open Public License 1.0","_spdxId":"OPL-1.0","_text":"OPEN PUBLIC LICENSE\nVersion 1.0\n\n1. Definitions. \n1.1. \"Contributor\" means each entity that creates or contributes to the creation of \nModifications.\n\n1.2. \"Contributor Version\" means the combination of the Original Code, prior \nModifications used by a Contributor, and the Modifications made by that particular \nContributor.\n\n1.3. \"Covered Code\" means the Original Code or Modifications or the combination \nof the Original Code and Modifications, in each case including portions thereof.\n\n1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted \nin the software development community for the electronic transfer of data.\n\n1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n1.6. \"Initial Developer\" means the individual or entity identified as the Initial \nDeveloper in the Source Code notice required by Exhibit A.\n\n1.7. \"Larger Work\" means a work, which combines Covered Code or portions \nthereof with code not governed by the terms of this License.\n\n1.8. \"License\" means this document and the corresponding addendum describe in \nsection 6.4 below.\n\n1.9. \"Modifications\" means any addition to or deletion from the substance or \nstructure of either the Original Code or any previous Modifications. When Covered \nCode is released as a series of files, a Modification is:\n\nA. Any addition to or deletion from the contents of a file containing Original \nCode or previous Modifications.\nB. Any new file that contains any part of the Original Code or previous \nModifications.\n\n1.10. \"Original Code\" means Source Code of computer software code which is \ndescribed in the Source Code notice required by Exhibit A as Original Code, and \nwhich, at the time of its release under this License is not already Covered Code \ngoverned by this License.\n\n1.11. \"Source Code\" means the preferred form of the Covered Code for making \nmodifications to it, including all modules it contains, plus any associated interface \ndefinition files, scripts used to control compilation and installation of an Executable, \nor a list of source code differential comparisons against either the Original Code or \nanother well known, available Covered Code of the Contributor's choice. The Source \nCode can be in a compressed or archival form, provided the appropriate \ndecompression or de-archiving software is widely available for no charge.\n\n1.12. \"You\" means an individual or a legal entity exercising rights under, and \ncomplying with all of the terms of, this License or a future version of this License \nissued under Section 6.1. For legal entities, \"You\" includes any entity which controls, \nis controlled by, or is under common control with You. For purposes of this definition, \n\"control\" means (a) the power, direct or indirect, to cause the direction or \nmanagement of such entity, whether by contract or otherwise, or (b) ownership of \nfifty percent (50%) or more of the outstanding shares or beneficial ownership of such \nentity.\n\n1.13 \"License Author\" means Lutris Technologies, Inc.\n\n2. Source Code License.\n2.1. The Initial Developer Grant.\nThe Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive \nlicense, subject to third party intellectual property claims:\n(a) under intellectual property rights (other than patent or trademark) to use, \nreproduce, modify, display, perform, sublicense and distribute the Original \nCode (or portions thereof) with or without Modifications, or as part of a Larger \nWork; and\n(b) under patents now or hereafter owned or controlled by Initial Developer, \nto make, have made, use and sell (\"offer to sell and import\") the Original \nCode (or portions thereof), but solely to the extent that any such patent is \nreasonably necessary to enable You to Utilize the Original Code (or portions \nthereof) and not to any greater extent that may be necessary to Utilize further \nModifications or combinations.\n\n2.2. Contributor Grant.\nEach Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, \nsubject to third party intellectual property claims:\n\n(a) under intellectual property rights (other than patent or trademark) to use, \nreproduce, modify, display, perform, sublicense and distribute the \nModifications created by such Contributor (or portions thereof) either on an \nunmodified basis, with other Modifications, as Covered Code or as part of a \nLarger Work; and\n(b) under patents now or hereafter owned or controlled by Contributor, to to \nmake, have made, use and sell (\"offer to sell and import\") the Contributor \nVersion (or portions thereof), but solely to the extent that any such patent is \nreasonably necessary to enable You to Utilize the Contributor Version (or \nportions thereof), and not to any greater extent that may be necessary to \nUtilize further Modifications or combinations. \n\n3. Distribution Obligations. \n3.1. Application of License.\nThe Modifications which You create or to which You contribute are governed by the \nterms of this License, including without limitation Section 2.2. The Source Code \nversion of Covered Code may be distributed only under the terms of this License or a \nfuture version of this License released under Section 6.1, and You must include a \ncopy of this License with every copy of the Source Code You distribute. You may not \noffer or impose any terms on any Source Code version that alters or restricts the \napplicable version of this License or the recipients' rights hereunder. However, You \nmay include an additional document offering the additional rights described in \nSection 3.5.\n\n3.2. Availability of Source Code.\nAny Modification which You create or to which You contribute must be made \navailable, prior to any use, except for internal development and practice, in Source \nCode form under the terms of this License either on the same media as an \nExecutable version or via an accepted Electronic Distribution Mechanism to anyone \nto whom you made an Executable version available; and if made available via \nElectronic Distribution Mechanism, must remain available for at least twelve (12) \nmonths after the date it initially became available, or at least six (6) months after a \nsubsequent version of that particular Modification has been made available to such \nrecipients. You shall notify the Initial Developer of the Modification and the location of \nthe Source Code via the contact means provided for in the Developer Specific \nlicense. Initial Developer will be acting as maintainer of the Source Code and may \nprovide an Electronic Distribution mechanism for the Modification to be made \navailable.\n\n3.3. Description of Modifications.\nYou must cause all Covered Code to which you contribute to contain a file \ndocumenting the changes You made to create that Covered Code and the date of \nany change. You must include a prominent statement that the Modification is derived, \ndirectly or indirectly, from Original Code provided by the Initial Developer and \nincluding the name of the Initial Developer in (a) the Source Code, and (b) in any \nnotice in an Executable version or related documentation in which You describe the \norigin or ownership of the Covered Code.\n\n3.4. Intellectual Property Matters\n\n(a) Third Party Claims.\nIf You have knowledge that a party claims an intellectual property right in \nparticular functionality or code (or its utilization under this License), you must \ninclude a text file with the source code distribution titled \"LEGAL\" which \ndescribes the claim and the party making the claim in sufficient detail that a \nrecipient will know whom to contact. If you obtain such knowledge after You \nmake Your Modification available as described in Section 3.2, You shall \npromptly modify the LEGAL file in all copies You make available thereafter \nand shall take other steps (such as notifying appropriate mailing lists or \nnewsgroups) reasonably calculated to inform those who received the \nCovered Code that new knowledge has been obtained.\n(b) Representations. \nContributor represents that, except as disclosed pursuant to Section 3.4(a) \nabove, Contributor believes that Contributor's Modifications are Contributor's \noriginal creation(s) and/or Contributor has sufficient rights to grant the rights \nconveyed by this License.\n\n3.5. Required Notices.\nYou must duplicate the notice in Exhibit A in each file of the Source Code, and this \nLicense in any documentation for the Source Code, where You describe recipients' \nrights relating to Covered Code. If You created one or more Modification(s), You may \nadd your name as a Contributor to the notice described in Exhibit A. If it is not \npossible to put such notice in a particular Source Code file due to its structure, then \nyou must include such notice in a location (such as a relevant directory file) where a \nuser would be likely to look for such a notice. You may choose to offer, and to charge \na fee for, warranty, support, indemnity or liability obligations to one or more recipients \nof Covered Code. However, You may do so only on Your own behalf, and not on \nbehalf of the Initial Developer or any Contributor. You must make it absolutely clear \nthat any such warranty, support, indemnity or liability obligation is offered by You \nalone, and You hereby agree to indemnify the Initial Developer and every Contributor \nfor any liability incurred by the Initial Developer or such Contributor as a result of \nwarranty, support, indemnity or liability terms You offer.\n\n3.6. Distribution of Executable Versions.\nYou may distribute Covered Code in Executable form only if the requirements of \nSection 3.1-3.5 have been met for that Covered Code, and if You include a notice \nstating that the Source Code version of the Covered Code is available under the \nterms of this License, including a description of how and where You have fulfilled the \nobligations of Section 3.2. The notice must be conspicuously included in any notice \nin an Executable version, related documentation or collateral in which You describe \nrecipients' rights relating to the Covered Code. You may distribute the Executable \nversion of Covered Code under a license of Your choice, which may contain terms \ndifferent from this License, provided that You are in compliance with the terms of this \nLicense and that the license for the Executable version does not attempt to limit or \nalter the recipient's rights in the Source Code version from the rights set forth in this \nLicense. If You distribute the Executable version under a different license You must \nmake it absolutely clear that any terms which differ from this License are offered by \nYou alone, not by the Initial Developer or any Contributor. You hereby agree to \nindemnify the Initial Developer and every Contributor for any liability incurred by the \nInitial Developer or such Contributor as a result of any such terms You offer. If you \ndistribute executable versions containing Covered Code, you must reproduce the \nnotice in Exhibit B in the documentation and/or other materials provided with the \nproduct.\n\n3.7. Larger Works.\nYou may create a Larger Work by combining Covered Code with other code not \ngoverned by the terms of this License and distribute the Larger Work as a single \nproduct. In such a case, You must make sure the requirements of this License are \nfulfilled for the Covered Code. \n\n4. Inability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect \nto some or all of the Covered Code due to statute or regulation then You must: (a) \ncomply with the terms of this License to the maximum extent possible; and (b) Cite \nall of the statutes or regulations that prohibit you from complying fully with this \nlicense. (c) describe the limitations and the code they affect. Such description must \nbe included in the LEGAL file described in Section 3.4 and must be included with all \ndistributions of the Source Code. Except to the extent prohibited by statute or \nregulation, such description must be sufficiently detailed for a recipient of ordinary \nskill to be able to understand it. \n\n5. Application of this License.\nThis License applies to code to which the Initial Developer has attached the notice in \nExhibit A, and to related Covered Code.\n\n6. Versions of the License.\n6.1. New Versions.\nLicense Author may publish revised and/or new versions of the License from time to \ntime. Each version will be given a distinguishing version number and shall be \nsubmitted to opensource.org for certification.\n6.2. Effect of New Versions.\nOnce Covered Code has been published under a particular version of the License, \nYou may always continue to use it under the terms of that version. You may also \nchoose to use such Covered Code under the terms of any subsequent version of the \nLicense published by Initial Developer. No one other than Initial Developer has the \nright to modify the terms applicable to Covered Code created under this License.\n\n6.3. Derivative Works.\nIf you create or use a modified version of this License, except in association with the \nrequired Devloper Specific License described in section 6.4, (which you may only do \nin order to apply it to code which is not already Covered Code governed by this \nLicense), you must (a) rename Your license so that the phrases \"Open\", \"OpenPL\", \n\"OPL\" or any confusingly similar phrase do not appear anywhere in your license and \n(b) otherwise make it clear that your version of the license contains terms which differ \nfrom the Open Public License. (Filling in the name of the Initial Developer, Original \nCode or Contributor in the notice described in Exhibit A shall not of themselves be \ndeemed to be modifications of this License.)\n\n6.4. Required Additional Developer Specific License\nThis license is a union of the following two parts that should be found as text files in \nthe same place (directory), in the order of preeminence:\n\n[1] A Developer specific license.\n\n[2] The contents of this file OPL.html, stating the general licensing policy of \nthe software.\n\nIn case of conflicting dispositions in the parts of this license, the terms of the lower-\nnumbered part will always be superseded by the terms of the higher numbered part.\n\n7. DISCLAIMER OF WARRANTY. \nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, \nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, \nINCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE \nIS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE \nOR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND \nPERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY \nCOVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE \nINITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF \nANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER \nOF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO \nUSE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER \nTHIS DISCLAIMER. \n\n8. TERMINATION. \n8.1 Termination upon Breach\nThis License and the rights granted hereunder will terminate automatically if You fail \nto comply with terms herein and fail to cure such breach within 30 days of becoming \naware of the breach. All sublicenses to the Covered Code, which are properly \ngranted, shall survive any termination of this License. Provisions that, by their nature, \nmust remain in effect beyond the termination of this License shall survive. \n8.2. Termination Upon Litigation.\nIf You initiate litigation by asserting a patent \ninfringement claim (excluding declatory judgment actions) against Initial Developer or \na Contributor (the Initial Developer or Contributor against whom You file such action \nis referred to as \"Participant\") alleging that:\n\n(a) such Participant's Contributor Version directly or indirectly infringes any \npatent, then any and all rights granted by such Participant to You under \nSections 2.1 and/or 2.2 of this License shall, upon 60 days notice from \nParticipant terminate prospectively, unless if within 60 days after receipt of \nnotice You either: (i) agree in writing to pay Participant a mutually agreeable \nreasonable royalty for Your past and future use of Modifications made by \nsuch Participant, or (ii) withdraw Your litigation claim with respect to the \nContributor Version against such Participant. If within 60 days of notice, a \nreasonable royalty and payment arrangement are not mutually agreed upon \nin writing by the parties or the litigation claim is not withdrawn, the rights \ngranted by Participant to You under Sections 2.1 and/or 2.2 automatically \nterminate at the expiration of the 60 day notice period specified above.\n(b) any software, hardware, or device, other than such Participant's \nContributor Version, directly or indirectly infringes any patent, then any rights \ngranted to You by such Participant under Sections 2.1(b) and 2.2(b) are \nrevoked effective as of the date You first made, used, sold, distributed, or \nhad made, Modifications made by that Participant.\n\n8.3. If You assert a patent infringement claim against Participant alleging that such \nParticipant's Contributor Version directly or indirectly infringes any patent where such \nclaim is resolved (such as by license or settlement) prior to the initiation of patent \ninfringement litigation, then the reasonable value of the licenses granted by such \nParticipant under Sections 2.1 or 2.2 shall be taken into account in determining the \namount or value of any payment or license.\n\n8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license \nagreements (excluding distributors and resellers) which have been validly granted by \nYou or any distributor hereunder prior to termination shall survive termination.\n9. LIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER \nTORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE \nINITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF \nCOVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE \nTO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, \nOR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT \nLIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, \nCOMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER \nCOMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE \nBEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION \nOF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL \nINJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT \nAPPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO \nNOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR \nCONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY \nNOT APPLY TO YOU. \n10. U.S. GOVERNMENT END USERS. \nThe Covered Code is a \"commercial item,\" as that term is defined in 48 C.F.R. 2.101 \n(Oct. 1995), consisting of \"commercial computer software\" and \"commercial \ncomputer software documentation,\" as such terms are used in 48 C.F.R. 12.212 \n(Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through \n227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with \nonly those rights set forth herein. \n11. MISCELLANEOUS. \nThis section was intentionally left blank. The contents of this section are found in the \ncorresponding addendum described above.\n12. RESPONSIBILITY FOR CLAIMS. \nExcept in cases where another Contributor has failed to comply with Section 3.4, You \nare responsible for damages arising, directly or indirectly, out of Your utilization of \nrights under this License, based on the number of copies of Covered Code you made \navailable, the revenues you received from utilizing such rights, and other relevant \nfactors. You agree to work with affected parties to distribute with Initial Developer \nresponsibility on an equitable basis. \nExhibit A. \nText for this Exhibit A is found in the corresponding addendum, described in section \n6.4 above, text file provided by the Initial Developer. This license is not valid or \ncomplete with out that file. \nExhibit B. \nText for this Exhibit B is found in the corresponding addendum, described in section \n6.4 above, text file provided by the Initial Developer. This license is not valid or \ncomplete with out that file.","_textUrls":["http://old.koalateam.com/jackaroo/OPL_1_0.TXT"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"scancode:opl-1.0","tag":"LN"},[{"contents":"OpenContent License 1.0","tag":"LN"},{"contents":"OpenContent Public License v1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["ScancodeData","937493467a1c4481d8dbcc1270a310e7"],"impliedStmts":[{"contents":{"contents":"Copyleft Limited","tag":"UnknownLicenseType"},"tag":"LicenseType"},{"contents":{"contents":"http://opencontent.org/opl.shtml","tag":"LicenseStatement"},"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":[null,"http://opencontent.org/opl.shtml"],"tag":"LicenseUrl"},{"contents":[null,"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"tag":"LicenseUrl"},{"contents":"OpenContent License (OPL)\nVersion 1.0, July 14. 1998\n\nThis document outlines the principles underlying the OpenContent (OC) movement and may be redistributed provided it remains unaltered. For legal purposes, this document is the license under which OpenContent is made available for use.\n\nThe original version of this document may be found at http://www.opencontent.org/opl.html\n\nLICENSE\n\nTerms and Conditions for Copying, Distributing, and Modifying\n\nItems other than copying, distributing, and modifying the Content with which this license was distributed (such as using, etc.) are outside the scope of this license.\n\n1. You may copy and distribute exact replicas of the OpenContent (OC) as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the OC a copy of this License along with the OC. You may at your option charge a fee for the media and/or handling involved in creating a unique copy of the OC for use offline, you may at your option offer instructional support for the OC in exchange for a fee, or you may at your option offer warranty in exchange for a fee. You may not charge a fee for the OC itself. You may not charge a fee for the sole service of providing access to and/or use of the OC via a network (e.g. the Internet), whether it be via the world wide web, FTP, or any other method.\n\n2. You may modify your copy or copies of the OpenContent or any portion of it, thus forming works based on the Content, and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:\n\na) You must cause the modified content to carry prominent notices stating that you changed it, the exact nature and content of the changes, and the date of any change.\n\nb) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the OC or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License, unless otherwise permitted under applicable Fair Use law.\n\nThese requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the OC, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the OC, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Exceptions are made to this requirement to release modified works free of charge under this license only in compliance with Fair Use law where applicable.\n\n3. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to copy, distribute or modify the OC. These actions are prohibited by law if you do not accept this License. Therefore, by distributing or translating the OC, or by deriving works herefrom, you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or translating the OC.\n\nNO WARRANTY\n4. BECAUSE THE OPENCONTENT (OC) IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE OC, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE OC \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK OF USE OF THE OC IS WITH YOU. SHOULD THE OC PROVE FAULTY, INACCURATE, OR OTHERWISE UNACCEPTABLE YOU ASSUME THE COST OF ALL NECESSARY REPAIR OR CORRECTION.\n\n5. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MIRROR AND/OR REDISTRIBUTE THE OC AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE OC, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","tag":"LicenseText"}],"raw":{"_category":"Copyleft Limited","_homepageUrl":"http://opencontent.org/opl.shtml","_key":"opl-1.0","_name":"OpenContent Public License v1.0","_notes":null,"_osiUrl":null,"_otherUrls":["http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"_owner":"OpenContent","_shortName":"OpenContent License 1.0","_spdxId":"LicenseRef-scancode-opl-1.0","_text":"OpenContent License (OPL)\nVersion 1.0, July 14. 1998\n\nThis document outlines the principles underlying the OpenContent (OC) movement and may be redistributed provided it remains unaltered. For legal purposes, this document is the license under which OpenContent is made available for use.\n\nThe original version of this document may be found at http://www.opencontent.org/opl.html\n\nLICENSE\n\nTerms and Conditions for Copying, Distributing, and Modifying\n\nItems other than copying, distributing, and modifying the Content with which this license was distributed (such as using, etc.) are outside the scope of this license.\n\n1. You may copy and distribute exact replicas of the OpenContent (OC) as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the OC a copy of this License along with the OC. You may at your option charge a fee for the media and/or handling involved in creating a unique copy of the OC for use offline, you may at your option offer instructional support for the OC in exchange for a fee, or you may at your option offer warranty in exchange for a fee. You may not charge a fee for the OC itself. You may not charge a fee for the sole service of providing access to and/or use of the OC via a network (e.g. the Internet), whether it be via the world wide web, FTP, or any other method.\n\n2. You may modify your copy or copies of the OpenContent or any portion of it, thus forming works based on the Content, and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:\n\na) You must cause the modified content to carry prominent notices stating that you changed it, the exact nature and content of the changes, and the date of any change.\n\nb) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the OC or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License, unless otherwise permitted under applicable Fair Use law.\n\nThese requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the OC, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the OC, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Exceptions are made to this requirement to release modified works free of charge under this license only in compliance with Fair Use law where applicable.\n\n3. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to copy, distribute or modify the OC. These actions are prohibited by law if you do not accept this License. Therefore, by distributing or translating the OC, or by deriving works herefrom, you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or translating the OC.\n\nNO WARRANTY\n4. BECAUSE THE OPENCONTENT (OC) IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE OC, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE OC \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK OF USE OF THE OC IS WITH YOU. SHOULD THE OC PROVE FAULTY, INACCURATE, OR OTHERWISE UNACCEPTABLE YOU ASSUME THE COST OF ALL NECESSARY REPAIR OR CORRECTION.\n\n5. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MIRROR AND/OR REDISTRIBUTE THE OC AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE OC, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","_textUrls":["http://opencontent.org/opl.shtml"]},"type":"ScancodeData"},{"applicableLNs":{"contents":[{"contents":"fossology:OPL-1.0","tag":"LN"},[{"contents":"Open Public License v1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","44e3688c20327af9b474bdc469dd6f25"],"impliedStmts":[{"contents":{"contents":[null,"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"OPEN PUBLIC LICENSE\n\nVersion 1.0\n\n   1. Definitions.\n\n      1.1. \"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n\n      1.2. \"Contributor Version\" means the combination of the Original Code, prior Modifications used by a Contributor, and the Modifications made by that particular Contributor.\n\n      1.3. \"Covered Code\" means the Original Code or Modifications or the combination of the Original Code and Modifications, in each case including portions thereof.\n\n      1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software development community for the electronic transfer of data.\n\n      1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n      1.6. \"Initial Developer\" means the individual or entity identified as the Initial Developer in the Source Code notice required by Exhibit A.\n\n      1.7. \"Larger Work\" means a work, which combines Covered Code or portions thereof with code not governed by the terms of this License.\n\n      1.8. \"License\" means this document and the corresponding addendum described in section 6.4 below.\n\n      1.9. \"Modifications\" means any addition to or deletion from the substance or structure of either the Original Code or any previous Modifications. When Covered Code is released as a series of files, a Modification is:\n\n         A. Any addition to or deletion from the contents of a file containing Original Code or previous Modifications.\n\n         B. Any new file that contains any part of the Original Code or previous Modifications.\n\n      1.10. \"Original Code\" means Source Code of computer software code which is described in the Source Code notice required by Exhibit A as Original Code, and which, at the time of its release under this License is not already Covered Code governed by this License.\n\n      1.11. \"Source Code\" means the preferred form of the Covered Code for making modifications to it, including all modules it contains, plus any associated interface definition files, scripts used to control compilation and installation of an Executable, or a list of source code differential comparisons against either the Original Code or another well known, available Covered Code of the Contributor's choice. The Source Code can be in a compressed or archival form, provided the appropriate decompression or de-archiving software is widely available for no charge.\n\n      1.12. \"You\" means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License or a future version of this License issued under Section 6.1. For legal entities, \"You'' includes any entity which controls, is controlled by, or is under common control with You. For purposes of this definition, \"control'' means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of such entity.\n\n      1.13 \"License Author\" means Lutris Technologies, Inc.\n\n   2. Source Code License.\n\n      2.1. The Initial Developer Grant. The Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Original Code (or portions thereof) with or without Modifications, or as part of a Larger Work; and\n\n         (b) under patents now or hereafter owned or controlled by Initial Developer, to make, have made, use and sell (``offer to sell and import'') the Original Code (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Original Code (or portions thereof) and not to any greater extent that may be necessary to Utilize further Modifications or combinations.\n\n      2.2. Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Modifications created by such Contributor (or portions thereof) either on an unmodified basis, with other Modifications, as Covered Code or as part of a Larger Work; and\n\n         (b) under patents now or hereafter owned or controlled by Contributor, to to make, have made, use and sell (``offer to sell and import'') the Contributor Version (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Contributor Version (or portions thereof), and not to any greater extent that may be necessary to Utilize further Modifications or combinations\n\n   3. Distribution Obligations.\n\n      3.1. Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1, and You must include a copy of this License with every copy of the Source Code You distribute. You may not offer or impose any terms on any Source Code version that alters or restricts the applicable version of this License or the recipients' rights hereunder. However, You may include an additional document offering the additional rights described in Section 3.5.\n\n      3.2. Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients. You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available.\n\n      3.3. Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change. You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an Executable version or related documentation in which You describe the origin or ownership of the Covered Code.\n\n      3.4. Intellectual Property Matters\n\n         (a) Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained.\n\n         (b) Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a) above, Contributor believes that Contributor's Modifications are Contributor's original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this License.\n\n      3.5. Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice. You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone, and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer.\n\n      3.6. Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code. You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License. If You distribute the Executable version under a different license You must make it absolutely clear that any terms which differ from this License are offered by You alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of any such terms You offer. If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product.\n\n      3.7. Larger Works. You may create a Larger Work by combining Covered Code with other code not governed by the terms of this License and distribute the Larger Work as a single product. In such a case, You must make sure the requirements of this License are fulfilled for the Covered Code.\n\n   4. Inability to Comply Due to Statute or Regulation.\n\n   If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n   5. Application of this License.\n\n   This License applies to code to which the Initial Developer has attached the notice in Exhibit A, and to related Covered Code.\n\n   6. Versions of the License.\n\n      6.1. New Versions. License Author may publish revised and/or new versions of the License from time to time. Each version will be given a distinguishing version number and shall be submitted to opensource.org for certification.\n\n      6.2. Effect of New Versions. Once Covered Code has been published under a particular version of the License, You may always continue to use it under the terms of that version. You may also choose to use such Covered Code under the terms of any subsequent version of the License published by Initial Developer. No one other than Initial Developer has the right to modify the terms applicable to Covered Code created under this License.\n\n      6.3. Derivative Works. If you create or use a modified version of this License, except in association with the required Developer Specific License described in section 6.4, (which you may only do in order to apply it to code which is not already Covered Code governed by this License), you must (a) rename Your license so that the phrases ``Open'', ``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear anywhere in your license and (b) otherwise make it clear that your version of the license contains terms which differ from the Open Public License. (Filling in the name of the Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall not of themselves be deemed to be modifications of this License.)\n\n      6.4. Required Additional Developer Specific License\n\n      This license is a union of the following two parts that should be found as text files in the same place (directory), in the order of preeminence:\n\n         [1] A Developer specific license.\n\n         [2] The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n\n      In case of conflicting dispositions in the parts of this license, the terms of the lower-numbered part will always be superseded by the terms of the higher numbered part.\n\n   7. DISCLAIMER OF WARRANTY.\n\n   COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n   8. TERMINATION.\n\n      8.1 Termination upon Breach\n\n      This License and the rights granted hereunder will terminate automatically if You fail to comply with terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses to the Covered Code, which are properly granted, shall survive any termination of this License. Provisions that, by their nature, must remain in effect beyond the termination of this License shall survive.\n\n      8.2. Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\n\n         (a) such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\n\n         (b) any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant.\n\n      8.3. If You assert a patent infringement claim against Participant alleging that such Participant's Contributor Version directly or indirectly infringes any patent where such claim is resolved (such as by license or settlement) prior to the initiation of patent infringement litigation, then the reasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of any payment or license.\n\n      8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or any distributor hereunder prior to termination shall survive termination.\n\n   9. LIMITATION OF LIABILITY.\n\n   UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n   10. U.S. GOVERNMENT END USERS.\n\n   The Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of ``commercial computer software'' and ``commercial computer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only those rights set forth herein.\n\n   11. MISCELLANEOUS.\n\n   his section was intentionally left blank. The contents of this section are found in the corresponding addendum described above.\n\n   12. RESPONSIBILITY FOR CLAIMS.\n\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for damages arising, directly or indirectly, out of Your utilization of rights under this License, based on the number of copies of Covered Code you made available, the revenues you received from utilizing such rights, and other relevant factors. You agree to work with affected parties to distribute with Initial Developer responsibility on an equitable basis. EXHIBIT A.\n\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\nEXHIBIT B.\n\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"Open Public License v1.0","_rf_notes":"","_rf_risk":null,"_rf_shortname":"fossology:OPL-1.0","_rf_source":null,"_rf_spdx_compatible":true,"_rf_text":"OPEN PUBLIC LICENSE\n\nVersion 1.0\n\n   1. Definitions.\n\n      1.1. \"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n\n      1.2. \"Contributor Version\" means the combination of the Original Code, prior Modifications used by a Contributor, and the Modifications made by that particular Contributor.\n\n      1.3. \"Covered Code\" means the Original Code or Modifications or the combination of the Original Code and Modifications, in each case including portions thereof.\n\n      1.4. \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software development community for the electronic transfer of data.\n\n      1.5. \"Executable\" means Covered Code in any form other than Source Code.\n\n      1.6. \"Initial Developer\" means the individual or entity identified as the Initial Developer in the Source Code notice required by Exhibit A.\n\n      1.7. \"Larger Work\" means a work, which combines Covered Code or portions thereof with code not governed by the terms of this License.\n\n      1.8. \"License\" means this document and the corresponding addendum described in section 6.4 below.\n\n      1.9. \"Modifications\" means any addition to or deletion from the substance or structure of either the Original Code or any previous Modifications. When Covered Code is released as a series of files, a Modification is:\n\n         A. Any addition to or deletion from the contents of a file containing Original Code or previous Modifications.\n\n         B. Any new file that contains any part of the Original Code or previous Modifications.\n\n      1.10. \"Original Code\" means Source Code of computer software code which is described in the Source Code notice required by Exhibit A as Original Code, and which, at the time of its release under this License is not already Covered Code governed by this License.\n\n      1.11. \"Source Code\" means the preferred form of the Covered Code for making modifications to it, including all modules it contains, plus any associated interface definition files, scripts used to control compilation and installation of an Executable, or a list of source code differential comparisons against either the Original Code or another well known, available Covered Code of the Contributor's choice. The Source Code can be in a compressed or archival form, provided the appropriate decompression or de-archiving software is widely available for no charge.\n\n      1.12. \"You\" means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License or a future version of this License issued under Section 6.1. For legal entities, \"You'' includes any entity which controls, is controlled by, or is under common control with You. For purposes of this definition, \"control'' means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of such entity.\n\n      1.13 \"License Author\" means Lutris Technologies, Inc.\n\n   2. Source Code License.\n\n      2.1. The Initial Developer Grant. The Initial Developer hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Original Code (or portions thereof) with or without Modifications, or as part of a Larger Work; and\n\n         (b) under patents now or hereafter owned or controlled by Initial Developer, to make, have made, use and sell (``offer to sell and import'') the Original Code (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Original Code (or portions thereof) and not to any greater extent that may be necessary to Utilize further Modifications or combinations.\n\n      2.2. Contributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive license, subject to third party intellectual property claims:\n\n         (a) under intellectual property rights (other than patent or trademark) to use, reproduce, modify, display, perform, sublicense and distribute the Modifications created by such Contributor (or portions thereof) either on an unmodified basis, with other Modifications, as Covered Code or as part of a Larger Work; and\n\n         (b) under patents now or hereafter owned or controlled by Contributor, to to make, have made, use and sell (``offer to sell and import'') the Contributor Version (or portions thereof), but solely to the extent that any such patent is reasonably necessary to enable You to Utilize the Contributor Version (or portions thereof), and not to any greater extent that may be necessary to Utilize further Modifications or combinations\n\n   3. Distribution Obligations.\n\n      3.1. Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1, and You must include a copy of this License with every copy of the Source Code You distribute. You may not offer or impose any terms on any Source Code version that alters or restricts the applicable version of this License or the recipients' rights hereunder. However, You may include an additional document offering the additional rights described in Section 3.5.\n\n      3.2. Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients. You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available.\n\n      3.3. Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change. You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer in (a) the Source Code, and (b) in any notice in an Executable version or related documentation in which You describe the origin or ownership of the Covered Code.\n\n      3.4. Intellectual Property Matters\n\n         (a) Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained.\n\n         (b) Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a) above, Contributor believes that Contributor's Modifications are Contributor's original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this License.\n\n      3.5. Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice. You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone, and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer.\n\n      3.6. Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code. You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License. If You distribute the Executable version under a different license You must make it absolutely clear that any terms which differ from this License are offered by You alone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of any such terms You offer. If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product.\n\n      3.7. Larger Works. You may create a Larger Work by combining Covered Code with other code not governed by the terms of this License and distribute the Larger Work as a single product. In such a case, You must make sure the requirements of this License are fulfilled for the Covered Code.\n\n   4. Inability to Comply Due to Statute or Regulation.\n\n   If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n   5. Application of this License.\n\n   This License applies to code to which the Initial Developer has attached the notice in Exhibit A, and to related Covered Code.\n\n   6. Versions of the License.\n\n      6.1. New Versions. License Author may publish revised and/or new versions of the License from time to time. Each version will be given a distinguishing version number and shall be submitted to opensource.org for certification.\n\n      6.2. Effect of New Versions. Once Covered Code has been published under a particular version of the License, You may always continue to use it under the terms of that version. You may also choose to use such Covered Code under the terms of any subsequent version of the License published by Initial Developer. No one other than Initial Developer has the right to modify the terms applicable to Covered Code created under this License.\n\n      6.3. Derivative Works. If you create or use a modified version of this License, except in association with the required Developer Specific License described in section 6.4, (which you may only do in order to apply it to code which is not already Covered Code governed by this License), you must (a) rename Your license so that the phrases ``Open'', ``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear anywhere in your license and (b) otherwise make it clear that your version of the license contains terms which differ from the Open Public License. (Filling in the name of the Initial Developer, Original Code or Contributor in the notice described in Exhibit A shall not of themselves be deemed to be modifications of this License.)\n\n      6.4. Required Additional Developer Specific License\n\n      This license is a union of the following two parts that should be found as text files in the same place (directory), in the order of preeminence:\n\n         [1] A Developer specific license.\n\n         [2] The contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\n\n      In case of conflicting dispositions in the parts of this license, the terms of the lower-numbered part will always be superseded by the terms of the higher numbered part.\n\n   7. DISCLAIMER OF WARRANTY.\n\n   COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n   8. TERMINATION.\n\n      8.1 Termination upon Breach\n\n      This License and the rights granted hereunder will terminate automatically if You fail to comply with terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses to the Covered Code, which are properly granted, shall survive any termination of this License. Provisions that, by their nature, must remain in effect beyond the termination of this License shall survive.\n\n      8.2. Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\n\n         (a) such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\n\n         (b) any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant.\n\n      8.3. If You assert a patent infringement claim against Participant alleging that such Participant's Contributor Version directly or indirectly infringes any patent where such claim is resolved (such as by license or settlement) prior to the initiation of patent infringement litigation, then the reasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of any payment or license.\n\n      8.4. In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or any distributor hereunder prior to termination shall survive termination.\n\n   9. LIMITATION OF LIABILITY.\n\n   UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n   10. U.S. GOVERNMENT END USERS.\n\n   The Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of ``commercial computer software'' and ``commercial computer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only those rights set forth herein.\n\n   11. MISCELLANEOUS.\n\n   his section was intentionally left blank. The contents of this section are found in the corresponding addendum described above.\n\n   12. RESPONSIBILITY FOR CLAIMS.\n\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for damages arising, directly or indirectly, out of Your utilization of rights under this License, based on the number of copies of Covered Code you made available, the revenues you received from utilizing such rights, and other relevant factors. You agree to work with affected parties to distribute with Initial Developer responsibility on an equitable basis. EXHIBIT A.\n\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.\n\nEXHIBIT B.\n\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file provided by the Initial Developer. This license is not valid or complete with out that file.","_rf_text_updatable":true,"_rf_url":"http://old.koalateam.com/jackaroo/OPL_1_0.TXT"},"type":"Fossology"},{"applicableLNs":{"contents":[{"contents":"fossology:OPL","tag":"LN"},[{"contents":"OpenContent License 1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["Fossology","128141d93219d9a85eebc425a54149b8"],"impliedStmts":[{"contents":{"contents":[null,"http://www.opencontent.org/opl.shtml"],"tag":"LicenseUrl"},"tag":"MaybeStatement"},{"contents":{"contents":{"contents":["Fossology",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},"tag":"MaybeStatement"},{"contents":"OpenContent License (OPL)\nVersion 1.0, July 14, 1998. \n\nThis document outlines the principles underlying the OpenContent (OC) movement and may be redistributed provided it remains unaltered. For legal purposes, this document is the license under which OpenContent is made available for use. \n\nThe original version of this document may be found at http://opencontent.org/opl.shtml \n\nLICENSE \n\nTerms and Conditions for Copying, Distributing, and Modifying \n\nItems other than copying, distributing, and modifying the Content with which this license was distributed (such as using, etc.) are outside the scope of this license. \n\n1. You may copy and distribute exact replicas of the OpenContent (OC) as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the OC a copy of this License along with the OC. You may at your option charge a fee for the media and/or handling involved in creating a unique copy of the OC for use offline, you may at your option offer instructional support for the OC in exchange for a fee, or you may at your option offer warranty in exchange for a fee. You may not charge a fee for the OC itself. You may not charge a fee for the sole service of providing access to and/or use of the OC via a network (e.g. the Internet), whether it be via the world wide web, FTP, or any other method. \n\n2. You may modify your copy or copies of the OpenContent or any portion of it, thus forming works based on the Content, and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions: \n\na) You must cause the modified content to carry prominent notices stating that you changed it, the exact nature and content of the changes, and the date of any change. \n\nb) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the OC or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License, unless otherwise permitted under applicable Fair Use law. \n\nThese requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the OC, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the OC, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Exceptions are made to this requirement to release modified works free of charge under this license only in compliance with Fair Use law where applicable. \n\n3. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to copy, distribute or modify the OC. These actions are prohibited by law if you do not accept this License. Therefore, by distributing or translating the OC, or by deriving works herefrom, you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or translating the OC. \n\nNO WARRANTY \n\n4. BECAUSE THE OPENCONTENT (OC) IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE OC, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE OC \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK OF USE OF THE OC IS WITH YOU. SHOULD THE OC PROVE FAULTY, INACCURATE, OR OTHERWISE UNACCEPTABLE YOU ASSUME THE COST OF ALL NECESSARY REPAIR OR CORRECTION. \n\n5. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MIRROR AND/OR REDISTRIBUTE THE OC AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE OC, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","tag":"LicenseText"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"}],"raw":{"_marydone":false,"_rf_FSFfree":null,"_rf_Fedora":null,"_rf_GPLv2compatible":null,"_rf_GPLv3compatible":null,"_rf_OSIapproved":null,"_rf_active":true,"_rf_add_date":null,"_rf_copyleft":null,"_rf_fullname":"OpenContent License 1.0","_rf_notes":"","_rf_risk":null,"_rf_shortname":"fossology:OPL","_rf_source":null,"_rf_spdx_compatible":false,"_rf_text":"OpenContent License (OPL)\nVersion 1.0, July 14, 1998. \n\nThis document outlines the principles underlying the OpenContent (OC) movement and may be redistributed provided it remains unaltered. For legal purposes, this document is the license under which OpenContent is made available for use. \n\nThe original version of this document may be found at http://opencontent.org/opl.shtml \n\nLICENSE \n\nTerms and Conditions for Copying, Distributing, and Modifying \n\nItems other than copying, distributing, and modifying the Content with which this license was distributed (such as using, etc.) are outside the scope of this license. \n\n1. You may copy and distribute exact replicas of the OpenContent (OC) as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the OC a copy of this License along with the OC. You may at your option charge a fee for the media and/or handling involved in creating a unique copy of the OC for use offline, you may at your option offer instructional support for the OC in exchange for a fee, or you may at your option offer warranty in exchange for a fee. You may not charge a fee for the OC itself. You may not charge a fee for the sole service of providing access to and/or use of the OC via a network (e.g. the Internet), whether it be via the world wide web, FTP, or any other method. \n\n2. You may modify your copy or copies of the OpenContent or any portion of it, thus forming works based on the Content, and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions: \n\na) You must cause the modified content to carry prominent notices stating that you changed it, the exact nature and content of the changes, and the date of any change. \n\nb) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the OC or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License, unless otherwise permitted under applicable Fair Use law. \n\nThese requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the OC, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the OC, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Exceptions are made to this requirement to release modified works free of charge under this license only in compliance with Fair Use law where applicable. \n\n3. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to copy, distribute or modify the OC. These actions are prohibited by law if you do not accept this License. Therefore, by distributing or translating the OC, or by deriving works herefrom, you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or translating the OC. \n\nNO WARRANTY \n\n4. BECAUSE THE OPENCONTENT (OC) IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE OC, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE OC \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK OF USE OF THE OC IS WITH YOU. SHOULD THE OC PROVE FAULTY, INACCURATE, OR OTHERWISE UNACCEPTABLE YOU ASSUME THE COST OF ALL NECESSARY REPAIR OR CORRECTION. \n\n5. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MIRROR AND/OR REDISTRIBUTE THE OC AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE OC, EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.","_rf_text_updatable":false,"_rf_url":"http://www.opencontent.org/opl.shtml"},"type":"Fossology"},{"applicableLNs":{"contents":"SPDX:OPL-1.0","tag":"LN"},"id":["OrtLicenseCategorization","87e2d82c1ea0f88b4cb715e9a2126884"],"impliedStmts":[{"contents":{"contents":["OrtLicenseCategorization","copyleft-limited",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"},{"contents":{"contents":["OrtLicenseCategorization","include-source-code-offer-in-notice-file",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"LicenseTag"}],"raw":{"_olcCategories":[{"description":null,"name":"copyleft-limited"},{"description":null,"name":"include-in-notice-file"},{"description":null,"name":"include-source-code-offer-in-notice-file"}],"_olcLicensename":"SPDX:OPL-1.0"},"type":"OrtLicenseCategorization"},{"applicableLNs":{"contents":[{"contents":"cavil:OPL-1.0","tag":"LN"},[{"contents":"OPL-1.0","tag":"LN"},{"contents":"Open Public License 1.0","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["CavilLicenseChange","032a8cb09d4d69f6e31df307ba6adfbd"],"impliedStmts":[],"raw":{"_clcAlias":["OPL-1.0","Open Public License 1.0"],"_clcName":"cavil:OPL-1.0"},"type":"CavilLicenseChange"},{"applicableLNs":{"contents":[{"contents":[{"contents":"metaeffekt:Open Public License 1.0","tag":"LN"},[{"contents":"spdx:OPL-1.0","tag":"LN"}]],"tag":"AlternativeLNs"},[{"contents":"OPL","tag":"LN"},{"contents":"OPL, Version 1.0","tag":"LN"},{"contents":"OPL 1.0","tag":"LN"},{"contents":"OPEN PUBLIC LICENSE Version 1.0","tag":"LN"},{"contents":"scancode:open-public","tag":"LN"}]],"tag":"ImpreciseLNs"},"id":["MetaeffektLicense","97518401c72c5bafbfca75bf2f2ea87f"],"impliedStmts":[],"raw":{"_alternativeNames":["OPL, Version 1.0","OPL 1.0","OPEN PUBLIC LICENSE Version 1.0"],"_canonicalName":"metaeffekt:Open Public License 1.0","_category":"OPL","_openCoDEStatus":null,"_otherIds":["scancode:open-public"],"_shortName":null,"_spdxIdentifier":"spdx:OPL-1.0"},"type":"MetaeffektLicense"},{"applicableLNs":{"contents":[{"contents":"spdx:OPL-1.0","tag":"LN"},[{"contents":"Open Public License v1.0","tag":"LN"}]],"tag":"AlternativeLNs"},"id":["HermineLicense","cc2d8f6b61107a368671b0782621bdf0"],"impliedStmts":[{"contents":{"tag":"WeaklyProtective"},"tag":"LicenseType"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense",""],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"},{"contents":{"contents":{"contents":["OSI","Rejected",{"tag":"NoLicenseTagText"}],"tag":"ScopedLicenseTag"},"tag":"NegativeLicenseRating"},"tag":"LicenseRating"},{"contents":"","tag":"LicenseText"},{"contents":[null,"https://fedoraproject.org/wiki/Licensing/Open_Public_License"],"tag":"LicenseUrl"},{"contents":"\"OPL-1.0\" is a license with a patent grant","tag":"LicenseStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":null,"tag":"MaybeStatement"},{"contents":{"contents":["HermineLicense","\"OPL-1.0\" is of radical: OPL"],"tag":"ScopedLicenseComment"},"tag":"LicenseComment"}],"raw":{"autoupgrade":true,"comment":"","copyleft":"Weak","ethical_clause":false,"foss":"","fsf_approved":null,"inspiration_spdx":"","law_choice":"","license_version":"1.0","long_name":"Open Public License v1.0","non_commercial":false,"non_tivoisation":false,"obligations":[{"generic":[{"description":"Any modified version must be made available to the original author","metacategory":"ProvidingSourceCode","name":"Providing Modifications to original author","passivity":"Active"}],"license":["OPL-1.0"],"name":"Notifying Initial Developer of Modifications","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"3.2 [...] You shall notify the Initial Developer of the Modification and the location of the Source Code via the contact means provided for in the Developer Specific license. Initial Developer will be acting as maintainer of the Source Code and may provide an Electronic Distribution mechanism for the Modification to be made available."},{"generic":[{"description":"Make the corresponding source code available (including modifications):\r\n-at the time of distribution of the software and on the same medium;\r\n-by including a written offer allowing others to obtain it;\r\n-by making it available online.","metacategory":"ProvidingSourceCode","name":"Providing CSC to end user","passivity":"Active"}],"license":["OPL-1.0"],"name":"Corresponding Source Code","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.2. Availability of Source Code. Any Modification which You create or to which You contribute must be made available, prior to any use, except for internal development and practice, in Source Code form under the terms of this License either on the same media as an Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable version available; and if made available via Electronic Distribution Mechanism, must remain available for at least twelve (12) months after the date it initially became available, or at least six (6) months after a subsequent version of that particular Modification has been made available to such recipients.\r\n\r\n3.6. Distribution of Executable Versions. You may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a notice stating that the Source Code version of the Covered Code is available under the terms of this License, including a description of how and where You have fulfilled the obligations of Section 3.2. The notice must be conspicuously included in any notice in an Executable version, related documentation or collateral in which You describe recipients' rights relating to the Covered Code."},{"generic":[{"description":"Display legal mentions during the execution of the software (in the dedicated place for legal mentions).","metacategory":"Mentions","name":"Display legal mentions in the user interface (if applicable)","passivity":"Active"}],"license":["OPL-1.0"],"name":"Mention of original code and author in the program","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.3 [...]You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer [...]  (b) in any notice in an Executable version [...] in which You describe the origin or ownership of the Covered Code."},{"generic":[{"description":"Document all your modifications made in the source code of third-party Open Source components in order to clearly attribute each contribution.","metacategory":"Mentions","name":"Track and mention modifications in the source code","passivity":"Active"}],"license":["OPL-1.0"],"name":"Description of Modifications","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"Altered","verbatim":"3.3. Description of Modifications. You must cause all Covered Code to which you contribute to contain a file documenting the changes You made to create that Covered Code and the date of any change."},{"generic":[{"description":"Keep all legal notices and license texts intact in the Source Code, including in the headers.","metacategory":"Mentions","name":"Preserve legal mentions in source code","passivity":"Active"}],"license":["OPL-1.0"],"name":"Conserver la licence dans les sources","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.1 [...]  and You must include a copy of this License with every copy of the Source Code You distribute.\r\n[...]\r\n3.5. Required Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and this License in any documentation for the Source Code, where You describe recipients' rights relating to Covered Code. If You created one or more Modification(s), You may add your name as a Contributor to the notice described in Exhibit A. If it is not possible to put such notice in a particular Source Code file due to its structure, then you must include such notice in a location (such as a relevant directory file) where a user would be likely to look for such a notice."},{"generic":[{"description":"Reproduce within the documentation the complete text of the licenses, copyright notices and other texts related to involved Intellectual Property.","metacategory":"Mentions","name":"Reproduce license and legal mentions in documentation","passivity":"Active"}],"license":["OPL-1.0"],"name":"Legal notices and mention of original code and author in documentation","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.3. [...]  You must include a prominent statement that the Modification is derived, directly or indirectly, from Original Code provided by the Initial Developer and including the name of the Initial Developer (b) in any notice in [...]  related documentation in which You describe the origin or ownership of the Covered Code.\r\n3.6 [...] If you distribute executable versions containing Covered Code, you must reproduce the notice in Exhibit B in the documentation and/or other materials provided with the product."},{"generic":[{"description":"The vendor agreement must not limit the customer rights granted by the Open Source license. For instance, depending on each license terms, in might be : license fee, royalty, or other charge for exercise of rights.","metacategory":"LicenseAgreement","name":"Do not restrict the rights of the license","passivity":"Passive"}],"license":["OPL-1.0"],"name":"Don't limit rights from upstream","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.6. Distribution of Executable Versions. \r\n[...] You may distribute the Executable version of Covered Code under a license of Your choice, which may contain terms different from this License, provided that You are in compliance with the terms of this License and that the license for the Executable version does not attempt to limit or alter the recipient's rights in the Source Code version from the rights set forth in this License."},{"generic":[{"description":"State in the licence agreement that other contributors are not bound by the extra service offered.","metacategory":"LicenseAgreement","name":"License Agreement must exclude other contributors for additionnal terms","passivity":"Active"}],"license":["OPL-1.0"],"name":"Exclusion of other contributors responsability for additionnal terms","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.5 [...]  You may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial Developer or any Contributor. You must make it absolutely clear that any such warranty, support, indemnity or liability obligation is offered by You alone,"},{"generic":[{"description":"In case of a claim against a contributor as a result of the use or distribution of the product,  you agree to defended and indemnify this contributor.","metacategory":"LicenseAgreement","name":"Indemnify contributors against claims","passivity":"Active"}],"license":["OPL-1.0"],"name":"Indemnification of other contributors","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.5 [...] and You hereby agree to indemnify the Initial Developer and every Contributor for any liability incurred by the Initial Developer or such Contributor as a result of warranty, support, indemnity or liability terms You offer."},{"generic":[{"description":"Enforcing patents against licensees or making a non-infringement agreement contrary to the license is prohibited and/or terminates your rights under the license.","metacategory":"IPManagement","name":"Do not enforce patent rights (Patent peace)","passivity":"Passive"}],"license":["OPL-1.0"],"name":"Termination Upon Litigation","passivity":"Passive","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"8.2. Termination Upon Litigation. If You initiate litigation by asserting a patent infringement claim (excluding declatory judgment actions) against Initial Developer or a Contributor (the Initial Developer or Contributor against whom You file such action is referred to as \"Participant\") alleging that:\r\n\r\n    (a) such Participant's Contributor Version directly or indirectly infringes any patent, then any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from Participant terminate prospectively, unless if within 60 days after receipt of notice You either: (i) agree in writing to pay Participant a mutually agreeable reasonable royalty for Your past and future use of Modifications made by such Participant, or (ii) withdraw Your litigation claim with respect to the Contributor Version against such Participant. If within 60 days of notice, a reasonable royalty and payment arrangement are not mutually agreed upon in writing by the parties or the litigation claim is not withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day notice period specified above.\r\n    (b) any software, hardware, or device, other than such Participant's Contributor Version, directly or indirectly infringes any patent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You first made, used, sold, distributed, or had made, Modifications made by that Participant."},{"generic":[{"description":"Some categories of derivative works or of works based on the Open Source Software must be distributed under the initial license or another license approved by the initial license.","metacategory":"IPManagement","name":"Weak Copyleft","passivity":"Active"}],"license":["OPL-1.0"],"name":"Weak copyleft file based","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.1. Application of License. The Modifications which You create or to which You contribute are governed by the terms of this License, including without limitation Section 2.2. The Source Code version of Covered Code may be distributed only under the terms of this License or a future version of this License released under Section 6.1,"},{"generic":[{"description":"If you can't comply to all of the obligations of the license due to statute, judicial order, or regulation, you must describe the reasons for this impossibility and how you dealt with it.","metacategory":"IPManagement","name":"Inability to Comply Due to Statute or Regulation","passivity":"Active"}],"license":["OPL-1.0"],"name":"Information about regulation preventing from compliance in LEGAL file","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"4. Inability to Comply Due to Statute or Regulation.\r\n\r\nIf it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Code due to statute or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) Cite all of the statutes or regulations that prohibit you from complying fully with this license. (c) describe the limitations and the code they affect. Such description must be included in the LEGAL file described in Section 3.4 and must be included with all distributions of the Source Code. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it."},{"generic":[{"description":"If you are or become aware of additional IP rights (including your own patent rights) that are necessary to operate the software, you have to share this information with other users and contributors.","metacategory":"IPManagement","name":"Inform about potential additionnal IP rights","passivity":"Active"}],"license":["OPL-1.0"],"name":"Mention of 3rd party IP claims in LEGAL file","passivity":"Active","trigger_expl":"DistributionSourceDistributionNonSource","trigger_mdf":"AlteredUnmodified","verbatim":"3.4. Intellectual Property Matters\r\n\r\n    (a) Third Party Claims. If You have knowledge that a party claims an intellectual property right in particular functionality or code (or its utilization under this License), you must include a text file with the source code distribution titled \"LEGAL\" which describes the claim and the party making the claim in sufficient detail that a recipient will know whom to contact. If you obtain such knowledge after You make Your Modification available as described in Section 3.2, You shall promptly modify the LEGAL file in all copies You make available thereafter and shall take other steps (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to inform those who received the Covered Code that new knowledge has been obtained."}],"osi_approved":false,"patent_grant":true,"radical":"OPL","spdx_id":"OPL-1.0","steward":"Lutris Technologies, Inc.","url":"https://fedoraproject.org/wiki/Licensing/Open_Public_License","verbatim":""},"type":"HermineLicense"}]