{"__impliedNames":["EUPL-1.1","European Union Public License 1.1","scancode://eupl-1.1","EUPL 1.1","eupl-1.1","European Union Public License, Version 1.1","License :: OSI Approved :: European Union Public Licence 1.1 (EUPL 1.1)"],"__impliedId":"EUPL-1.1","__hasPatentHint":true,"facts":{"Open Knowledge International":{"is_generic":null,"status":"active","domain_software":true,"url":"https://opensource.org/licenses/EUPL-1.1","maintainer":"","od_conformance":"not reviewed","_sourceURL":"https://github.com/okfn/licenses/blob/master/licenses.csv","domain_data":false,"osd_conformance":"approved","id":"EUPL-1.1","title":"European Union Public License 1.1","_implications":{"__impliedNames":["EUPL-1.1","European Union Public License 1.1"],"__impliedId":"EUPL-1.1","__impliedURLs":[[null,"https://opensource.org/licenses/EUPL-1.1"]]},"domain_content":false},"SPDX":{"isSPDXLicenseDeprecated":false,"spdxFullName":"European Union Public License 1.1","spdxDetailsURL":"http://spdx.org/licenses/EUPL-1.1.json","_sourceURL":"https://spdx.org/licenses/EUPL-1.1.html","spdxLicIsOSIApproved":true,"spdxSeeAlso":["https://joinup.ec.europa.eu/software/page/eupl/licence-eupl","https://joinup.ec.europa.eu/sites/default/files/custom-page/attachment/eupl1.1.-licence-en_0.pdf","https://opensource.org/licenses/EUPL-1.1"],"_implications":{"__impliedNames":["EUPL-1.1","European Union Public License 1.1"],"__impliedId":"EUPL-1.1","__impliedJudgement":[["SPDX",{"tag":"PositiveJudgement","contents":"Is OSI Approved"}]],"__isOsiApproved":true,"__impliedURLs":[["SPDX","http://spdx.org/licenses/EUPL-1.1.json"],[null,"https://joinup.ec.europa.eu/software/page/eupl/licence-eupl"],[null,"https://joinup.ec.europa.eu/sites/default/files/custom-page/attachment/eupl1.1.-licence-en_0.pdf"],[null,"https://opensource.org/licenses/EUPL-1.1"]]},"spdxLicenseId":"EUPL-1.1"},"OSADL License Checklist":{"_sourceURL":"https://www.osadl.org/fileadmin/checklists/unreflicenses/EUPL-1.1.txt","spdxId":"EUPL-1.1","osadlRule":"USE CASE Source code delivery\n\tYOU MUST NOT Modify Copyright notice\n\tYOU MUST NOT Modify License notice\n\tYOU MUST NOT Modify Trademark notices\n\tYOU MUST NOT Modify Warranty disclaimer\n\tYOU MUST Forward License text\n\tIF Software modification\n\t\tYOU MUST Grant License\n\t\t\tATTRIBUTE Original license\n\t\tYOU MUST Provide Modification notice\n\t\tYOU MUST Provide Modification date\n\tYOU MUST NOT Restrict Granted rights\nUSE CASE Binary delivery\n\tEITHER\n\t\tYOU MUST Include Source code\n\t\t\tATTRIBUTE Machine-readable\n\t\tYOU MUST NOT Modify Copyright notice\n\t\tYOU MUST NOT Modify License notice\n\t\tYOU MUST NOT Modify Trademark notices\n\t\tYOU MUST NOT Modify Warranty disclaimer\n\t\tYOU MUST Forward License text\n\t\tIF Software modification\n\t\t\tYOU MUST Grant License\n\t\t\t\tATTRIBUTE Original license\n\t\t\tYOU MUST Provide Modification notice\n\t\t\tYOU MUST Provide Modification date\n\tOR\r\n\t\tYOU MUST Provide Delayed source code delivery\n\t\tYOU MUST Reference Source code\n\t\t\tATTRIBUTE No charges\n\t\t\tATTRIBUTE Duration As long as distributed\n\tYOU MUST NOT Restrict Granted rights\nCOMPATIBILITY BSD-2-Clause\r\nCOMPATIBILITY BSD-2-Clause-Patent\r\nCOMPATIBILITY BSD-3-Clause\r\nCOMPATIBILITY bzip2-1.0.5\r\nCOMPATIBILITY bzip2-1.0.6\r\nCOMPATIBILITY CC0-1.0\r\nCOMPATIBILITY curl\r\nCOMPATIBILITY ICU\r\nCOMPATIBILITY ISC\r\nCOMPATIBILITY Libpng\r\nCOMPATIBILITY MIT\r\nCOMPATIBILITY NTP\r\nCOMPATIBILITY UPL-1.0\r\nCOMPATIBILITY WTFPL\r\nCOMPATIBILITY X11\r\nCOMPATIBILITY Zlib\r\nINCOMPATIBILITY BSD-4-Clause\nINCOMPATIBILITY FTL\nINCOMPATIBILITY IJG\nINCOMPATIBILITY OpenSSL\nINCOMPATIBILITY Python-2.0\nINCOMPATIBILITY zlib-acknowledgement\nINCOMPATIBILITY XFree86-1.1\nPATENT HINTS Yes\nCOPYLEFT CLAUSE Yes\n","_implications":{"__impliedNames":["EUPL-1.1"],"__hasPatentHint":true,"__impliedCopyleft":[["OSADL License Checklist","Copyleft"]],"__calculatedCopyleft":"Copyleft"}},"Scancode":{"otherUrls":["http://www.gnu.org/licenses/license-list.html#EUPL","http://www.opensource.org/licenses/EUPL-1.1","http://www.osor.eu/eupl/european-union-public-licence-eupl-v.1.1","https://joinup.ec.europa.eu/sites/default/files/custom-page/attachment/eupl1.1.-licence-en_0.pdf","https://joinup.ec.europa.eu/software/page/eupl/licence-eupl","https://joinup.ec.europa.eu/system/files/EN/EUPL%20v.1.1%20-%20Licence.pdf","https://opensource.org/licenses/EUPL-1.1"],"homepageUrl":"http://ec.europa.eu/idabc/eupl","shortName":"EUPL 1.1","textUrls":null,"text":"European Union Public Licence \nV. 1.1 \n \nEUPL Â© the European Community 2007 \n \nThis European Union Public Licence (the \"EUPL\") applies to the Work or Software \n(as defined below) which is provided under the terms of this Licence. Any use of the \nWork, other than as authorised under this Licence is prohibited (to the extent such use \nis covered by a right of the copyright holder of the Work). \n \nThe Original Work is provided under the terms of this Licence when the Licensor (as \ndefined below) has placed the following notice immediately following the copyright \nnotice for the Original Work: \n \nLicensed under the EUPL V.1.1 \n \nor has expressed by any other mean his willingness to license under the EUPL. \n \n1. Definitions \n \nIn this Licence, the following terms have the following meaning: \n \n- The Licence: this Licence. \n \n- The Original Work or the Software: the software distributed and/or communicated \nby the Licensor under this Licence, available as Source Code and also as Executable \nCode as the case may be. \n \n- Derivative Works: the works or software that could be created by the Licensee, \nbased upon the Original Work or modifications thereof. This Licence does not define \nthe extent of modification or dependence on the Original Work required in order to \nclassify a work as a Derivative Work; this extent is determined by copyright law \napplicable in the country mentioned in Article 15.  \n \n- The Work: the Original Work and/or its Derivative Works. \n \n- The Source Code: the human-readable form of the Work which is the most \nconvenient for people to study and modify. \n \n- The Executable Code: any code which has generally been compiled and which is \nmeant to be interpreted by a computer as a program. \n \n- The Licensor: the natural or legal person that distributes and/or communicates the \nWork under the Licence. \n \n- Contributor(s): any natural or legal person who modifies the Work under the \nLicence, or otherwise contributes to the creation of a Derivative Work. \n \n- The Licensee or \"You\": any natural or legal person who makes any usage of the \nSoftware under the terms of the Licence. \n \n- Distribution and/or Communication: any act of selling, giving, lending, renting, \ndistributing, communicating, transmitting, or otherwise making available, on-line or \noff-line, copies of the Work or providing access to its essential functionalities at the \ndisposal of any other natural or legal person. \n \n2. Scope of the rights granted by the Licence \n \nThe Licensor hereby grants You a world-wide, royalty-free, non-exclusive, sub- \nlicensable licence to do the following, for the duration of copyright vested in the \nOriginal Work: \n \n- use the Work in any circumstance and for all usage, \n- reproduce the Work, \n- modify the Original Work, and make Derivative Works based upon the Work, \n- communicate to the public, including the right to make available or display the \nWork or copies thereof to the public and perform publicly, as the case may be, \nthe Work, \n- distribute the Work or copies thereof, \n- lend and rent the Work or copies thereof, \n- sub-license rights in the Work or copies thereof. \n \nThose rights can be exercised on any media, supports and formats, whether now \nknown or later invented, as far as the applicable law permits so. \n \nIn the countries where moral rights apply, the Licensor waives his right to exercise his \nmoral right to the extent allowed by law in order to make effective the licence of the \neconomic rights here above listed. \n \nThe Licensor grants to the Licensee royalty-free, non exclusive usage rights to any \npatents held by the Licensor, to the extent necessary to make use of the rights granted \non the Work under this Licence. \n \n3. Communication of the Source Code \n \nThe Licensor may provide the Work either in its Source Code form, or as Executable \nCode. If the Work is provided as Executable Code, the Licensor provides in addition a \nmachine-readable copy of the Source Code of the Work along with each copy of the \nWork that the Licensor distributes or indicates, in a notice following the copyright \nnotice attached to the Work, a repository where the Source Code is easily and freely \naccessible for as long as the Licensor continues to distribute and/or communicate the \nWork. \n   \n4. Limitations on copyright \n \nNothing in this Licence is intended to deprive the Licensee of the benefits from any \nexception or limitation to the exclusive rights of the rights owners in the Original \nWork or Software, of the exhaustion of those rights or of other applicable limitations \nthereto. \n \n5. Obligations of the Licensee \n \nThe grant of the rights mentioned above is subject to some restrictions and obligations \nimposed on the Licensee. Those obligations are the following: \n \nAttribution right: the Licensee shall keep intact all copyright, patent or trademarks \nnotices and all notices that refer to the Licence and to the disclaimer of warranties. \nThe Licensee must include a copy of such notices and a copy of the Licence with \nevery copy of the Work he/she distributes and/or communicates. The Licensee must \ncause any Derivative Work to carry prominent notices stating that the Work has been \nmodified and the date of modification. \n \nCopyleft clause: If the Licensee distributes and/or communicates copies of the \nOriginal Works or Derivative Works based upon the Original Work, this Distribution \nand/or Communication will be done under the terms of this Licence or of a later \nversion of this Licence unless the Original Work is expressly distributed only under \nthis version of the Licence. The Licensee (becoming Licensor) cannot offer or impose \nany additional terms or conditions on the Work or Derivative Work that alter or \nrestrict the terms of the Licence. \n \nCompatibility clause: If the Licensee Distributes and/or Communicates Derivative \nWorks or copies thereof based upon both the Original Work and another work  \nlicensed under a Compatible Licence, this Distribution and/or Communication can be \ndone under the terms of this Compatible Licence. For the sake of this clause, \n\"Compatible Licence\" refers to the licences listed in the appendix attached to this \nLicence. Should the Licenseeâs obligations under the Compatible Licence conflict \nwith his/her obligations under this Licence, the obligations of the Compatible Licence \nshall prevail.  \n \nProvision of Source Code: When distributing and/or communicating copies of the \nWork, the Licensee will provide a machine-readable copy of the Source Code or \nindicate a repository where this Source will be easily and freely available for as long \nas the Licensee continues to distribute and/or communicate the Work. \n \nLegal Protection: This Licence does not grant permission to use the trade names, \ntrademarks, service marks, or names of the Licensor, except as required for \nreasonable and customary use in describing the origin of the Work and reproducing \nthe content of the copyright notice. \n \n6. Chain of Authorship \n \nThe original Licensor warrants that the copyright in the Original Work granted \nhereunder is owned by him/her or licensed to him/her and that he/she has the power \nand authority to grant the Licence. \n \nEach Contributor warrants that the copyright in the modifications he/she brings to the \nWork are owned by him/her or licensed to him/her and that he/she has the power and \nauthority to grant the Licence. \n \nEach time You accept the Licence, the original Licensor and subsequent Contributors \ngrant You a licence to their contributions to the Work, under the terms of this \nLicence. \n \n7. Disclaimer of Warranty \n \nThe Work is a work in progress, which is continuously improved by numerous \ncontributors. It is not a finished work and may therefore contain defects or \"bugs\" \ninherent to this type of software development. \n \nFor the above reason, the Work is provided under the Licence on an \"as is\" basis and \nwithout warranties of any kind concerning the Work, including without limitation \nmerchantability, fitness for a particular purpose, absence of defects or errors, \naccuracy, non-infringement of intellectual property rights other than copyright as \nstated in Article 6 of this Licence. \n \nThis disclaimer of warranty is an essential part of the Licence and a condition for the \ngrant of any rights to the Work. \n \n8. Disclaimer of Liability \n \nExcept in the cases of wilful misconduct or damages directly caused to natural \npersons, the Licensor will in no event be liable for any direct or indirect, material or \nmoral, damages of any kind, arising out of the Licence or of the use of the Work, \nincluding without limitation, damages for loss of goodwill, work stoppage, computer \nfailure or malfunction, loss of data or any commercial damage, even if the Licensor \nhas been advised of the possibility of such damage. However, the Licensor will be \nliable under statutory product liability laws as far such laws apply to the Work. \n \n9. Additional agreements \n \nWhile distributing the Original Work or Derivative Works, You may choose to \nconclude an additional agreement to offer, and charge a fee for, acceptance of support, \nwarranty, indemnity, or other liability obligations and/or services consistent with this \nLicence. However, in accepting such obligations, You may act only on your own \nbehalf and on your sole responsibility, not on behalf of the original Licensor or any \nother Contributor, and only if You agree to indemnify, defend, and hold each \nContributor harmless for any liability incurred by, or claims asserted against such \nContributor by the fact You have accepted any such warranty or additional liability. \n\n10. Acceptance of the Licence \n \nThe provisions of this Licence can be accepted by clicking on an icon \"I agree\" \nplaced under the bottom of a window displaying the text of this Licence or by \naffirming consent in any other similar way, in accordance with the rules of applicable \nlaw. Clicking on that icon indicates your clear and irrevocable acceptance of this \nLicence and all of its terms and conditions.  \n \nSimilarly, you irrevocably accept this Licence and all of its terms and conditions by \nexercising any rights granted to You by Article 2 of this Licence, such as the use of \nthe Work, the creation by You of a Derivative Work or the Distribution and/or \nCommunication by You of the Work or copies thereof.  \n \n11. Information to the public \n \nIn case of any Distribution and/or Communication of the Work by means of electronic \ncommunication by You (for example, by offering to download the Work from a \nremote location) the distribution channel or media (for example, a website) must at \nleast provide to the public the information requested by the applicable law regarding \nthe Licensor, the Licence and the way it may be accessible, concluded, stored and \nreproduced by the Licensee. \n \n12. Termination of the Licence \n \nThe Licence and the rights granted hereunder will terminate automatically upon any \nbreach by the Licensee of the terms of the Licence. \n \nSuch a termination will not terminate the licences of any person who has received the \nWork from the Licensee under the Licence, provided such persons remain in full \ncompliance with the Licence.  \n \n13. Miscellaneous \n \nWithout prejudice of Article 9 above, the Licence represents the complete agreement \nbetween the Parties as to the Work licensed hereunder. \n \nIf any provision of the Licence is invalid or unenforceable under applicable law, this \nwill not affect the validity or enforceability of the Licence as a whole. Such provision \nwill be construed and/or reformed so as necessary to make it valid and enforceable. \n \nThe European Commission may publish other linguistic versions and/or new versions \nof this Licence, so far this is required and reasonable, without reducing the scope of \nthe rights granted by the Licence. New versions of the Licence will be published with \na unique version number. \n \nAll linguistic versions of this Licence, approved by the European Commission, have \nidentical value. Parties can take advantage of the linguistic version of their choice.  \n   \n14. Jurisdiction \n \nAny litigation resulting from the interpretation of this License, arising between the \nEuropean Commission, as a Licensor, and any Licensee, will be subject to the \njurisdiction of the Court of Justice of the European Communities, as laid down in \narticle 238 of the Treaty establishing the European Community. \n \nAny litigation arising between Parties, other than the European Commission, and \nresulting from the interpretation of this License, will be subject to the exclusive \njurisdiction of the competent court where the Licensor resides or conducts its primary \nbusiness. \n \n15. Applicable Law \n \nThis Licence shall be governed by the law of the European Union country where the \nLicensor resides or has his registered office. \n \nThis licence shall be governed by the Belgian law if: \n \n- a litigation arises between the European Commission, as a Licensor, and any \nLicensee; \n- the Licensor, other than the European Commission, has no residence or \nregistered office inside a European Union country.","category":"Copyleft Limited","osiUrl":null,"owner":"OSOR.eu","_sourceURL":"https://github.com/nexB/scancode-toolkit/blob/develop/src/licensedcode/data/licenses/eupl-1.1.yml","key":"eupl-1.1","name":"European Union Public Licence 1.1","spdxId":"EUPL-1.1","_implications":{"__impliedNames":["scancode://eupl-1.1","EUPL 1.1","EUPL-1.1"],"__impliedId":"EUPL-1.1","__impliedCopyleft":[["Scancode","WeakCopyleft"]],"__calculatedCopyleft":"WeakCopyleft","__impliedText":"European Union Public Licence \nV. 1.1 \n \nEUPL © the European Community 2007 \n \nThis European Union Public Licence (the \"EUPL\") applies to the Work or Software \n(as defined below) which is provided under the terms of this Licence. Any use of the \nWork, other than as authorised under this Licence is prohibited (to the extent such use \nis covered by a right of the copyright holder of the Work). \n \nThe Original Work is provided under the terms of this Licence when the Licensor (as \ndefined below) has placed the following notice immediately following the copyright \nnotice for the Original Work: \n \nLicensed under the EUPL V.1.1 \n \nor has expressed by any other mean his willingness to license under the EUPL. \n \n1. Definitions \n \nIn this Licence, the following terms have the following meaning: \n \n- The Licence: this Licence. \n \n- The Original Work or the Software: the software distributed and/or communicated \nby the Licensor under this Licence, available as Source Code and also as Executable \nCode as the case may be. \n \n- Derivative Works: the works or software that could be created by the Licensee, \nbased upon the Original Work or modifications thereof. This Licence does not define \nthe extent of modification or dependence on the Original Work required in order to \nclassify a work as a Derivative Work; this extent is determined by copyright law \napplicable in the country mentioned in Article 15.  \n \n- The Work: the Original Work and/or its Derivative Works. \n \n- The Source Code: the human-readable form of the Work which is the most \nconvenient for people to study and modify. \n \n- The Executable Code: any code which has generally been compiled and which is \nmeant to be interpreted by a computer as a program. \n \n- The Licensor: the natural or legal person that distributes and/or communicates the \nWork under the Licence. \n \n- Contributor(s): any natural or legal person who modifies the Work under the \nLicence, or otherwise contributes to the creation of a Derivative Work. \n \n- The Licensee or \"You\": any natural or legal person who makes any usage of the \nSoftware under the terms of the Licence. \n \n- Distribution and/or Communication: any act of selling, giving, lending, renting, \ndistributing, communicating, transmitting, or otherwise making available, on-line or \noff-line, copies of the Work or providing access to its essential functionalities at the \ndisposal of any other natural or legal person. \n \n2. Scope of the rights granted by the Licence \n \nThe Licensor hereby grants You a world-wide, royalty-free, non-exclusive, sub- \nlicensable licence to do the following, for the duration of copyright vested in the \nOriginal Work: \n \n- use the Work in any circumstance and for all usage, \n- reproduce the Work, \n- modify the Original Work, and make Derivative Works based upon the Work, \n- communicate to the public, including the right to make available or display the \nWork or copies thereof to the public and perform publicly, as the case may be, \nthe Work, \n- distribute the Work or copies thereof, \n- lend and rent the Work or copies thereof, \n- sub-license rights in the Work or copies thereof. \n \nThose rights can be exercised on any media, supports and formats, whether now \nknown or later invented, as far as the applicable law permits so. \n \nIn the countries where moral rights apply, the Licensor waives his right to exercise his \nmoral right to the extent allowed by law in order to make effective the licence of the \neconomic rights here above listed. \n \nThe Licensor grants to the Licensee royalty-free, non exclusive usage rights to any \npatents held by the Licensor, to the extent necessary to make use of the rights granted \non the Work under this Licence. \n \n3. Communication of the Source Code \n \nThe Licensor may provide the Work either in its Source Code form, or as Executable \nCode. If the Work is provided as Executable Code, the Licensor provides in addition a \nmachine-readable copy of the Source Code of the Work along with each copy of the \nWork that the Licensor distributes or indicates, in a notice following the copyright \nnotice attached to the Work, a repository where the Source Code is easily and freely \naccessible for as long as the Licensor continues to distribute and/or communicate the \nWork. \n   \n4. Limitations on copyright \n \nNothing in this Licence is intended to deprive the Licensee of the benefits from any \nexception or limitation to the exclusive rights of the rights owners in the Original \nWork or Software, of the exhaustion of those rights or of other applicable limitations \nthereto. \n \n5. Obligations of the Licensee \n \nThe grant of the rights mentioned above is subject to some restrictions and obligations \nimposed on the Licensee. Those obligations are the following: \n \nAttribution right: the Licensee shall keep intact all copyright, patent or trademarks \nnotices and all notices that refer to the Licence and to the disclaimer of warranties. \nThe Licensee must include a copy of such notices and a copy of the Licence with \nevery copy of the Work he/she distributes and/or communicates. The Licensee must \ncause any Derivative Work to carry prominent notices stating that the Work has been \nmodified and the date of modification. \n \nCopyleft clause: If the Licensee distributes and/or communicates copies of the \nOriginal Works or Derivative Works based upon the Original Work, this Distribution \nand/or Communication will be done under the terms of this Licence or of a later \nversion of this Licence unless the Original Work is expressly distributed only under \nthis version of the Licence. The Licensee (becoming Licensor) cannot offer or impose \nany additional terms or conditions on the Work or Derivative Work that alter or \nrestrict the terms of the Licence. \n \nCompatibility clause: If the Licensee Distributes and/or Communicates Derivative \nWorks or copies thereof based upon both the Original Work and another work  \nlicensed under a Compatible Licence, this Distribution and/or Communication can be \ndone under the terms of this Compatible Licence. For the sake of this clause, \n\"Compatible Licence\" refers to the licences listed in the appendix attached to this \nLicence. Should the Licensee’s obligations under the Compatible Licence conflict \nwith his/her obligations under this Licence, the obligations of the Compatible Licence \nshall prevail.  \n \nProvision of Source Code: When distributing and/or communicating copies of the \nWork, the Licensee will provide a machine-readable copy of the Source Code or \nindicate a repository where this Source will be easily and freely available for as long \nas the Licensee continues to distribute and/or communicate the Work. \n \nLegal Protection: This Licence does not grant permission to use the trade names, \ntrademarks, service marks, or names of the Licensor, except as required for \nreasonable and customary use in describing the origin of the Work and reproducing \nthe content of the copyright notice. \n \n6. Chain of Authorship \n \nThe original Licensor warrants that the copyright in the Original Work granted \nhereunder is owned by him/her or licensed to him/her and that he/she has the power \nand authority to grant the Licence. \n \nEach Contributor warrants that the copyright in the modifications he/she brings to the \nWork are owned by him/her or licensed to him/her and that he/she has the power and \nauthority to grant the Licence. \n \nEach time You accept the Licence, the original Licensor and subsequent Contributors \ngrant You a licence to their contributions to the Work, under the terms of this \nLicence. \n \n7. Disclaimer of Warranty \n \nThe Work is a work in progress, which is continuously improved by numerous \ncontributors. It is not a finished work and may therefore contain defects or \"bugs\" \ninherent to this type of software development. \n \nFor the above reason, the Work is provided under the Licence on an \"as is\" basis and \nwithout warranties of any kind concerning the Work, including without limitation \nmerchantability, fitness for a particular purpose, absence of defects or errors, \naccuracy, non-infringement of intellectual property rights other than copyright as \nstated in Article 6 of this Licence. \n \nThis disclaimer of warranty is an essential part of the Licence and a condition for the \ngrant of any rights to the Work. \n \n8. Disclaimer of Liability \n \nExcept in the cases of wilful misconduct or damages directly caused to natural \npersons, the Licensor will in no event be liable for any direct or indirect, material or \nmoral, damages of any kind, arising out of the Licence or of the use of the Work, \nincluding without limitation, damages for loss of goodwill, work stoppage, computer \nfailure or malfunction, loss of data or any commercial damage, even if the Licensor \nhas been advised of the possibility of such damage. However, the Licensor will be \nliable under statutory product liability laws as far such laws apply to the Work. \n \n9. Additional agreements \n \nWhile distributing the Original Work or Derivative Works, You may choose to \nconclude an additional agreement to offer, and charge a fee for, acceptance of support, \nwarranty, indemnity, or other liability obligations and/or services consistent with this \nLicence. However, in accepting such obligations, You may act only on your own \nbehalf and on your sole responsibility, not on behalf of the original Licensor or any \nother Contributor, and only if You agree to indemnify, defend, and hold each \nContributor harmless for any liability incurred by, or claims asserted against such \nContributor by the fact You have accepted any such warranty or additional liability. \n\n10. Acceptance of the Licence \n \nThe provisions of this Licence can be accepted by clicking on an icon \"I agree\" \nplaced under the bottom of a window displaying the text of this Licence or by \naffirming consent in any other similar way, in accordance with the rules of applicable \nlaw. Clicking on that icon indicates your clear and irrevocable acceptance of this \nLicence and all of its terms and conditions.  \n \nSimilarly, you irrevocably accept this Licence and all of its terms and conditions by \nexercising any rights granted to You by Article 2 of this Licence, such as the use of \nthe Work, the creation by You of a Derivative Work or the Distribution and/or \nCommunication by You of the Work or copies thereof.  \n \n11. Information to the public \n \nIn case of any Distribution and/or Communication of the Work by means of electronic \ncommunication by You (for example, by offering to download the Work from a \nremote location) the distribution channel or media (for example, a website) must at \nleast provide to the public the information requested by the applicable law regarding \nthe Licensor, the Licence and the way it may be accessible, concluded, stored and \nreproduced by the Licensee. \n \n12. Termination of the Licence \n \nThe Licence and the rights granted hereunder will terminate automatically upon any \nbreach by the Licensee of the terms of the Licence. \n \nSuch a termination will not terminate the licences of any person who has received the \nWork from the Licensee under the Licence, provided such persons remain in full \ncompliance with the Licence.  \n \n13. Miscellaneous \n \nWithout prejudice of Article 9 above, the Licence represents the complete agreement \nbetween the Parties as to the Work licensed hereunder. \n \nIf any provision of the Licence is invalid or unenforceable under applicable law, this \nwill not affect the validity or enforceability of the Licence as a whole. Such provision \nwill be construed and/or reformed so as necessary to make it valid and enforceable. \n \nThe European Commission may publish other linguistic versions and/or new versions \nof this Licence, so far this is required and reasonable, without reducing the scope of \nthe rights granted by the Licence. New versions of the Licence will be published with \na unique version number. \n \nAll linguistic versions of this Licence, approved by the European Commission, have \nidentical value. Parties can take advantage of the linguistic version of their choice.  \n   \n14. Jurisdiction \n \nAny litigation resulting from the interpretation of this License, arising between the \nEuropean Commission, as a Licensor, and any Licensee, will be subject to the \njurisdiction of the Court of Justice of the European Communities, as laid down in \narticle 238 of the Treaty establishing the European Community. \n \nAny litigation arising between Parties, other than the European Commission, and \nresulting from the interpretation of this License, will be subject to the exclusive \njurisdiction of the competent court where the Licensor resides or conducts its primary \nbusiness. \n \n15. Applicable Law \n \nThis Licence shall be governed by the law of the European Union country where the \nLicensor resides or has his registered office. \n \nThis licence shall be governed by the Belgian law if: \n \n- a litigation arises between the European Commission, as a Licensor, and any \nLicensee; \n- the Licensor, other than the European Commission, has no residence or \nregistered office inside a European Union country.","__impliedURLs":[["Homepage","http://ec.europa.eu/idabc/eupl"],[null,"http://www.gnu.org/licenses/license-list.html#EUPL"],[null,"http://www.opensource.org/licenses/EUPL-1.1"],[null,"http://www.osor.eu/eupl/european-union-public-licence-eupl-v.1.1"],[null,"https://joinup.ec.europa.eu/sites/default/files/custom-page/attachment/eupl1.1.-licence-en_0.pdf"],[null,"https://joinup.ec.europa.eu/software/page/eupl/licence-eupl"],[null,"https://joinup.ec.europa.eu/system/files/EN/EUPL%20v.1.1%20-%20Licence.pdf"],[null,"https://opensource.org/licenses/EUPL-1.1"]]}},"OpenChainPolicyTemplate":{"isSaaSDeemed":"no","licenseType":"copyleft","freedomOrDeath":"no","typeCopyleft":"yes","_sourceURL":"https://github.com/OpenChain-Project/curriculum/raw/ddf1e879341adbd9b297cd67c5d5c16b2076540b/policy-template/Open%20Source%20Policy%20Template%20for%20OpenChain%20Specification%201.2.ods","name":"European Union Public License, Version 1.1","commercialUse":true,"spdxId":"EUPL-1.1","_implications":{"__impliedNames":["EUPL-1.1"]}},"OpenSourceInitiative":{"text":[{"url":"https://opensource.org/licenses/EUPL-1.1","title":"HTML","media_type":"text/html"}],"identifiers":[{"identifier":"EUPL-1.1","scheme":"SPDX"},{"identifier":"License :: OSI Approved :: European Union Public Licence 1.1 (EUPL 1.1)","scheme":"Trove"}],"superseded_by":null,"_sourceURL":"https://opensource.org/licenses/","name":"European Union Public License, Version 1.1","other_names":[],"keywords":["osi-approved"],"id":"EUPL-1.1","links":[{"note":"OSI Page","url":"https://opensource.org/licenses/EUPL-1.1"}],"_implications":{"__impliedNames":["EUPL-1.1","European Union Public License, Version 1.1","EUPL-1.1","License :: OSI Approved :: European Union Public Licence 1.1 (EUPL 1.1)"],"__impliedURLs":[["OSI Page","https://opensource.org/licenses/EUPL-1.1"]]}},"choosealicense.com":{"limitations":["liability","trademark-use","warranty"],"_sourceURL":"https://github.com/github/choosealicense.com/blob/gh-pages/_licenses/eupl-1.1.txt","content":"---\ntitle: European Union Public License 1.1\nspdx-id: EUPL-1.1\nredirect_from: /licenses/eupl-v1.1/\n\ndescription: The âEuropean Union Public Licenceâ (EUPL) is a copyleft free/open source software license created on the initiative of and approved by the European Commission in 22 official languages of the European Union.\n\nhow: Create a text file (typically named COPYING or LICENCE.txt) in the root of your source code and copy the text of the license into the file.\n\nnote: The European Commission recommends taking the additional step of adding a [boilerplate notice](https://joinup.ec.europa.eu/sites/default/files/ckeditor_files/files/EUPL%201_1%20Guidelines%20EN%20Joinup.pdf#page=17) to the top of each file.\n\nusing:\n\npermissions:\n  - commercial-use\n  - modifications\n  - distribution\n  - patent-use\n  - private-use\n\nconditions:\n  - include-copyright\n  - disclose-source\n  - document-changes\n  - network-use-disclose\n  - same-license\n\nlimitations:\n  - liability\n  - trademark-use\n  - warranty\n\n---\n\nEuropean Union Public Licence\nV. 1.1\n\n\nEUPL Â© the European Community 2007\n\n\nThis European Union Public Licence (the âEUPLâ) applies to the\nWork or Software (as defined below) which is provided under the terms of this\nLicence. Any use of the Work, other than as authorised under this Licence is\nprohibited (to the extent such use is covered by a right of the copyright\nholder of the Work).\n\nThe Original Work is provided under the terms of this\nLicence when the Licensor (as defined below) has placed the following notice\nimmediately following the copyright notice for the Original Work:\n\nLicensed under the EUPL V.1.1\n\nor has expressed by any other mean his willingness to license under the EUPL.\n\n\n1. Definitions\n\nIn this Licence, the\nfollowing terms have the following meaning:\n\n- The Licence: this Licence.\n\n- The Original Work or the Software: the software distributed\nand/or communicated by the Licensor under this Licence, available as Source\nCode and also as Executable Code as the case may be.\n\n- Derivative Works:\nthe works or software that could be created by the Licensee, based upon the\nOriginal Work or modifications thereof. This Licence does not define the\nextent of modification or dependence on the Original Work required in order to\nclassify a work as a Derivative Work; this extent is determined by copyright\nlaw applicable in the country mentioned in Article 15.\n\n- The Work: the Original Work and/or its Derivative Works.\n\n- The Source Code: the human-readable form of the Work which is the most\nconvenient for people to study and modify.\n\n- The Executable Code: any code which has generally been compiled and which\nis meant to be interpreted by a computer as a program.\n\n- The Licensor: the natural or legal person that distributes and/or\ncommunicates the Work under the Licence.\n\n- Contributor(s): any natural or legal person who modifies the Work under the\nLicence, or otherwise contributes to the creation of a Derivative Work.\n\n- The Licensee or âYouâ: any natural or legal person who makes any usage of\nthe Software under the terms of the Licence.\n\n- Distribution and/or Communication: any act of selling, giving, lending,\nrenting, distributing, communicating, transmitting, or otherwise\nmaking available, on-line or off-line, copies of the Work or providing access\nto its essential functionalities at the disposal of any other natural or legal\nperson.\n\n\n2. Scope of the rights granted by the Licence\n\nThe Licensor hereby grants You a world-wide, royalty-free, non-exclusive,\nsub-licensable licence to do the following, for the duration of copyright\nvested in the Original Work:\n\n- use the Work in any circumstance and for all usage,\n- reproduce the Work,\n- modify the Original Work, and make Derivative Works\nbased upon the Work,\n- communicate to the public, including the right to make available or display\nthe Work or copies thereof to the public and perform publicly, as the case\nmay be, the Work,\n- distribute the Work or copies thereof,\n- lend and rent the Work or copies thereof,\n- sub-license rights in the Work or copies thereof.\n\nThose rights can be exercised on any media, supports and formats, whether now\nknown or later invented, as far as the applicable law permits so.\n\nIn the countries where moral rights apply, the Licensor waives his right to\nexercise his moral right to the extent allowed by law in order to make\neffective the licence of the economic rights here above listed.\n\nThe Licensor grants to the Licensee royalty-free, non exclusive usage rights\nto any patents held by the Licensor, to the extent necessary to make use of\nthe rights granted on the Work under this Licence.\n\n\n3. Communication of the Source Code\n\nThe Licensor may provide the Work either\nin its Source Code form, or as Executable Code. If the Work is provided as\nExecutable Code, the Licensor provides in addition a machine-readable copy of\nthe Source Code of the Work along with each copy of the Work that the Licensor\ndistributes or indicates, in a notice following the copyright notice attached\nto the Work, a repository where the Source Code is easily and freely\naccessible for as long as the Licensor continues to distribute and/or\ncommunicate the Work.\n\n\n4. Limitations on copyright\n\nNothing in this Licence is intended to deprive the Licensee of the benefits\nfrom any exception or limitation to the exclusive rights of the rights owners\nin the Original Work or Software, of the exhaustion of those rights or of\nother applicable limitations thereto.\n\n\n5. Obligations of the Licensee\n\nThe grant of the rights mentioned above is subject to some restrictions and\nobligations imposed on the Licensee. Those obligations are the following:\n\nAttribution right:\nthe Licensee shall keep intact all copyright, patent or trademarks notices and\nall notices that refer to the Licence and to the disclaimer of warranties. The\nLicensee must include a copy of such notices and a copy of the Licence with\nevery copy of the Work he/she distributes and/or communicates. The Licensee\nmust cause any Derivative Work to carry prominent notices stating that the\nWork has been modified and the date of modification.\n\nCopyleft clause:\nIf the Licensee distributes and/or communicates copies of the Original Works\nor Derivative Works based upon the Original Work, this Distribution and/or\nCommunication will be done under the terms of this Licence or of a later\nversion of this Licence unless the Original Work is expressly distributed only\nunder this version of the Licence. The Licensee (becoming Licensor) cannot\noffer or impose any additional terms or conditions on the Work or Derivative\nWork that alter or restrict the terms of the Licence.\n\nCompatibility clause:\nIf the Licensee Distributes and/or Communicates Derivative Works or copies\nthereof based upon both the Original Work and another work  licensed under a\nCompatible Licence, this Distribution and/or Communication can be done under\nthe terms of this Compatible Licence. For the sake of this clause,\nâCompatible Licenceâ refers to the licences listed in the appendix\nattached to this Licence. Should the Licenseeâs obligations under the\nCompatible Licence conflict with his/her obligations under this Licence, the\nobligations of the Compatible Licence shall prevail.\n\nProvision of Source Code:\nWhen distributing and/or communicating copies of the Work, the Licensee\nwill provide a machine-readable copy of the Source Code or indicate a\nrepository where this Source will be easily and freely available for as long\nas the Licensee continues to distribute and/or communicate the Work.\n\nLegal Protection:\nThis Licence does not grant permission to use the trade names,\ntrademarks, service marks, or names of the Licensor, except as required for\nreasonable and customary use in describing the origin of the Work and\nreproducing the content of the copyright notice.\n\n\n6. Chain of Authorship\n\nThe original Licensor warrants that the copyright in the Original Work\ngranted hereunder is owned by him/her or licensed to him/her and\nthat he/she has the power and authority to grant the Licence.\n\nEach Contributor warrants that the copyright in the modifications he/she\nbrings to the Work are owned by him/her or licensed to him/her and that\nhe/she has the power and authority to grant the Licence.\n\nEach time You accept the Licence, the original Licensor and subsequent\nContributors grant You a licence to their contributions to the Work, under\nthe terms of this Licence.\n\n\n7. Disclaimer of Warranty\n\nThe Work is a work in progress, which is continuously improved by numerous\ncontributors. It is not a finished work and may therefore contain defects or\nâbugsâ inherent to this type of software development.\n\nFor the above reason, the Work is provided under the Licence on an âas isâ\nbasis and without warranties of any kind concerning the Work, including\nwithout limitation merchantability, fitness for a particular purpose, absence\nof defects or errors, accuracy, non-infringement of intellectual property\nrights other than copyright as stated in Article 6 of this Licence.\n\nThis disclaimer of warranty is an essential part of the Licence and a\ncondition for the grant of any rights to the Work.\n\n\n8. Disclaimer of Liability\n\nExcept in the cases of wilful misconduct or damages directly caused to\nnatural persons, the Licensor will in no event be liable for any direct or\nindirect, material or moral, damages of any kind, arising out of the Licence\nor of the use of the Work, including without limitation,\ndamages for loss of goodwill, work stoppage, computer failure or malfunction,\nloss of data or any commercial damage, even if the Licensor has been advised\nof the possibility of such damage. However, the Licensor will be liable under\nstatutory product liability laws as far such laws apply to the Work.\n\n\n9. Additional agreements\n\nWhile distributing the Original Work or Derivative Works, You may choose\nto conclude an additional agreement to offer, and charge a fee for,\nacceptance of support, warranty, indemnity, or other liability\nobligations and/or services consistent with this Licence. However, in\naccepting such obligations, You may act only on your own behalf and on your\nsole responsibility, not on behalf of the original Licensor or any other\nContributor, and only if You agree to indemnify, defend, and hold each\nContributor harmless for any liability incurred by, or claims asserted against\nsuch Contributor by the fact You have accepted any such warranty or additional\nliability.\n\n\n10. Acceptance of the Licence\n\nThe provisions of this Licence can be accepted by clicking on\nan icon âI agreeâ placed under the bottom of a window displaying the text of\nthis Licence or by affirming consent in any other similar way, in accordance\nwith the rules of applicable law. Clicking on that icon indicates your clear\nand irrevocable acceptance of this Licence and\nall of its terms and conditions.\n\nSimilarly, you irrevocably accept this Licence and\nall of its terms and conditions by exercising any rights granted to You\nby Article 2 of this Licence, such as the use of the Work,\nthe creation by You of a Derivative Work or the Distribution and/or\nCommunication by You of the Work or copies thereof.\n\n\n11. Information to the public\n\nIn case of any Distribution and/or Communication of the Work by means of\nelectronic communication by You (for example, by offering to download\nthe Work from a remote location) the distribution channel or media (for\nexample, a website) must at least provide to the public the information\nrequested by the applicable law regarding the Licensor, the Licence and the\nway it may be accessible, concluded, stored and reproduced by the\nLicensee.\n\n\n12. Termination of the Licence\n\nThe Licence and the rights granted hereunder will terminate automatically\nupon any breach by the Licensee of the terms of the Licence.\n\nSuch a termination will not terminate the licences of any person who has\nreceived the Work from the Licensee under the Licence, provided such persons\nremain in full compliance with the Licence.\n\n\n13. Miscellaneous\n\nWithout prejudice of Article 9 above, the Licence represents the complete\nagreement between the Parties as to the Work licensed hereunder.\n\nIf any provision of the Licence is invalid or unenforceable under applicable\nlaw, this will not affect the validity or enforceability of the Licence as a\nwhole. Such provision will be construed and/or reformed so as necessary\nto make it valid and enforceable.\n\nThe European Commission may publish other linguistic versions and/or new\nversions of this Licence, so far this is required and reasonable, without\nreducing the scope of the rights granted by the Licence.\nNew versions of the Licence will be published with a unique version number.\n\nAll linguistic versions of this Licence, approved by the European Commission,\nhave identical value. Parties can take advantage of the linguistic version\nof their choice.\n\n\n14. Jurisdiction\n\nAny litigation resulting from the interpretation of this License, arising\nbetween the European Commission, as a Licensor, and any Licensee,\nwill be subject to the jurisdiction of the Court of Justice of the\nEuropean Communities, as laid down in article 238 of the Treaty establishing\nthe European Community.\n\nAny litigation arising between Parties, other than the European Commission,\nand resulting from the interpretation of this License, will be subject to the\nexclusive jurisdiction of the competent court where the Licensor resides or\nconducts its primary business.\n\n\n15. Applicable Law\n\nThis Licence shall be governed by the law of the European Union country where\nthe Licensor resides or has his registered office.\n\nThis licence shall be governed by the Belgian law if:\n\n- a litigation arises between the European Commission, as a Licensor, and any\nLicensee;\n- the Licensor, other than the European Commission, has no residence or\nregistered office inside a European Union country.\n\n\n===\n\n\nAppendix\n\n\nâCompatible Licencesâ according to article 5 EUPL are:\n- GNU General Public License (GNU GPL) v. 2\n- Open Software License (OSL) v. 2.1, v. 3.0\n- Common Public License v. 1.0\n- Eclipse Public License v. 1.0\n- Cecill v. 2.0\n","name":"eupl-1.1","hidden":null,"spdxId":"EUPL-1.1","conditions":["include-copyright","disclose-source","document-changes","network-use-disclose","same-license"],"permissions":["commercial-use","modifications","distribution","patent-use","private-use"],"featured":null,"nickname":null,"how":"Create a text file (typically named COPYING or LICENCE.txt) in the root of your source code and copy the text of the license into the file.","title":"European Union Public License 1.1","_implications":{"__impliedNames":["eupl-1.1","EUPL-1.1"],"__obligations":{"limitations":[{"tag":"ImpliedLimitation","contents":"liability"},{"tag":"ImpliedLimitation","contents":"trademark-use"},{"tag":"ImpliedLimitation","contents":"warranty"}],"rights":[{"tag":"ImpliedRight","contents":"commercial-use"},{"tag":"ImpliedRight","contents":"modifications"},{"tag":"ImpliedRight","contents":"distribution"},{"tag":"ImpliedRight","contents":"patent-use"},{"tag":"ImpliedRight","contents":"private-use"}],"conditions":[{"tag":"ImpliedCondition","contents":"include-copyright"},{"tag":"ImpliedCondition","contents":"disclose-source"},{"tag":"ImpliedCondition","contents":"document-changes"},{"tag":"ImpliedCondition","contents":"network-use-disclose"},{"tag":"ImpliedCondition","contents":"same-license"}]}},"description":"The âEuropean Union Public Licenceâ (EUPL) is a copyleft free/open source software license created on the initiative of and approved by the European Commission in 22 official languages of the European Union."},"Google OSS Policy":{"rating":"CANNOT_BE_USED","_sourceURL":"https://opensource.google.com/docs/thirdparty/licenses/","id":"EUPL-1.1","_implications":{"__impliedNames":["EUPL-1.1"],"__impliedJudgement":[["Google OSS Policy",{"tag":"NegativeJudgement","contents":"Google Classification is CANNOT_BE_USED \"The EUPL is very similar to the AGPL. For the same reasons that the AGPL is banned, the use of EUPL-licensed software is not allowed at Google.\""}]]},"description":"The EUPL is very similar to the AGPL. For the same reasons that the AGPL is banned, the use of EUPL-licensed software is not allowed at Google."}},"__impliedJudgement":[["Google OSS Policy",{"tag":"NegativeJudgement","contents":"Google Classification is CANNOT_BE_USED \"The EUPL is very similar to the AGPL. For the same reasons that the AGPL is banned, the use of EUPL-licensed software is not allowed at Google.\""}],["SPDX",{"tag":"PositiveJudgement","contents":"Is OSI Approved"}]],"__impliedCopyleft":[["OSADL License Checklist","Copyleft"],["Scancode","WeakCopyleft"]],"__calculatedCopyleft":"WeakCopyleft","__obligations":{"limitations":[{"tag":"ImpliedLimitation","contents":"liability"},{"tag":"ImpliedLimitation","contents":"trademark-use"},{"tag":"ImpliedLimitation","contents":"warranty"}],"rights":[{"tag":"ImpliedRight","contents":"commercial-use"},{"tag":"ImpliedRight","contents":"modifications"},{"tag":"ImpliedRight","contents":"distribution"},{"tag":"ImpliedRight","contents":"patent-use"},{"tag":"ImpliedRight","contents":"private-use"}],"conditions":[{"tag":"ImpliedCondition","contents":"include-copyright"},{"tag":"ImpliedCondition","contents":"disclose-source"},{"tag":"ImpliedCondition","contents":"document-changes"},{"tag":"ImpliedCondition","contents":"network-use-disclose"},{"tag":"ImpliedCondition","contents":"same-license"}]},"__isOsiApproved":true,"__impliedText":"European Union Public Licence \nV. 1.1 \n \nEUPL © the European Community 2007 \n \nThis European Union Public Licence (the \"EUPL\") applies to the Work or Software \n(as defined below) which is provided under the terms of this Licence. Any use of the \nWork, other than as authorised under this Licence is prohibited (to the extent such use \nis covered by a right of the copyright holder of the Work). \n \nThe Original Work is provided under the terms of this Licence when the Licensor (as \ndefined below) has placed the following notice immediately following the copyright \nnotice for the Original Work: \n \nLicensed under the EUPL V.1.1 \n \nor has expressed by any other mean his willingness to license under the EUPL. \n \n1. Definitions \n \nIn this Licence, the following terms have the following meaning: \n \n- The Licence: this Licence. \n \n- The Original Work or the Software: the software distributed and/or communicated \nby the Licensor under this Licence, available as Source Code and also as Executable \nCode as the case may be. \n \n- Derivative Works: the works or software that could be created by the Licensee, \nbased upon the Original Work or modifications thereof. This Licence does not define \nthe extent of modification or dependence on the Original Work required in order to \nclassify a work as a Derivative Work; this extent is determined by copyright law \napplicable in the country mentioned in Article 15.  \n \n- The Work: the Original Work and/or its Derivative Works. \n \n- The Source Code: the human-readable form of the Work which is the most \nconvenient for people to study and modify. \n \n- The Executable Code: any code which has generally been compiled and which is \nmeant to be interpreted by a computer as a program. \n \n- The Licensor: the natural or legal person that distributes and/or communicates the \nWork under the Licence. \n \n- Contributor(s): any natural or legal person who modifies the Work under the \nLicence, or otherwise contributes to the creation of a Derivative Work. \n \n- The Licensee or \"You\": any natural or legal person who makes any usage of the \nSoftware under the terms of the Licence. \n \n- Distribution and/or Communication: any act of selling, giving, lending, renting, \ndistributing, communicating, transmitting, or otherwise making available, on-line or \noff-line, copies of the Work or providing access to its essential functionalities at the \ndisposal of any other natural or legal person. \n \n2. Scope of the rights granted by the Licence \n \nThe Licensor hereby grants You a world-wide, royalty-free, non-exclusive, sub- \nlicensable licence to do the following, for the duration of copyright vested in the \nOriginal Work: \n \n- use the Work in any circumstance and for all usage, \n- reproduce the Work, \n- modify the Original Work, and make Derivative Works based upon the Work, \n- communicate to the public, including the right to make available or display the \nWork or copies thereof to the public and perform publicly, as the case may be, \nthe Work, \n- distribute the Work or copies thereof, \n- lend and rent the Work or copies thereof, \n- sub-license rights in the Work or copies thereof. \n \nThose rights can be exercised on any media, supports and formats, whether now \nknown or later invented, as far as the applicable law permits so. \n \nIn the countries where moral rights apply, the Licensor waives his right to exercise his \nmoral right to the extent allowed by law in order to make effective the licence of the \neconomic rights here above listed. \n \nThe Licensor grants to the Licensee royalty-free, non exclusive usage rights to any \npatents held by the Licensor, to the extent necessary to make use of the rights granted \non the Work under this Licence. \n \n3. Communication of the Source Code \n \nThe Licensor may provide the Work either in its Source Code form, or as Executable \nCode. If the Work is provided as Executable Code, the Licensor provides in addition a \nmachine-readable copy of the Source Code of the Work along with each copy of the \nWork that the Licensor distributes or indicates, in a notice following the copyright \nnotice attached to the Work, a repository where the Source Code is easily and freely \naccessible for as long as the Licensor continues to distribute and/or communicate the \nWork. \n   \n4. Limitations on copyright \n \nNothing in this Licence is intended to deprive the Licensee of the benefits from any \nexception or limitation to the exclusive rights of the rights owners in the Original \nWork or Software, of the exhaustion of those rights or of other applicable limitations \nthereto. \n \n5. Obligations of the Licensee \n \nThe grant of the rights mentioned above is subject to some restrictions and obligations \nimposed on the Licensee. Those obligations are the following: \n \nAttribution right: the Licensee shall keep intact all copyright, patent or trademarks \nnotices and all notices that refer to the Licence and to the disclaimer of warranties. \nThe Licensee must include a copy of such notices and a copy of the Licence with \nevery copy of the Work he/she distributes and/or communicates. The Licensee must \ncause any Derivative Work to carry prominent notices stating that the Work has been \nmodified and the date of modification. \n \nCopyleft clause: If the Licensee distributes and/or communicates copies of the \nOriginal Works or Derivative Works based upon the Original Work, this Distribution \nand/or Communication will be done under the terms of this Licence or of a later \nversion of this Licence unless the Original Work is expressly distributed only under \nthis version of the Licence. The Licensee (becoming Licensor) cannot offer or impose \nany additional terms or conditions on the Work or Derivative Work that alter or \nrestrict the terms of the Licence. \n \nCompatibility clause: If the Licensee Distributes and/or Communicates Derivative \nWorks or copies thereof based upon both the Original Work and another work  \nlicensed under a Compatible Licence, this Distribution and/or Communication can be \ndone under the terms of this Compatible Licence. For the sake of this clause, \n\"Compatible Licence\" refers to the licences listed in the appendix attached to this \nLicence. Should the Licensee’s obligations under the Compatible Licence conflict \nwith his/her obligations under this Licence, the obligations of the Compatible Licence \nshall prevail.  \n \nProvision of Source Code: When distributing and/or communicating copies of the \nWork, the Licensee will provide a machine-readable copy of the Source Code or \nindicate a repository where this Source will be easily and freely available for as long \nas the Licensee continues to distribute and/or communicate the Work. \n \nLegal Protection: This Licence does not grant permission to use the trade names, \ntrademarks, service marks, or names of the Licensor, except as required for \nreasonable and customary use in describing the origin of the Work and reproducing \nthe content of the copyright notice. \n \n6. Chain of Authorship \n \nThe original Licensor warrants that the copyright in the Original Work granted \nhereunder is owned by him/her or licensed to him/her and that he/she has the power \nand authority to grant the Licence. \n \nEach Contributor warrants that the copyright in the modifications he/she brings to the \nWork are owned by him/her or licensed to him/her and that he/she has the power and \nauthority to grant the Licence. \n \nEach time You accept the Licence, the original Licensor and subsequent Contributors \ngrant You a licence to their contributions to the Work, under the terms of this \nLicence. \n \n7. Disclaimer of Warranty \n \nThe Work is a work in progress, which is continuously improved by numerous \ncontributors. It is not a finished work and may therefore contain defects or \"bugs\" \ninherent to this type of software development. \n \nFor the above reason, the Work is provided under the Licence on an \"as is\" basis and \nwithout warranties of any kind concerning the Work, including without limitation \nmerchantability, fitness for a particular purpose, absence of defects or errors, \naccuracy, non-infringement of intellectual property rights other than copyright as \nstated in Article 6 of this Licence. \n \nThis disclaimer of warranty is an essential part of the Licence and a condition for the \ngrant of any rights to the Work. \n \n8. Disclaimer of Liability \n \nExcept in the cases of wilful misconduct or damages directly caused to natural \npersons, the Licensor will in no event be liable for any direct or indirect, material or \nmoral, damages of any kind, arising out of the Licence or of the use of the Work, \nincluding without limitation, damages for loss of goodwill, work stoppage, computer \nfailure or malfunction, loss of data or any commercial damage, even if the Licensor \nhas been advised of the possibility of such damage. However, the Licensor will be \nliable under statutory product liability laws as far such laws apply to the Work. \n \n9. Additional agreements \n \nWhile distributing the Original Work or Derivative Works, You may choose to \nconclude an additional agreement to offer, and charge a fee for, acceptance of support, \nwarranty, indemnity, or other liability obligations and/or services consistent with this \nLicence. However, in accepting such obligations, You may act only on your own \nbehalf and on your sole responsibility, not on behalf of the original Licensor or any \nother Contributor, and only if You agree to indemnify, defend, and hold each \nContributor harmless for any liability incurred by, or claims asserted against such \nContributor by the fact You have accepted any such warranty or additional liability. \n\n10. Acceptance of the Licence \n \nThe provisions of this Licence can be accepted by clicking on an icon \"I agree\" \nplaced under the bottom of a window displaying the text of this Licence or by \naffirming consent in any other similar way, in accordance with the rules of applicable \nlaw. Clicking on that icon indicates your clear and irrevocable acceptance of this \nLicence and all of its terms and conditions.  \n \nSimilarly, you irrevocably accept this Licence and all of its terms and conditions by \nexercising any rights granted to You by Article 2 of this Licence, such as the use of \nthe Work, the creation by You of a Derivative Work or the Distribution and/or \nCommunication by You of the Work or copies thereof.  \n \n11. Information to the public \n \nIn case of any Distribution and/or Communication of the Work by means of electronic \ncommunication by You (for example, by offering to download the Work from a \nremote location) the distribution channel or media (for example, a website) must at \nleast provide to the public the information requested by the applicable law regarding \nthe Licensor, the Licence and the way it may be accessible, concluded, stored and \nreproduced by the Licensee. \n \n12. Termination of the Licence \n \nThe Licence and the rights granted hereunder will terminate automatically upon any \nbreach by the Licensee of the terms of the Licence. \n \nSuch a termination will not terminate the licences of any person who has received the \nWork from the Licensee under the Licence, provided such persons remain in full \ncompliance with the Licence.  \n \n13. Miscellaneous \n \nWithout prejudice of Article 9 above, the Licence represents the complete agreement \nbetween the Parties as to the Work licensed hereunder. \n \nIf any provision of the Licence is invalid or unenforceable under applicable law, this \nwill not affect the validity or enforceability of the Licence as a whole. Such provision \nwill be construed and/or reformed so as necessary to make it valid and enforceable. \n \nThe European Commission may publish other linguistic versions and/or new versions \nof this Licence, so far this is required and reasonable, without reducing the scope of \nthe rights granted by the Licence. New versions of the Licence will be published with \na unique version number. \n \nAll linguistic versions of this Licence, approved by the European Commission, have \nidentical value. Parties can take advantage of the linguistic version of their choice.  \n   \n14. Jurisdiction \n \nAny litigation resulting from the interpretation of this License, arising between the \nEuropean Commission, as a Licensor, and any Licensee, will be subject to the \njurisdiction of the Court of Justice of the European Communities, as laid down in \narticle 238 of the Treaty establishing the European Community. \n \nAny litigation arising between Parties, other than the European Commission, and \nresulting from the interpretation of this License, will be subject to the exclusive \njurisdiction of the competent court where the Licensor resides or conducts its primary \nbusiness. \n \n15. Applicable Law \n \nThis Licence shall be governed by the law of the European Union country where the \nLicensor resides or has his registered office. \n \nThis licence shall be governed by the Belgian law if: \n \n- a litigation arises between the European Commission, as a Licensor, and any \nLicensee; \n- the Licensor, other than the European Commission, has no residence or \nregistered office inside a European Union country.","__impliedURLs":[["SPDX","http://spdx.org/licenses/EUPL-1.1.json"],[null,"https://joinup.ec.europa.eu/software/page/eupl/licence-eupl"],[null,"https://joinup.ec.europa.eu/sites/default/files/custom-page/attachment/eupl1.1.-licence-en_0.pdf"],[null,"https://opensource.org/licenses/EUPL-1.1"],["Homepage","http://ec.europa.eu/idabc/eupl"],[null,"http://www.gnu.org/licenses/license-list.html#EUPL"],[null,"http://www.opensource.org/licenses/EUPL-1.1"],[null,"http://www.osor.eu/eupl/european-union-public-licence-eupl-v.1.1"],[null,"https://joinup.ec.europa.eu/system/files/EN/EUPL%20v.1.1%20-%20Licence.pdf"],["OSI Page","https://opensource.org/licenses/EUPL-1.1"]]}