Repository: maxhbr/LDBcollector
Catalog: oscad/locale/*/LC_MESSAGES/oscad.po
Languages: de, fr

source: your legal expert
de: ihren Rechtsexperten
fr: votre expert juridique

source: New Request
de: Neue Anfrage
fr: Nouvelle demande

source: Matrix Request
de: Matrix Anfrage
fr: Demande de matrice

source: About
de: Über
fr: À propos

source: Components
de: Komponenten
fr: éléments

source: Help
de: Hilfe
fr: Aide

source: Imprint
de: Impressum
fr: Imprimer

source: application
de: Anwendung

source: library
de: Bibliothek
fr: bibliothèque

source: use
de: nutzen
fr: utiliser

source: distribute
de: verteilen
fr: distribuer une forme

source: an
de: eine
fr: un logiciel

source: unmodified
de: unveränderte
fr: inchangé

source: a
de: eine
fr: un logiciel

source: modified
de: veränderte
fr: modifié

source: sources
de: Quellcode
fr: fichiers source

source: binary files
de: Binärdateien
fr: fichiers binaires

source: sources or binary files
de: Quellcode oder Binärdateien

source: independent
de: unabhängige
fr: indépendant

source: piece of software
de: Software
fr: logiciel

source: embedded
de: eingebettet
fr: intégré

source: in my own software development
de: bei meiner eigenen Softwareentwicklung
fr: dans le cadre du développement de mon propre logiciel

source: locally
de: lokal

source: over the internet
de: über das Internet

source: Missing parameter: %(param)s
de: Fehlender Parameter: %(param)s
fr: Paramètre manquant: %(param)s

source: The combination of parameters you have entered is invalid
de: Die Kombination der eingegebenen Parameter ist ungültig
fr: La combinaison de paramètres fournis est invalide

source: The license "%(license)s" you have entered is not covered by this application
de: Die Lizenz, "%(license)s" die Sie angegeben haben, wird von dieser Anwendung nicht abgedeckt
fr: La licence "%(license)s" n'est pas couverte par cette application

source: This site is running version %(oscad_version)s of the OSCAd software.
de: Diese Seite basiert auf Version %(oscad_version)s der OSCAd software.
fr: Ce site utilise la version %(oscad_version)s du OSCAd.

source: License
de: Lizenz
fr: Licence

source: The OSCAd software is licensed under the %(agpl3)s.
de: Dies OSCAd software wird bereitgestellt unter der %(agpl3)s
fr: OSCAd est protégée sous licence %(agpl3)s

source: Source Code
de: Quellcode
fr: fichiers source

source: The source code for the OSCAd software is available on %(github)s.
de: Der Quellcode für die OSCAd software ist auf %(github)s verfügbar.

source: Development
de: Entwicklung
fr: Développement

source: The %(oscad)s is intended to be developed in collaboration with the Open Source Community. The task lists presented by the OSCAd strictly follow the %(oslic)s.
de: Der %(oscad)s ist offen für alle, die an einer Verbesserung dieser Anwendung Interesse haben. Die hier veröffentlichte Taskliste entspricht eins-zu-eins der Liste, die für %(oslic)s gepflegt wird.
fr: Le programme %(oscad)s est conçu pour être développé en collaboration avec la communauté Open Source. La liste des tâches présentée par l'OSCAd suit strictement les directives de la feuille de route %(oslic)s.

source: This OSLiC was presented on the European Legal and Licensing Workshop 2013 in Amsterdam. It was very welcomed. But the very benevolent feedback of this meeting also expressed the need to have an interactive version of the OSLiC instead of being thrown back to the slightly unwieldy pdf version. The OSCAd seizes this idea. Initially, the OSCAd was developed by some employees of Deutsche Telekom AG.
de: OSLiC wurde zuerst auf dem European Legal and Licensing Workshop 2013 in Amsterdam vorgestellt, wo es von der Open Source Community wohlwollend aufgenommen wurde. Aber zwischen den den Zeilen wurde wiederholt ausgedrückt, dass ein interaktiver Zugang zu den in OSLiC enthaltenen Informationen der Community einen noch größeren Nutzen bringen könnte, als das 300seitige PDF-Kompendium. Mit der Entwicklung von OSCAd durch einige Entwickler der Deutschen Telekom wurde dieser Wunsch erfüllt.
fr: Cette feuille de route OSLiC a été présentée dans le cadre du forum European Legal and Licensing Workshop qui s'est tenu à Amsterdam en 2013, où elle a été unanimement saluée. Les commentaires très bienveillants reçus lors de cette rencontre ont également exprimé la nécessité de disposer d'une version interactive de la feuille de route OSLiC, bien plus pratique que la version PDF. Les équipes d'OSCAd ont retenu cette idée. A l'origine, le programme OSCAd a été conçu par quelques employés de la société Deutsche Telekom AG.

source: This version here is a complete rewrite initiated and sponsored by %(amadeus)s. The new version is designed to fulfill requirements by Amadeus which the old version could not.
de: Die hier veröffentlichte Version ist eine von %(amadeus)s geförderte Neuimplementierung von OSCAd, in der spezifische Anforderungen von Amadeus berücksichtigt wurden, welche die frühere Version nicht erfüllte.
fr: Cette version correspond à une réécriture complète initiée par %(amadeus)s. La nouvelle version vise à répondre aux exigences d'Amadeus, ce que ne permettait pas l'ancienne version.

source: Author:
de: Autor:
fr: Auteur:

source: is currently engaged as a Systems Analyst at 'Amadeus Germany GmbH'. He is a contributor to various Open Source Projects and a member of the Amadeus Open Source initiative.
de: ist System Analytiker in der Amadeus Germany GmbH in Bad Homburg. Er arbeitet bei mehreren Open Source Projekten mit und ist Mitglied im Team der Amadeus Open Source Initiative.
fr: est Analyste Système à Amadeus Germany GmbH. Il contribue à plusieurs projets open source et est membre de l'initiative Amadeus Open Source.

source: is currently engaged as a Senior Expert at 'Deutsche Telekom AG / Products &amp; Innovation' and a leading member of the Telekom Open Source Review Board. Formerly he worked as PMI certified Project Manager, Certified ScrumMaster, Technical Project Leader, IT System Specialist, and Programmer. He is the mentor of the (Telekom) Open Source License Compendium and initiator of the (Telekom) Open Source Compliance Advisor.
de: ist Senior Experte der Deutschen Telekom AG im Bereich Products &amp; Innovation' und führendes Mitglied im Telekom Open Source Review Board. Zuvor war er als PMI zertifizierter Projektleiter, Scrum Master, IT Systemspezialist und Programmierer tätig. Er war der Initiator und erste Entwickler des (Telekom) Open Source License Compendium und des (Telekom) Open Source Compliance Advisor.
fr: occupe actuellement le poste de Senior Expert chez Deutsche Telekom AG/Products &amp; Innovation, et est un membre essentiel du comité de vérification Open Source de Deutsche Telekom. Auparavant, il a occupé les fonctions de chef de projet certifié PMI, ScrumMaster certifié, chef de projet technique, spécialiste des systèmes informatiques et programmeur. Il est le mentor du compendium sur les licences open source (Telekom) et est à l'origine du comité de conseil sur la conformité open source (Telekom).

source: Contributors
de: Mitarbeiter
fr: Contributeurs

source: Generously, we got help by
de: Wir bedanken uns für die großzügige Unterstützung durch
fr: Nous ont généreusement accompagnés dans cette démarche:

source: Sponsoring Companies
de: Unterstützende Firmen
fr: Partenaires

source: What do I have to do for using or distributing a piece of open source software in accordance to specific open source license &mdash; as a modified or unmodified, embedded or independent application or library, used or distributed in the form of binaries or sources?
de: Was muss ich tun, um eine Open Source Software in Übereinstimmung mit einer bestimmten Open Source Lizenz zu nutzen oder weiterzuverteilen &mdash; als veränderte oder unveränderte, eingebettete oder unabhängige Anwendung oder Bibliothek, genutzt oder verteilt in Form von Quellcode oder Binärdateien?
fr: Que dois-je faire pour utiliser ou distribuer un logiciel open source conformément à la licence open source spécifique (sous la forme d'une application ou d'une bibliothèque modifiée ou inchangée, intégrée ou indépendante, utilisée ou distribuée sous la forme de fichiers binaires ou de fichiers source)?

source: Usage
de: Nutzungsart

source: Dependencies
de: Abhängigkeiten
fr: les dépendances

source: Backend for the Web Application
de: Backend der Webanwendung
fr: Backend pour l'application Web

source: Templating for the Web Application
de: Vorlagen für die Webanwendung
fr: Création de modèles pour l'application Web

source: Dynamic creation of CSS Stylesheets
de: Dynamische Generierung von CSS Stylesheets
fr: la création dynamique de feuilles de style CSS

source: Translation support and workflow
de: Übersetzungshilfe und -Prozess
fr: Aide à la traduction et de workflow

source: Embedded Components
de: Eingebettete Komponenten
fr: éléments intégrés

source: Base CSS Stylesheets
de: Basis CSS Stylesheets
fr: base feuille de style CSS

source: Translations
de: Übersetzungen
fr: traductions

source: Here you can download the Gettext translation files used in this instance of OSCAd. They are not PowerPoint files (even if your browser tells you so). Open them with a dedicated Gettext editor or a generic text editor.
de: Hier finden Sie die Dateien mit den Gettext Sprachvarianten, die in OSCAd verwendet werden. Es handelt sich hierbei nicht um PowerPoint-Dateien, auch wenn der Browser es so interpretiert. Sie müssen mit einem speziellen Gettext Editor oder mit einem anderen generischen Texteditor bearbeitet werden.
fr: Ici vous pouvez télécharger les fichiers de traduction de Gettext utilisés dans cette instance de OSCAd. Ils ne sont pas des fichiers PowerPoint (même si votre browser vous le dit). Les ouvrir avec un éditeur dédié de Gettext ou un éditeur de texte générique.

source: Empty template (english)
de: Leere Vorlage (englisch)
fr: Modèle vide (anglais)

source: Parameters
de: Parameter
fr: Paramètres

source: Type
de: Typ

source: What does this mean: proapse or snimoli?
de: Was bedeutet dies: proapse oder snimoli?
fr: Que signifient les termes proapse et snimoli?

source: A piece of (open source) software is a program, an application, or a server [proapse], only if you can start its binary form with your normal program launcher, or (in case of a text file which still must be interpreted by an interpreter like php, perl, bash etc.) if you can start an interpreter which takes the file as one of its arguments and executes the commands. In all other cases, it is a snippet, a module, a library or a plugin (snimoli)
de: Open Source Software in diesem Sinne ist ein ausführbares Programm, eine Anwendung/Applikation, oder ein Server [proapse]. Diese Art Software soll durch einen normalen Programmstart ausgeführt werden, oder, im Falle von Quellcode in Textdateien (wie PHP, Perl, bash etc.) durch einen Interpreter. In allen anderen Fällen geht man davon aus, dass es sich vereinzelte Codeteile (snippets), Module, Bibliotheken oder PlugIns handelt [snimoli].
fr: Un logiciel (open source) est un programme, une application ou un serveur [proapse], seulement si vous pouvez lancer sa forme binaire avec votre outil de lancement de programme standard ou, dans le cas d'un fichier texte devant être traité par un interpréteur spécifique (php, perl, bash, etc.), si vous pouvez lancer un interpréteur qui traite le fichier en tant qu'argument et exécute les commandes correspondantes. Dans tous les autres cas, il s'agit d'un fragment de code, d'un module, d'une bibliothèque ou d'un plugin (snimoli).

source: Context
de: Kontext
fr: Contexte

source: What does this mean: independent or embedded?
de: Was bedeutet dies: unabhängig oder eingebettet?
fr: Que signifient les termes indépendant et intégré?

source: You are using a piece of open source software as an embedded component of a larger unit if [a] one of your files of the larger unit contains a verbatim or a modified copy (i.e. a snippet) of the received open source software, or [b] if your larger unit contains an include statement referring to a functionally defining file of the received open source software, or [c] if your larger unit calls a function defined in the received open source software, or [d] if your development environment contains a compiler or linker directive referring to the received open source software (binaries) and if your larger unit can't be executed without resolving this linker directive.
de: Um eine eingebettete Opne Source Software Komponente handelt es sich, wenn [a] eine übergeordnete Programmeinheit eine originale oder modifizierte Kopie ( auch ein Snippet) der eingebauten Software enthält, oder [b] die übergeordnete Einheit einen Include-Befehl für eine die Funktionen der Open Source Software bereitstellende Datei aufweist. oder [c] die übergeordnete Einheit eine in der Opne Source Software definierte Funktion aufruft, oder [d] wenn in der Entwicklungsumgebung eine Compiler- oder Linker-Direktive existiert, welche die Binärversionen der Open Source Software referenziert, ohne die dann das übergeordnete Programm nicht lauffähig ist.
fr: Vous utilisez un logiciel open source en tant que composant intégré d'une unité plus importante si [a] l'un de vos fichiers de l'unité plus importante contient une copie intégrale ou modifiée (soit un fragment de code) du logiciel open source reçu, [b] si votre unité plus importante contient une instruction d'inclusion faisant référence à un fichier de définition fonctionnelle du logiciel open source que vous avez reçu, [c] si votre unité plus importante appelle une fonction définie dans le logiciel open source que vous avez reçu, ou [d] si votre environnement de développement comporte une directive de compilation ou de liaison faisant référence au logiciel open source que vous avez reçu (fichiers binaires) et si votre unité plus importante ne peut être exécutée sans résoudre cette directive de liaison.

source: On the opposite, if you are using an open source application [proapse] (which can directly be executed by your operating system or by an interpreter) or if you are distributing an open source snippet, module or library without embedding it into a larger 'on-top application', then you are using this piece of open source software independendly.
de: Der gegenteilige Fall einer unabhängigen Nutzung tritt ein, wenn eine Open Source Anwendung vorliegt (im Sinne von proapse), die eigenständig lauffähig ist oder interpretiert wird, oder wenn ein Open Source Snippet, ein Modul oder eine Bibliothek verwendet wird, die jeweils nicht in einen übergeordneten Programmkontext eingebunden sind.
fr: Inversement, si vous utilisez une application open source [proapse] (pouvant être directement exécutée par votre système d'exploitation ou par un interpréteur) ou si vous distribuez un fragment de code, un module ou une bibliothèque open source sans l'intégrer dans une application de plus haut niveau, cela indique que vous utilisez ce logiciel open source de manière indépendante.

source: So, we can say that ...
de: Es kann somit gesagt werden, dass ...
fr: Nous pouvons donc dire que ...

source: an application is used independendly per definition.
de: eine Anwendung ist grundsätzlich eine unabhängig lauffähige Software.
fr: Par définition, une application est utilisée de manière indépendante.

source: often open source distributions contain libraries which are not used by one of its applications, but are offered to the software developer - so the distributor is using this library independly.
de: es kommt häufig vor, dass Softwarepakete weitere Bibliotheken enthalten, die nicht zur Ausführung der Software herangezogen werden. Werden diese Bibliotheken mit ausgeliefert, so sind Sie diesem Fall als unabhängige Softwarekomponenten zu behandeln.
fr: Il arrive souvent que les distributions open source contiennent des bibliothèques qui ne sont pas utilisées par l'une de leurs applications, mais qui sont proposées au développeur. Dans ce cas, le distributeur utilise cette bibliothèque de manière indépendante.

source: State
de: Zustand
fr: État

source: What does this mean: modified or unmodified?
de: Was bedeutet dies: verändert oder unverändert?
fr: Que signifient les termes modifié et inchangé?

source: You are modifying a piece of (open source) software if you expand, reduce or modify at least one of the received software files, and - in case of dealing with binary object code - if you (re)compile and (re)link the modified software to a new binary file [modified]. But if you use / distribute the software as you have got it, you do not modify it [unmodified].
de: Eine Open Source Software Komponente gilt als modifiziert, wenn zumindest eine Datei der erhaltenen Sourcen erweitert, gekürzt oder sonst irgendwie verändert wurde. Das gleich gilt, wenn binärer Objektcode verändert wird und ein neues Binärfile entsteht [modified]. Software, die so genutzt oder weitergegeben wird, wie Sie vom Hersteller/ Verteiler erhalten wurde, gilt als nicht verändert [unmodified].
fr: Vous modifiez un logiciel (open source) si vous développez, réduisez ou modifiez au moins un des fichiers logiciels reçus et, dans le cas de code d'objet binaire, si vous (re)compilez et (re)liez le logiciel modifié dans un nouveau fichier binaire [modifié]. En revanche, si vous utilisez ou distribuez le logiciel tel que vous l'avez reçu, vous ne le modifiez pas (forme inchangée).

source: Note: if you only modify some of the configuration files, you are not modifying the open source software itself.
de: Hinweis: wenn nur Konfigurationsdateien einer Software verändert werden, so gilt das nicht als Veränderung der Open Source Software selbst!
fr: Remarque: si vous modifiez seulement une partie des fichiers de configuration, vous ne modifiez pas le logiciel open source lui-même.

source: Recipient
de: Empfänger
fr: Destinataire

source: What does this mean: 4yourself or 2others?
de: Was bedeutet dies: 4yourself oder 2others?
fr: Que signifient les termes 4yourself et 2others?

source: You are using the received open source software only for yourself (4yourself), if you as a person do not pass it to other entities like persons, organizations, companies etc., or if you - as a member of a specific development group - pass it only to the other members of your development group. But if you store open source software on any device such as a mobile phone, an USB stick, etc. or if you attach it to any transport medium like email etc. and if you then sell, give away, or simply send this device or transport medium to anyone (other than a direct member of your development group) then you indeed handover the open source software to third parties (2others).
de: Erhaltene Open Source Software gilt als selbstgenutzt (4yourself), wenn Sie nicht an andere Personen, Organisationen, Firmen etc. weitergegeben wird, oder wenn Sie nur innerhalb der einer Entwicklungsorganisation von mehreren Personen verwendet wird. Wenn aber die Open Source Software auf irgendwelchen mobilen Geräten wie Handies, USB Sticks etc. oder in E-Mails gespeichert ist und diese mobilen Formen an Personen, Organisationen oder Firmen außerhalb der eigenen Organisation weitergereicht werden (verkauft oder unentgeltlich), dann handelt es sich um eine Weitergabe an Dritte (2others).
fr: Vous utilisez le logiciel open source que vous avez reçu uniquement pour vous-même (4yourself), si, en tant qu'individu, vous ne le transmettez pas à d'autres entités telles que des personnes, organisations, entreprises, etc. ou si, en tant que membre d'un groupe de développement spécifique, vous le transmettez uniquement aux autres membres de votre groupe de développement. Toutefois, si vous stockez votre logiciel open source sur un périphérique tel qu'un téléphone portable, une clé USB, etc. ou si vous l'insérez en tant que pièce jointe à un support tel qu'un e-mail, en vue de vendre, céder ou simplement envoyer ce périphérique ou ce support à un tiers (autre qu'un membre direct de votre groupe de développement), dans ce cas vous transmettez effectivement le logiciel open source à des tiers (2others).

source: What does this mean: sources or binaries?
de: Was bedeutet dies: Quellcode oder Binärdateien
fr: Que signifient les termes fichiers source et fichiers binaires?

source: Sometimes it is up to you to decide whether you want to distribute only the binaries or whether you are intentionally going to distribute the sources (too). These are the two forms of distributed open source software. But in some cases, you have to respect some special conditions if you want to distribute the sources and/or the binaries.
de: Manchmal steht es im eigenen Ermessen, ob man nur die ausführbaren Programme einer erhaltenen Open Source Software weitergibt, oder auch die Sourcen. In einigen Fällen schreiben die Lizenzen von Open Source Softwareprodukten unterschiedliche Vorgehensweisen vor, je nachdem ob, Quellcode oder ausführbare Programme genutzt oder weitergegeben werden.
fr: Il arrive parfois que vous deviez décider entre distribuer uniquement les fichiers binaires ou également les fichiers source. Il s'agit des deux formes de logiciels open source distribués. Mais dans certains cas, vous devez respecter certaines conditions pour pouvoir distribuer les fichiers source et/ou binaires.

source: Access
de: Zugriff

source: What does this mean: viaInternet or onlyLocally
de: Was bedeutet dies: viaInternet oder onlyLocally?

source: Known licenses
de: Bekannte Lizenzen
fr: Licences connues

source: Planned licenses
de: Geplante Lizenzen
fr: Licences planifiées

source: Focus
de: Fokus
fr: Cible

source: Question
de: Frage

source: Answer
de: Antwort
fr: Réponse

source: Is the open source software you want to use a library in the broadest sense (an includable code {sni}ppet, a linkable {mo}dule or {li}brary, or a loadable plugin), or is it an autonomous {pro}gram, {ap}plication or {se}rver which can be executed?
de: Ist die Open Source Software, die Sie nutzen möchten, eine Bibliothek im weitesten Sinne? Ein inkludierbarer Codeschnipsel ({sni}ppet), ein linkbares Modul ({mo}dule) oder Bibliothek ({li}brary), oder ein ladbares Plugin. Oder ist es ein selbstständiges {Prog}ramm, Anwendung {ap}plication oder {Se}rver, welches ausgeführt werden kann?
fr: Le logiciel que vous désirez utiliser est-il une bibliothèque au sens large (un fragment de code [ou {sni}ppet], un {mo}dule ou une {li}brairie lié, ou un plugin), ou s'agit-il d'un {pro}gramme, d'une {ap}plication ou d'un {se}rveur s'éxécutant de façon autonome?

source: Given you want to use a library in the broadest sense, are you going to use / distribute this open source software as an {independent} unit, or do you plan to integrate it as an {embedded} component into a complexer piece of software?
de: Angenommen, Sie nutzen eine Bibliothek im weitesten Sinne. Werden Sie diese als unabhängige Einheit ({independent}) nutzen und weiterverteilen, oder planen Sie diese als Komponente in eine komplexere Software einzubetten ({embedded})
fr: Dans le cas d'une bibliothèque au sens large, allez-vous utiliser / distribuer ce logiciel open source de façon {indépendante} ou comptez-vous l'intégrer dans un composant {intégré} dans un logiciel plus complexe?

source: Do you want to leave the open source software {unmodified} as you have received it, or are you going to create a {modified} version of it?
de: Wollen Sie die Open Source software unverändert ({unmodified}), so wie Sie sie erhalten haben, oder werden sie eine modifizierte ({modified}) Version davon erstellen?
fr: Désirez-vous laisser le logiciel open source {inchangé} tel que vous l'avez reçu ou prévoyez-vous d'en créer une version {modifiée}?
