Repository: maxhbr/LDBcollector
Catalog: oscad/locale/*/LC_MESSAGES/oscad.po
Languages: de, fr

source: Are you going to use the open source software only {for yourself}, or do you plan to (re)distribute it (also) {to other} third parties?
de: Werden Sie die Open Source Software nur für sich selbst verwenden ({for yourself}) oder planen Sie diese (auch) an Dritte (weiter) zu verbreiten ({to other})?
fr: Allez-vous utiliser le logiciel open source à des fins {personnelles} ou prévoyez-vous (par ailleurs) de le (re)distribuer à des {tiers}?

source: Given you want to (re)distribute an open source based work [2others], do you focus on distributing the {binaries} or the {sources}?
de: Angenommen, Sie wollen das Open Source Werk an andere (weiter) verteilen, wird dies als Quellcode ({sources}) oder Binärdateien ({binaries}) geschehen?
fr: Dans le cas d'une (re)distribution de matériel open source, comptez-vous fournir les fichiers {binaires} ou les fichiers {sources}?

source: IoAccess
de: Ein-/Ausgabezugriff

source: Given you are using open source software [4yourself] by executing a modified os program [modified] or by creating & executing a program using an os library [embedded], does this program consume or produce data {only locally} or {via internet}?
de: Angenommen, Sie nutzen ein Open Source Werk [4yourself] indem sie eine modifizierte Fassung ausführen [modified] oder durch die Erstellung und Ausführung eines Programmes, das eine Open Source Bibliothek nutzt [embedded], werden die Ein- und Ausgabe des Programmes nur lokal ({only Locally}) oder über das Internet ({via internet}) durchgeführt?

source: Under which open source license is the software released you want to use?
de: Unter welcher Open Source Lizenz wurde die zu nutzende Software veröffentlicht?
fr: Sous quelle licence open source le logiciel que vous souhaitez utiliser est-il distribué?

source: known
de: bekannt
fr: connu

source: planned
de: geplant
fr: planifié

source: Submit request
de: Anfrage abschicken
fr: Envoyer la demande

source: Hint
de: Hinweis
fr: Notice

source: The OSLiC and the OSCAd are dealing with prototypic use cases. If you feel, that your specific case can't be specified by this form or is irregularly covered by one of the cases (false positives), please contact %(legal_expert)s. If you feel that your specific case is irregularly not covered by our taxonomy (false negative), contact us, please!
de: OSLiC und OSCAd behandeln prototypische Anwendungsfälle. Wenn Sie meinen, dass ihr spezifischer Fall in dieser Abfrage nicht dargestellt werden kann der fälschlicherweise durch einen dieser Anwendungsfälle abgedeckt ist (false positive), kontaktieren Sie bitte %(legal_expert)s. Wenn Sie denken, dass ihr spezifischer Anwendungsfall fälschlicherweise von unserer Taxonomie nicht abgedeckt ist (false negative), so kontaktieren Sie bitte uns.
fr: Les équipes OSLiC et OSCAd se concentrent sur les cas d'utilisation typiques. Si vous avez l'impression que votre cas particulier ne peut être inclus dans cette feuille de route ou qu'il n'est pas entièrement couvert par l'un de nos cas d'utilisation ("faux positifs"), veuillez contacter %(legal_expert)s . Si vous avez l'impression que votre cas particulier n'est pas correctement couvert par notre taxonomie ("faux négatif"), merci de nous contacter!

source: Results
de: Ergebnisse
fr: Résultats

source: Request:
de: Anfrage:
fr: Demande:

source: Provided I want to %(recipient)s %(state_article)s %(state)s open source %(type)s in the form of %(form)s as an %(context)s %(context_suffix)s %(ioaccess)s, what do I have to do for acting in accordance to the %(license)s?
de: Angenommen, ich will %(state_article)s %(state)s Open Source %(type)s in Form von %(form)s als %(context)s %(context_suffix)s %(recipient)s %(ioaccess)s, was muss ich tun um den Bedingungen der %(license)s zu entsprechen?

source: refers to
de: bezieht sich auf
fr: renvoie à

source: connotes w.r.t. %(lsuc_name)s:
de: bedeutet in Bezug auf %(lsuc_name)s:
fr: connote w.r.t. %(lsuc_name)s:

source: requires:
de: verlangt:
fr: exige:

source: mandatory:
de: obligatorisch:
fr: obligatoire:

source: voluntary:
de: freiwillig:

source: forbids:
de: verbietet:
fr: interdit:

source: Background information: For a deeper understanding of the reasons why these tasks are fulfilling the license %(lsuc_license_name)s in respect to %(osuc_name)s see OSLiC chapter %(lsuc_oslic_todo)s especially chapter %(lsuc_oslic_lsuc)s and chapter %(lsuc_oslic_explain)s. For further information on the protecting power of the license %(lsuc_license_name)s, see OSLiC chapter %(lsuc_oslic_protection)s.
de: Hintergrundinformationen: Für ein besseres Verständnis der Gründe aus denen diese Maßnahmen die Lizenz %(lsuc_license_name)s in Bezug auf %(osuc_name)s erfüllen, lesen Sie das OSLiC Kapitel %(lsuc_oslic_todo)s, insbesondere Kapitel %(lsuc_oslic_lsuc)s und %(lsuc_oslic_explain)s. Weitere Informationen zu der Schutzwirkung von %(lsuc_license_name)s können Sie im OSLiC Kapitel %(lsuc_oslic_protection)s nachlesen.
fr: Informations de référence : pour une analyse plus approfondie des raisons pour lesquelles ces tâches ne sont pas conformes à la licence %(lsuc_license_name)s concernant %(osuc_name)s, reportez-vous aux chapitres de la feuille de route OSLiC %(lsuc_oslic_todo)s, en particulier les sections %(lsuc_oslic_lsuc)s et %(lsuc_oslic_explain)s. Pour en savoir plus sur le pouvoir de protection de la licence %(lsuc_license_name)s, reportez-vous au chapitre %(lsuc_oslic_protection)s de la feuille de route OSLiC.

source: Concerning the open source use cases in general, see OSLiC chapter %(oslic_chapter_general_1)s and %(oslic_chapter_general_2)s. Finally, %(lsuc_license_name)s contains a patent clause; for details see OSLiC chapter %(lsuc_oslic_patent)s.
de: Die Open Sources Anwendungsfälle allgemein betreffend, vergleichen Sie OSLiC Kapitel %(oslic_chapter_general_1)s und %(oslic_chapter_general_2)s. Letztendlich beinhaltet die %(lsuc_license_name)s eine Patentklausel; Details hierzu finden Sie in OSLiC Kapitel %(lsuc_oslic_patent)s
fr: Concernant les cas d'utilisation des logiciels open source en général, reportez-vous aux chapitres %(oslic_chapter_general_1)s et %(oslic_chapter_general_2)s de la feuille de route OSLiC. Pour finir, %(lsuc_license_name)s comporte une clause de brevet ; pour en savoir plus, reportez-vous au chapitre %(lsuc_oslic_patent)s de la feuille de route OSLiC.

source: Initiator:
fr: Initiateur:

source: Name
fr: nom

source: Javascript utilities
fr: les librairies javascript

source: Form
fr: Forme

source: Provided I want to %(recipient)s %(state_article)s %(state)s open source %(type)s in the form of %(form)s as an %(context)s %(context_suffix)s, what do I have to do for acting in accordance to the %(license)s?
fr: Supposons que je souhaite utiliser le logiciel %(type)s open source %(recipient)s %(state_article)s %(state)s sous forme %(form)s dans le cadre d'un %(context)s %(context_suffix)s, comment dois-je procéder pour me conformer à la %(license)s?
